{"id": "0a091125", "examenData": {"id": "149836", "fecha": "2025-04-10", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál es el principal objetivo de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Minimizar la latencia y mejorar la capacidad de respuesta", "valor": "A"}, {"texto": "B) Maximizar el uso de recursos de hardware", "valor": "B"}, {"texto": "C) Reducir la complejidad del código fuente", "valor": "C"}, {"texto": "D) Aumentar el acoplamiento entre componentes", "valor": "D"}, {"texto": "E) Limitar la escalabilidad del sistema", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1. **Compara y contrasta la arquitectura en capas con la arquitectura hexagonal, explicando sus ventajas, desventajas y casos de uso típicos. Incluye ejemplos concretos para ilustrar tus puntos.** (Intermedio)", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso 1-1**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos como el Black Friday, garantizando alta disponibilidad y respuestas en tiempo real para actualizaciones de inventario y notificaciones a los usuarios.  \n\n**Preguntas casos de uso:**  \n1. ¿Cómo diseñarías un sistema reactivo para procesar órdenes y actualizar el inventario en tiempo real, evitando sobrecargas?  \n2. ¿Qué estrategias utilizarías para notificar a los usuarios sobre cambios en el estado de sus pedidos sin afectar el rendimiento del sistema?  \n\n**Requisitos específicos:**  \n- Implementar un sistema basado en mensajería asíncrona.  \n- Garantizar consistencia eventual en las actualizaciones de inventario.  \n- Usar un enfoque reactivo para manejar concurrencia alta.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Kafka, Akka, Spring WebFlux, MongoDB (para almacenamiento reactivo).  \n- Enfoques: Event Sourcing, CQRS, backpressure para manejo de carga.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-10T18:19:18.952189", "expiration": "2025-04-17T23:19:18.924Z", "publicAccess": true}