{"id": "265a7920", "examenData": {"id": "177981", "fecha": "2025-04-16", "profesor": "Mariela Isabel Camargo Román", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál de las siguientes es una característica principal de las arquitecturas reactivas?", "puntaje": 5, "opciones": [{"texto": "A) Escalabilidad limitada", "valor": "A"}, {"texto": "B) Acoplamiento fuerte entre componentes", "valor": "B"}, {"texto": "C) Respuesta en tiempo real a eventos", "valor": "C"}, {"texto": "D) Dependencia de bases de datos relacionales", "valor": "D"}, {"texto": "E) Uso exclusivo de lenguajes de programación estáticos", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1. **Compara y contrasta las arquitecturas en capas y hexagonal en términos de acoplamineto, flexibilidad y mantenibilidad. Proporciona ejemplos concretos de escenarios donde cada una sería más adecuada.** (Avanzado)", "puntaje": 5, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso 1-1**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos como el Black Friday, donde miles de usuarios realizan compras simultáneamente. El sistema debe procesar órdenes en tiempo real, garantizar la consistencia de los datos y escalar automáticamente según la demanda.  \n\n**Preguntas de caso de uso:**  \n1. ¿Cómo implementarías un sistema de procesamiento de órdenes reactivo que maneje alta concurrencia y garantice la consistencia de los datos?  \n2. ¿Qué estrategias de escalamiento automático podrían usarse para ajustar los recursos durante picos de tráfico?  \n\n**Requisitos específicos:**  \n- Implementar un servicio de órdenes usando un enfoque reactivo (ej. event sourcing, CQRS).  \n- Asegurar la resiliencia mediante patrones como circuit breakers o retries.  \n- Configurar autoescalamiento basado en métricas como CPU o latencia.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Akka, Spring WebFlux, Kafka, Kubernetes (HPA).  \n- Enfoques: Event-driven architecture, serverless (AWS Lambda).", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-16T17:55:47.425401", "expiration": "2025-04-23T22:55:47.404Z", "publicAccess": true}