{"id": "31840a6c", "examenData": {"email": "smartlabelperu@gmail.com", "examen_id": "155650", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-06-25T21:49:31.130Z", "nombre_profesor": "Mariela Isabel Camargo Roman", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño es crucial para la gestión de errores en un sistema reactivo?\nA) Singleton\nB) Factory\nC) Circuit Breaker\nD) Observer\nE) Strategy", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 2, "texto": "¿Qué tecnología es comúnmente utilizada para la implementación de flujos de datos reactivos?\nA) JDBC\nB) Spring MVC\nC) RxJava\nD) Hibernate\nE) JSF", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 3, "texto": "¿Cuál es el beneficio principal de la elasticidad en una arquitectura reactiva?\nA) Mayor seguridad\nB) Menor latencia\nC) Adaptabilidad a la carga\nD) Simplificación del código\nE) Aumento de la complejidad", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 4, "texto": "¿Qué característica describe mejor la resiliencia en un sistema reactivo?\nA) Capacidad de auto-reparación\nB) Alta velocidad de procesamiento\nC) Uso eficiente de recursos\nD) Escalabilidad horizontal\nE) Simplicidad de implementación", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 5, "texto": "¿Cuál de las siguientes opciones describe mejor el concepto de \"backpressure\" en un sistema reactivo?\nA)  Manejo de errores\nB)  Control del flujo de datos\nC)  Escalamiento vertical\nD)  Optimización de la base de datos\nE)  Implementación de microservicios", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 6, "texto": "¿Qué patrón de diseño se utiliza frecuentemente para manejar la concurrencia en sistemas reactivos?\nA) Singleton\nB) Factory\nC) Actor\nD) Observer\nE) Strategy", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 7, "texto": "¿Cuál es la principal ventaja de usar un backpressure en un sistema reactivo?\nA) Mejora la latencia\nB) Reduce la complejidad\nC) Previene el colapso del sistema por sobrecarga\nD) Aumenta el rendimiento de escritura\nE) Simplifica la gestión de transacciones", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 8, "texto": "¿Qué tecnología es comúnmente utilizada para implementar flujos de datos reactivos?\nA) JDBC\nB) Spring MVC\nC) RxJava\nD) Hibernate\nE) JPA", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 9, "texto": "¿Cuál de las siguientes afirmaciones sobre la elasticidad en un sistema reactivo es FALSA?\nA) Permite escalar horizontalmente.\nB) Responde a las fluctuaciones de la carga.\nC) Requiere una infraestructura fija.\nD) Optimiza el uso de recursos.\nE) Mejora la disponibilidad.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 10, "texto": "¿Qué concepto describe la capacidad de un sistema reactivo para continuar operando a pesar de fallos?\nA) Elasticidad\nB) Responsividad\nC) Resiliencia\nD) Orientación a mensajes\nE) Backpressure", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}], "preguntas_libres": [{"numero": 11, "texto": "En un entorno distribuido, explique cómo las arquitecturas reactivas abordan la problemática de la falta de consistencia estricta en transacciones. Describa los mecanismos o patrones utilizados para garantizar la coherencia eventual y minimizar el impacto en la experiencia del usuario.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Las arquitecturas reactivas en entornos distribuidos abordan la falta de consistencia estricta mediante la aceptación de la *coherencia eventual*.  En lugar de bloquear transacciones hasta lograr consistencia inmediata, priorizan la disponibilidad y la tolerancia a fallos.  Utilizan patrones como CQRS (Command Query Responsibility Segregation) y Event Sourcing para desacoplar la escritura y lectura de datos.  Al persistir los cambios como una secuencia inmutable de eventos, se facilita la replicación asíncrona y la reconstrucción del estado.  Mecanismos como Sagas orquestan transacciones distribuidas compensables, revirtiendo operaciones previas en caso de fallo para mantener la consistencia eventual.  Para minimizar el impacto en la experiencia del usuario, se implementan estrategias como el optimismo compensatorio, mostrando la actualización inmediatamente y notificando posteriormente cualquier inconsistencia o realizando correcciones en segundo plano. La retroalimentación al usuario es crucial para mantener la transparencia.\n"}, {"numero": 12, "texto": "Diseñe un esquema de arquitectura reactiva para un servicio de procesamiento de pagos en tiempo real. Justifique la selección de componentes como actores (actors), buffers (buffers), o patrones de circuito (circuit breakers), y describa cómo se coordinarían para manejar fallos en microservicios de terceros.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Un sistema reactivo para procesar pagos en tiempo real puede basarse en actores para representar entidades como usuarios, comercios y bancos.  Cada actor gestiona su propio estado y se comunica con otros actores mediante mensajes asíncronos.  Buffers, como colas de mensajes (ej. Kafka), desacoplan los actores y permiten el manejo de picos de carga.  Patrones de circuito (circuit breakers, ej. Hystrix) protegen el sistema de fallos en microservicios de terceros, como pasarelas de pago, cambiando a un estado abierto y devolviendo una respuesta predefinida si se detectan fallos repetidos.  La coordinación se logra mediante el intercambio de mensajes entre actores.  Al recibir una solicitud de pago, el actor del usuario envía un mensaje al actor del comercio, que a su vez interactúa con el microservicio de la pasarela de pago a través de un circuit breaker.  Si la pasarela falla, el circuit breaker se abre, el actor del comercio recibe una notificación y puede informar al usuario o intentar un método de pago alternativo.  Este diseño asegura la resiliencia y la capacidad de respuesta del sistema incluso ante fallos externos.\n"}, {"numero": 13, "texto": "Contrastando con arquitecturas tradicionales, ¿qué ventajas y desafíos introduces al adoptar un enfoque estrictamente orientado a mensajes (message-driven) en un sistema reactiva? Analice cómo esto afecta la gestión de estados y la comunicación entre componentes en escenarios críticos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Las arquitecturas orientadas a mensajes (MOM) ofrecen ventajas significativas sobre las tradicionales en sistemas reactivos.  Facilitan el desacoplamiento, la escalabilidad y la resiliencia.  Al comunicar asíncronamente a través de mensajes, los componentes no necesitan conocerse directamente, permitiendo escalar y desplegar servicios independientemente.  Esta asincronía también mejora la tolerancia a fallos; si un componente falla, los mensajes se mantienen en cola hasta que esté disponible, evitando la caída del sistema.  \n\nSin embargo, MOM introduce desafíos. La gestión de estados se complejiza al no tener un estado compartido.  Cada componente gestiona su propio estado, requiriendo mecanismos de consistencia eventual.  La depuración y el rastreo de mensajes también son más difíciles.  En escenarios críticos, la garantía de entrega y el orden de los mensajes son cruciales, necesitando mecanismos robustos de manejo de errores y control de flujo.  La comunicación síncrona, necesaria en algunos casos, se vuelve más compleja de implementar.\n"}, {"numero": 14, "texto": "¿Cómo se puede integrar el concepto de \"elasticidad\" en una arquitectura reactiva para optimizar el uso de recursos en nubes dinámicas (por ejemplo, Kubernetes o AWS Auto Scaling)? Explique los ajustes necesarios en el diseño del sistema y las métricas que se deberían monitorear para activar esos mecanismos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "La elasticidad en arquitecturas reactivas permite ajustar dinámicamente los recursos según la demanda, optimizando el uso en nubes dinámicas como Kubernetes o AWS Auto Scaling.  Se integra mediante mecanismos de escalado automático basados en métricas clave.\n\nEl diseño del sistema debe incorporar componentes desacoplados y escalables independientemente.  Se utilizan colas de mensajes para la comunicación asíncrona, balanceadores de carga para distribuir el tráfico y bases de datos distribuidas para manejar la persistencia.  \n\nLas métricas cruciales a monitorear incluyen la latencia de las respuestas, el uso de CPU y memoria, la longitud de las colas y el número de requests por segundo.  Estas métricas activan reglas de escalado predefinidas en la plataforma de orquestación, aumentando o disminuyendo las instancias de los servicios según sea necesario. Esto asegura un rendimiento óptimo bajo fluctuaciones de carga y minimiza el costo de recursos inactivos.  Por ejemplo,  si la latencia supera un umbral, se despliegan más instancias del servicio afectado.\n"}], "casos_uso": [{"numero": 15, "descripcion": "**Plataforma de monitoreo de sensores IoT para agricultura**  \n   - **Escenario**: Granjas inteligentes necesitan procesar flujos de datos de sensores (humedad, temperatura) en tiempo real para tomar decisiones inmediatas sobre riego.  \n   - **Requisitos**: Diseñar una arquitectura reactiva que procese datos en streaming, aplique reglas de negocio y active alarmas si los valores superan umbrales críticos.  \n   - **Herramientas**: Reactor (Project Reactor), MQTT para comunicación con sensores, InfluxDB para series temporales, Grafana para visualización.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "La arquitectura propuesta utiliza Reactor para procesar el flujo de datos de sensores IoT en tiempo real y tomar decisiones sobre el riego. Los sensores publican datos de temperatura y humedad a través de MQTT. Un broker MQTT recibe estos mensajes y los reenvía a un servicio Reactor.\n\nEl servicio Reactor, implementado con Spring WebFlux, se suscribe al broker MQTT.  Utiliza `Flux` para representar el flujo continuo de datos.  Al recibir los datos, el flujo se procesa en varias etapas. Primero, se realiza una transformación para convertir los mensajes MQTT en objetos Java representando las lecturas de los sensores. Luego, se aplica un filtro para descartar valores erróneos o fuera de rango.\n\nPosteriormente, el flujo se divide en dos ramas. La primera rama persiste los datos en InfluxDB, una base de datos optimizada para series temporales, utilizando el cliente de InfluxDB para Java.  Esto permite el almacenamiento histórico de las mediciones para análisis posteriores y visualización en Grafana.\n\nLa segunda rama aplica las reglas de negocio.  `Flux.filter()` evalúa si los valores de temperatura o humedad superan los umbrales predefinidos. Si se detecta una anomalía, se genera una alarma.  Esta alarma puede ser una notificación a través de un servicio de mensajería como Slack o un correo electrónico al agricultor.  La lógica de las reglas de negocio se implementa como predicados dentro del operador `filter`.\n\nLa visualización se realiza con Grafana, que se conecta a InfluxDB.  Grafana permite crear dashboards interactivos que muestran la evolución de la temperatura y la humedad, facilitando la monitorización del estado del cultivo.  Además, se pueden configurar alertas en Grafana basadas en umbrales, proporcionando una capa adicional de seguridad.\n\nEsta arquitectura reactiva, basada en Reactor y  MQTT, proporciona una solución escalable y eficiente para el monitoreo en tiempo real de granjas inteligentes, permitiendo la toma de decisiones automatizada para el riego y la generación de alertas tempranas ante condiciones críticas.\n"}, {"numero": 16, "descripcion": "**Sistema de seguimiento de pedidos para e-commerce**  \n   - **Escenario**: Una tienda online quiere mostrar el estado de los pedidos en tiempo real (procesamiento, envío, entregado) a miles de usuarios simultáneamente.  \n   - **Requisitos**: Crear un backend reactivo que actualice estados y notifique a los clientes via push, minimizando latencia.  \n   - **Herramientas**: Spring WebFlux, Redis para cache, RabbitMQ para eventos, API Gateway (GraphQL).", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "Para implementar un sistema de seguimiento de pedidos en tiempo real con las herramientas especificadas, se propone la siguiente arquitectura reactiva:\n\n1. **Ingestión de eventos:**  Cuando un pedido cambia de estado (ej. de \"procesamiento\" a \"enviado\"), el microservicio responsable publica un evento en RabbitMQ.  Este evento contiene el ID del pedido y el nuevo estado.\n\n2. **Procesamiento de eventos:** Un consumidor Spring WebFlux suscrito a la cola de RabbitMQ recibe el evento.  Este consumidor actualiza el estado del pedido en la base de datos y en la caché Redis para un acceso rápido.\n\n3. **Notificaciones push:**  El consumidor, tras actualizar el estado, publica un nuevo evento en un topic de RabbitMQ dedicado a notificaciones.  Un servicio separado, también reactivo, consume estos eventos y envía notificaciones push a los usuarios suscritos al pedido vía websocket, utilizando el API Gateway (GraphQL) como intermediario.  GraphQL permite a los clientes suscribirse a actualizaciones específicas de pedidos.\n\n4. **API Gateway (GraphQL):**  Expone una API GraphQL que permite a los clientes consultar el estado de un pedido en tiempo real desde la caché Redis.  Además, gestiona las suscripciones websocket para las notificaciones push.  Utiliza un modelo de suscripción para que los clientes reciban actualizaciones solo cuando el estado del pedido cambia.\n\n5. **Cache Redis:** Almacena el estado actual de los pedidos para un acceso de baja latencia.  Esto minimiza la carga en la base de datos y permite escalar la lectura de estados a miles de usuarios simultáneamente.\n\n6. **Escalabilidad:**  Spring WebFlux, RabbitMQ y Redis son tecnologías inherentemente escalables, permitiendo manejar un gran volumen de pedidos y notificaciones.  Se pueden desplegar múltiples instancias de los microservicios y consumidores para distribuir la carga.\n\nEsta arquitectura reactiva asegura actualizaciones en tiempo real, minimiza la latencia y permite escalar para manejar miles de usuarios concurrentes.  La combinación de Spring WebFlux, RabbitMQ, Redis y API Gateway (GraphQL) proporciona una solución robusta y eficiente para el seguimiento de pedidos en e-commerce.\n"}]}, "createdAt": "2025-06-25T16:49:31.198239", "expiration": "2025-07-02T21:49:31.130Z", "publicAccess": true}