{"id": "355ec5af", "examenData": {"id": "878013", "fecha": "2025-04-08", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál es el principal objetivo de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Minimizar el uso de recursos hardware", "valor": "A"}, {"texto": "B) Maximizar la latencia en las respuestas del sistema", "valor": "B"}, {"texto": "C) Garantizar sistemas más resilientes y escalables", "valor": "C"}, {"texto": "D) Reducir la cantidad de componentes en el sistema", "valor": "D"}, {"texto": "E) Eliminar por completo el acoplamiento entre módulos", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1. Explica en detalle las diferencias clave entre la arquitectura en capas (como la de 3 capas) y la arquitectura hexagonal, mencionando ventajas, desventajas y casos de uso típicos para cada una. Incluye ejemplos concretos que ilustren su aplicación en sistemas reales. (Avanzado)", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso 1-1**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos como el Black Friday, procesando miles de solicitudes de compra por segundo sin colapsar. El sistema debe ser resiliente y escalar automáticamente.  \n\n**Preguntas de caso de uso:**  \n1. ¿Cómo diseñarías un sistema reactivo para manejar los picos de tráfico, garantizando disponibilidad y baja latencia?  \n2. ¿Qué patrones reactivos (ej. Circuit Breaker, Backpressure) aplicarías para evitar fallos en cascada y gestionar la carga?  \n\n**Requisitos específicos:**  \n- Implementar un servicio de procesamiento de pedidos que reaccione a la demanda.  \n- Usar mecanismos de resiliencia para manejar fallos en dependencias (ej. servicio de inventario).  \n- Demostrar escalabilidad horizontal bajo carga.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Akka, Spring WebFlux, Kafka.  \n- Enfoques: Event Sourcing, Message-Driven Architecture.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-08T16:23:50.977431", "expiration": "2025-04-15T21:23:50.965Z", "publicAccess": true}