{"id": "3a0058c5", "examenData": {"examen_id": "925268", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-22T15:25:30.149Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza frecuentemente en arquitecturas reactivas para manejar la concurrencia de manera eficiente?\nA) Singleton\nB) Factory\nC) Actor\nD) Observer\nE) Template Method", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 2, "texto": "¿Cuál es la principal ventaja de utilizar un backpressure en un sistema reactivo?\nA) Mayor velocidad de procesamiento\nB) Menor latencia\nC) Prevención de sobrecarga del sistema\nD) Mejor manejo de errores\nE) Simplificación del código", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}], "preguntas_libres": [{"numero": 3, "texto": "Explique cómo se implementaría la tolerancia a fallos en una arquitectura reactiva utilizando patrones como el Circuit Breaker y la gestión de backpressure.  Proporcione ejemplos concretos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Implementando Tolerancia a Fallos en una Arquitectura Reactiva\n\nLa tolerancia a fallos es un pilar fundamental en las arquitecturas reactivas, garantizando la resiliencia del sistema ante errores y manteniendo la capacidad de respuesta.  Dos patrones clave para lograr esto son el Circuit Breaker y la gestión de backpressure.\n\n**1. Circuit Breaker:**\n\nEl patrón Circuit Breaker previene la cascada de fallos al detener las solicitudes a un servicio que se sabe que está fallando.  Funciona como un interruptor eléctrico:\n\n* **Estado Cerrado:**  El circuito está cerrado y las solicitudes fluyen normalmente hacia el servicio.  Se monitoriza el número de fallos.\n* **Estado Abierto:** Si el número de fallos supera un umbral predefinido en un periodo de tiempo, el circuito se abre.  Las nuevas solicitudes se rechazan inmediatamente con un error, evitando la sobrecarga del servicio fallido y dando tiempo para su recuperación.\n* **Estado Semi-Abierto:** Después de un tiempo predefinido en estado abierto, el circuito pasa a semi-abierto.  Se permite un número limitado de solicitudes para probar si el servicio se ha recuperado. Si estas solicitudes son exitosas, el circuito vuelve al estado cerrado.  Si fallan, el circuito vuelve al estado abierto y el temporizador se reinicia.\n\n**Ejemplo Concreto (Java con Hystrix, aunque el concepto es aplicable a otros lenguajes y bibliotecas):**\n\n```java\nHystrixCommand<String> command = new HystrixCommand<String>(setter) {\n    @Override\n    protected String run() throws Exception {\n        // Lógica para llamar al servicio externo\n        return servicioExterno.obtenerDatos();\n    }\n\n    @Override\n    protected String getFallback() {\n        // Lógica de fallback en caso de fallo\n        return \"Datos por defecto\";\n    }\n};\n\nString resultado = command.execute();\n```\n\nEn este ejemplo, `HystrixCommand` implementa el patrón Circuit Breaker.  `run()` contiene la lógica para llamar al servicio externo.  `getFallback()` proporciona una respuesta alternativa en caso de fallo (estado abierto o semi-abierto).  Hystrix gestiona automáticamente los estados del circuito y las métricas de fallos.\n\n\n**2. Gestión de Backpressure:**\n\nLa backpressure es un mecanismo para controlar el flujo de datos entre un productor y un consumidor, evitando que el productor sobrecargue al consumidor.  En lugar de dejar que el consumidor falle bajo presión, la backpressure permite que el consumidor comunique al productor que reduzca la velocidad de envío de datos.\n\nExisten diferentes estrategias para implementar backpressure:\n\n* **Buffering:** El consumidor almacena los datos en un buffer hasta que puede procesarlos.  Esta estrategia es útil para picos de carga cortos, pero puede llevar a problemas de memoria si el productor envía datos continuamente a una velocidad mayor que la que el consumidor puede procesar.\n* **Dropping:** El consumidor descarta los datos que no puede procesar inmediatamente.  Esta estrategia es útil cuando la pérdida de algunos datos es aceptable.\n* **Flow Control:** El consumidor solicita explícitamente al productor que envíe una cantidad específica de datos.  Esta estrategia ofrece un control más preciso sobre el flujo de datos.\n\n\n**Ejemplo Concreto (Reactor en Java):**\n\n```java\nFlux<Data> dataStream = servicioExterno.getDataStream();\n\ndataStream\n    .onBackpressureBuffer(10, data -> log.warn(\"Buffer overflow, dropping data: {}\", data))\n    .subscribe(data -> procesarData(data));\n```\n\nEn este ejemplo, `onBackpressureBuffer` implementa una estrategia de backpressure con buffering.  Se define un buffer de tamaño 10. Si el buffer se llena, los nuevos datos se descartan y se registra un mensaje de advertencia.  Otras estrategias como `onBackpressureDrop` y `onBackpressureLatest` también están disponibles.\n\n**Conclusión:**\n\nCombinando Circuit Breaker y backpressure, se construye una arquitectura reactiva robusta y tolerante a fallos.  El Circuit Breaker previene la cascada de fallos aislando los servicios problemáticos, mientras que la backpressure gestiona el flujo de datos entre componentes, evitando la sobrecarga y manteniendo la capacidad de respuesta del sistema.  La elección de la estrategia de backpressure depende de las necesidades específicas de la aplicación, considerando la tolerancia a la pérdida de datos y los recursos disponibles.  Utilizar bibliotecas como Hystrix (para Circuit Breaker) y Reactor (para backpressure y programación reactiva) simplifica la implementación de estos patrones y facilita la construcción de sistemas resilientes.\n"}], "casos_uso": [{"numero": 4, "descripcion": "-   **Escenario práctico detallado:** Un sistema de agregación de datos de redes sociales que consume flujos masivos y continuos de publicaciones, comentarios y \"me gusta\" de diversas plataformas. El sistema necesita filtrar, procesar, analizar el sentimiento en tiempo real y almacenar los datos relevantes, manteniendo la capacidad de respuesta a consultas de análisis a pesar del volumen y la velocidad de entrada de datos.\n    -   **Requisitos específicos de lo que debe implementar el estudiante:** El estudiante debe generar 2 preguntas específicas y perspicaces sobre la aplicación de principios de arquitecturas reactivas en este escenario particular. Las preguntas deben explorar desafíos, soluciones o consideraciones clave relacionadas con la reactividad (Respuesta Rápida, Resiliencia, Elasticidad, Orientación a Mensajes) dentro del contexto de procesamiento de flujos de datos de redes sociales.\n    -   **Sugerencias de herramientas o enfoques que podría utilizar:** Enfocarse en el manejo de backpressure cuando los componentes de procesamiento o análisis son más lentos que la ingesta de datos, la resiliencia ante fallos en las APIs de las redes sociales o en los servicios de análisis, la escalabilidad para manejar el crecimiento del volumen de datos y la latencia en la entrega de resultados de análisis en tiempo real. Considerar el uso de colas de mensajes o sistemas de streaming como Kafka o Kinesis.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 17, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución: Preguntas sobre Arquitecturas Reactivas para un Sistema de Agregación de Datos de Redes Sociales\n\nEste caso práctico presenta el desafío de construir un sistema reactivo para agregar datos de redes sociales.  El volumen, velocidad y variedad de datos, junto con la necesidad de análisis en tiempo real, demandan una arquitectura robusta y escalable. Para evaluar la comprensión de los principios reactivos, se proponen las siguientes dos preguntas:\n\n**Pregunta 1:  Manejo de Backpressure y Resiliencia**\n\nConsiderando la naturaleza impredecible de los flujos de datos de redes sociales (picos de actividad, interrupciones de APIs, etc.), ¿cómo se implementaría una estrategia efectiva de backpressure en este sistema para evitar la sobrecarga de los componentes de procesamiento y análisis?  Específicamente, describe cómo se integraría un mecanismo de backpressure con un sistema de streaming como Kafka o Kinesis para garantizar la resiliencia del sistema ante fluctuaciones en la velocidad de ingesta y procesamiento de datos.  ¿Qué mecanismos de control de flujo y estrategias de reintentos se considerarían para manejar los mensajes no procesados durante periodos de alta carga?\n\n\n**Justificación:**\n\nEsta pregunta explora la capacidad del estudiante para aplicar los principios de *Respuesta Rápida* y *Resiliencia*. Un sistema reactivo debe ser capaz de manejar la carga fluctuante sin colapsar.  La pregunta se centra en la gestión de backpressure, un concepto crucial para evitar la sobrecarga del sistema cuando la velocidad de ingesta supera la capacidad de procesamiento.  Además, obliga al estudiante a considerar la integración con tecnologías de streaming comunes y a proponer mecanismos concretos de control de flujo y reintentos.\n\n\n**Pregunta 2: Elasticidad y Latencia en Análisis de Sentimiento en Tiempo Real**\n\nEl análisis de sentimiento en tiempo real es un requisito clave de este sistema.  Considerando la necesidad de *Elasticidad* para adaptarse a la demanda fluctuante y la importancia de una baja latencia para la entrega de resultados, ¿cómo se diseñaría la arquitectura del componente de análisis de sentimiento? ¿Qué estrategias de escalado automático (horizontal o vertical) se implementarían para asegurar que el sistema pueda manejar picos de actividad sin comprometer la velocidad de respuesta?  ¿Qué tecnologías o frameworks (e.g., Spark Streaming, Flink) serían adecuadas para este escenario y por qué?  ¿Cómo se minimizaría la latencia en el procesamiento y la entrega de los resultados del análisis de sentimiento a los usuarios finales?\n\n\n**Justificación:**\n\nEsta pregunta evalúa la comprensión del estudiante sobre los principios de *Elasticidad* y *Respuesta Rápida* en el contexto del análisis de datos en tiempo real.  Se enfoca en la capacidad de escalar el sistema para manejar picos de demanda sin afectar el rendimiento.  Además,  incita al estudiante a considerar diferentes tecnologías de procesamiento de streams y a proponer estrategias para minimizar la latencia, un factor crítico en los análisis en tiempo real.\n\n\n\n**En resumen,** estas dos preguntas obligan al estudiante a pensar críticamente sobre los desafíos y soluciones para construir un sistema reactivo para el procesamiento de datos de redes sociales.  Abordan aspectos clave de la reactividad, incluyendo backpressure, resiliencia, elasticidad, y la importancia de la baja latencia en el contexto de análisis en tiempo real.  Además, fomentan la consideración de herramientas y tecnologías relevantes para este tipo de sistemas.\n"}]}, "createdAt": "2025-05-22T10:25:30.207301", "expiration": "2025-05-29T15:25:30.149Z", "publicAccess": true}