{"id": "3b47460c", "examenData": {"id": "794932", "fecha": "2025-04-10", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál de los siguientes es un principio fundamental de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Acoplamiento fuerte entre componentes", "valor": "A"}, {"texto": "B) Tolerancia al fallo mediante aislamiento", "valor": "B"}, {"texto": "C) Procesamiento síncrono de peticiones", "valor": "C"}, {"texto": "D) Uso exclusivo de bases de datos relacionales", "valor": "D"}, {"texto": "E) Centralización del manejo de estado", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1 Compara y contrasta las ventajas y desventajas de la arquitectura en capas frente a la arquitectura hexagonal, proporcionando ejemplos concretos de escenarios donde cada una sería más adecuada. (nivel intermedio)", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso de uso 1-1**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos como el Black Friday, garantizando alta disponibilidad y respuesta en tiempo real para actualizaciones de inventario y procesamiento de pedidos.  \n\n**Preguntas de caso de uso:**  \n1. ¿Cómo diseñarías un sistema reactivo para manejar solicitudes concurrentes de actualización de inventario sin bloquear la interfaz de usuario?  \n2. ¿Qué patrones reactivos aplicarías para garantizar que las notificaciones de confirmación de pedidos se entreguen de manera eficiente a miles de usuarios simultáneos?  \n\n**Requisitos específicos:**  \n- Implementar un servicio de inventario que use mensajería asíncrona.  \n- Diseñar un flujo reactivo para notificaciones en tiempo real usando eventos.  \n- Garantizar tolerancia a fallos y escalabilidad horizontal.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Akka (Actor Model), Kafka (streaming), WebSockets (notificaciones).  \n- Enfoques: Patrón Event Sourcing, Backpressure para manejo de carga.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-09T19:09:00.344840", "expiration": "2025-04-17T00:09:00.328Z", "publicAccess": true}