{"id": "486df3e0", "examenData": {"examen_id": "470771", "nombre_examen": "Programación UML", "tipo_examen": "Evaluación", "fecha": "2025-04-30T21:23:36.518Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza comúnmente para manejar la retropresión en sistemas reactivos?", "puntaje": 1, "opciones": [{"texto": "Singleton", "valor": "A"}, {"texto": "Factory", "valor": "B"}, {"texto": "Circuit Breaker", "valor": "C"}, {"texto": "Observer", "valor": "D"}, {"texto": "Decorator", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 2, "texto": "¿Cuál es la principal ventaja de usar un sistema de mensajes asincrónico en una arquitectura reactiva?", "puntaje": 1, "opciones": [{"texto": "Acoplamiento estrecho", "valor": "A"}, {"texto": "Mayor latencia", "valor": "B"}, {"texto": "Desacoplar componentes", "valor": "C"}, {"texto": "Complejidad reducida", "valor": "D"}, {"texto": "Mayor consumo de recursos", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 3, "texto": "¿Qué tecnología se utiliza a menudo para implementar sistemas reactivos distribuidos?", "puntaje": 1, "opciones": [{"texto": "SOAP", "valor": "A"}, {"texto": "REST", "valor": "B"}, {"texto": "gRPC", "valor": "C"}, {"texto": "Akka", "valor": "D"}, {"texto": "CORBA", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 4, "texto": "¿Qué concepto se refiere a la capacidad de un sistema reactivo para mantenerse responsivo bajo carga variable?", "puntaje": 1, "opciones": [{"texto": "Resiliencia", "valor": "A"}, {"texto": "Elasticidad", "valor": "B"}, {"texto": "Orientado a mensajes", "valor": "C"}, {"texto": "Aislamiento de fallos", "valor": "D"}, {"texto": "Retropresión", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 5, "texto": "¿Cuál de las siguientes NO es una característica típica de un sistema reactivo?", "puntaje": 1, "opciones": [{"texto": "Tolerancia a fallos", "valor": "A"}, {"texto": "Estado mutable compartido", "valor": "B"}, {"texto": "Retropresión", "valor": "C"}, {"texto": "No bloqueante", "valor": "D"}, {"texto": "Concurrencia", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 6, "texto": "¿Qué patrón de mensajería describe un flujo continuo de datos entre un emisor y un receptor?", "puntaje": 1, "opciones": [{"texto": "Publish-Subscribe", "valor": "A"}, {"texto": "Request-Response", "valor": "B"}, {"texto": "Streaming", "valor": "C"}, {"texto": "Circuit Breaker", "valor": "D"}, {"texto": "Command Query Responsibility Segregation (CQRS)", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 7, "texto": "En el contexto de sistemas reactivos, ¿qué significa \"backpressure\"?", "puntaje": 1, "opciones": [{"texto": "Un mecanismo para manejar errores", "valor": "A"}, {"texto": "Un método para escalar sistemas", "valor": "B"}, {"texto": "Una forma de controlar el flujo de datos de un emisor a un receptor", "valor": "C"}, {"texto": "Un tipo de sistema de mensajería", "valor": "D"}, {"texto": "Una técnica de optimización de rendimiento", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 8, "texto": "¿Cuál de las siguientes es una herramienta o biblioteca comúnmente utilizada para construir sistemas reactivos?", "puntaje": 1, "opciones": [{"texto": "AngularJS", "valor": "A"}, {"texto": "ReactJS", "valor": "B"}, {"texto": "Vue.js", "valor": "C"}, {"texto": "RxJava", "valor": "D"}, {"texto": "jQuery", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 9, "texto": "¿Qué principio de diseño reactivo se centra en aislar los fallos para evitar que se propaguen por todo el sistema?", "puntaje": 1, "opciones": [{"texto": "Responsividad", "valor": "A"}, {"texto": "Resiliencia", "valor": "B"}, {"texto": "Elasticidad", "valor": "C"}, {"texto": "Orientado a mensajes", "valor": "D"}, {"texto": "Aislamiento de fallos", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}], "preguntas_libres": [{"numero": 10, "texto": "Describe cómo el principio de \"aislamiento de fallos\" se implementa en una arquitectura reactiva y proporciona un ejemplo concreto de cómo se maneja un fallo en un componente sin afectar a todo el sistema.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Aislamiento de Fallos en Arquitecturas Reactivas\n\nEl principio de \"aislamiento de fallos\" es crucial en arquitecturas reactivas para garantizar la resiliencia y la disponibilidad del sistema.  Se basa en la idea de contener los fallos dentro de un componente específico, evitando que se propaguen y afecten a otros componentes o a todo el sistema.  Esto se logra mediante la combinación de varias técnicas y patrones de diseño.\n\n**Mecanismos de Aislamiento de Fallos en Arquitecturas Reactivas:**\n\n1. **Componentes Aislados:**  La arquitectura reactiva promueve la descomposición del sistema en componentes pequeños, autónomos y débilmente acoplados.  Cada componente opera de forma independiente y se comunica con otros componentes a través de mensajes asíncronos. Este aislamiento inherente limita el impacto de un fallo en un solo componente.\n\n2. **Supervisores:**  Los supervisores son un componente esencial en la gestión de fallos.  Actúan como \"guardianes\" de otros componentes (sus \"hijos\").  Si un componente hijo falla, el supervisor detecta el fallo y toma la acción apropiada, como reiniciar el componente, detenerlo o escalar el problema a un supervisor de nivel superior.  Este mecanismo contiene el fallo dentro del árbol de supervisión, evitando su propagación.\n\n3. **Bulkheads (Mamparos):**  Inspirado en la compartimentación de los barcos, el patrón Bulkhead divide el sistema en compartimentos aislados.  Si un compartimento se \"inunda\" (falla), los otros compartimentos permanecen operativos.  En una arquitectura reactiva, esto se puede implementar asignando recursos dedicados (ej. hilos, conexiones a bases de datos) a cada componente.  Un fallo en un componente no afectará los recursos de otros componentes, previniendo fallos en cascada.\n\n4. **Timeouts y Retries:**  Los timeouts previenen que un componente espere indefinidamente una respuesta de otro componente que podría haber fallado.  Los retries permiten a un componente intentar de nuevo una operación que falló, lo que puede ser útil para manejar fallos transitorios.\n\n5. **Circuit Breaker (Disyuntor):**  El patrón Circuit Breaker previene que un componente continúe realizando llamadas a un servicio que está fallando repetidamente.  Actúa como un disyuntor eléctrico, \"abriendo el circuito\" para evitar más llamadas al servicio fallido durante un período de tiempo.  Después de un período de espera, el circuit breaker se \"cierra parcialmente\" para permitir algunas llamadas de prueba. Si estas llamadas tienen éxito, el circuito se \"cierra\" completamente; de lo contrario, se vuelve a \"abrir\".\n\n\n**Ejemplo Concreto:**\n\nImaginemos un sistema de comercio electrónico reactivo con tres componentes: un servicio de catálogo, un servicio de carrito de compras y un servicio de pago.  Si el servicio de pago falla, el sistema debe seguir funcionando.\n\n* **Aislamiento:** Los componentes se comunican a través de mensajes asíncronos. Un fallo en el servicio de pago no bloquea directamente al servicio de carrito de compras o al servicio de catálogo.\n* **Supervisor:** Un supervisor monitorea el servicio de pago. Si este falla, el supervisor lo reinicia.\n* **Bulkhead:** Cada servicio tiene su propio pool de conexiones a la base de datos.  Un fallo en el servicio de pago no agota las conexiones de la base de datos de los otros servicios.\n* **Timeout y Retry:** El servicio de carrito de compras utiliza un timeout al llamar al servicio de pago. Si la llamada no se completa dentro del timeout, se devuelve un error al usuario.  Se pueden implementar retries para manejar fallos transitorios en el servicio de pago.\n* **Circuit Breaker:** El servicio de carrito de compras utiliza un circuit breaker para el servicio de pago. Si el servicio de pago falla repetidamente, el circuit breaker se abre, evitando que el servicio de carrito de compras realice más llamadas al servicio de pago durante un período de tiempo.  Esto protege al sistema de una avalancha de solicitudes fallidas al servicio de pago.\n\n\nEn resumen, el aislamiento de fallos en arquitecturas reactivas se logra mediante la combinación de componentes aislados, supervisores, bulkheads, timeouts, retries y circuit breakers.  Estos mecanismos aseguran que un fallo en un componente se contenga y no afecte la disponibilidad y la resiliencia del sistema en su conjunto.  El ejemplo del sistema de comercio electrónico ilustra cómo estos principios se aplican en la práctica para manejar fallos de forma robusta.\n"}, {"numero": 11, "texto": "Explica cómo el backpressure contribuye a la resiliencia de un sistema reactivo. Describe diferentes estrategias para implementar backpressure y analiza sus ventajas e inconvenientes.", "puntaje": 2, "respuestaAlumno": "", "respuestaProfesor": "## Backpressure y Resiliencia en Sistemas Reactivos\n\nEn sistemas reactivos, el backpressure es un mecanismo esencial para la resiliencia, permitiendo que un sistema bajo presión se comunique con los productores de datos para regular el flujo de información.  En esencia, es la capacidad de un sistema sobrecargado de señalizar a los componentes upstream que reduzcan la velocidad de envío de datos, evitando así la sobrecarga y el colapso del sistema.  Sin backpressure, un sistema podría verse abrumado por la entrada de datos, llevando a la pérdida de datos, latencia excesiva y, en última instancia, fallos.\n\n**¿Cómo contribuye el backpressure a la resiliencia?**\n\nEl backpressure proporciona resiliencia de varias maneras:\n\n* **Prevención de la sobrecarga:** Al regular el flujo de datos, el backpressure evita que los componentes downstream se saturen. Esto protege al sistema de fallos por agotamiento de recursos como memoria, CPU o conexiones de red.\n* **Manejo de la congestión:**  Cuando la demanda supera la capacidad de procesamiento, el backpressure actúa como una válvula de escape, permitiendo que el sistema maneje la congestión de forma ordenada. En lugar de colapsar bajo presión, el sistema puede ralentizar el procesamiento y continuar funcionando, aunque con mayor latencia.\n* **Propagación de la carga:** El backpressure propaga la información sobre la congestión a los componentes upstream. Esto permite a todo el sistema adaptarse a la carga actual. Por ejemplo, un productor de datos puede reducir la velocidad de generación de datos o almacenar temporalmente los datos en un buffer hasta que el sistema downstream esté listo para procesarlos.\n* **Mayor previsibilidad:**  Al controlar el flujo de datos, el backpressure hace que el comportamiento del sistema sea más predecible bajo presión.  Esto facilita la monitorización, la depuración y la optimización del rendimiento.\n\n\n**Estrategias para implementar backpressure:**\n\nExisten diversas estrategias para implementar backpressure, cada una con sus ventajas e inconvenientes:\n\n1. **Buffering:** El componente downstream utiliza un buffer para almacenar datos temporalmente. Cuando el buffer se llena, se envía una señal al componente upstream para que detenga el envío de datos.\n\n    * **Ventajas:** Simple de implementar.\n    * **Inconvenientes:**  Puede introducir latencia y consumir memoria. Si el buffer se desborda, se puede producir pérdida de datos.\n\n2. **Control de flujo basado en el tamaño de la ventana:** El componente downstream define un tamaño de ventana que indica cuántos datos puede procesar. El componente upstream solo puede enviar datos dentro del límite de la ventana.\n\n    * **Ventajas:**  Más eficiente que el buffering, ya que evita la copia de datos.\n    * **Inconvenientes:**  Requiere una coordinación más compleja entre los componentes.\n\n3. **Backpressure explícito:** El componente downstream envía señales explícitas al componente upstream para indicar su capacidad de procesamiento.  Estas señales pueden ser simples (por ejemplo, un booleano indicando si está listo para recibir datos) o más complejas (por ejemplo, un número indicando cuántos datos puede procesar).\n\n    * **Ventajas:**  Permite un control más preciso del flujo de datos.\n    * **Inconvenientes:**  Puede ser más complejo de implementar que las otras estrategias.\n\n4. **Conjuntos de tokens:** Similar al control de flujo basado en ventanas, pero utiliza \"tokens\" para representar la capacidad de procesamiento. El componente upstream necesita adquirir un token antes de enviar datos.  El componente downstream libera tokens a medida que procesa datos.\n\n    * **Ventajas:**  Flexibilidad y control granular sobre el flujo de datos.\n    * **Inconvenientes:**  Mayor complejidad de implementación.\n\n\n**Conclusión:**\n\nEl backpressure es fundamental para la resiliencia de los sistemas reactivos.  Permite a los sistemas manejar la congestión de forma elegante, evitando fallos y manteniendo la estabilidad.  La elección de la estrategia de backpressure adecuada depende de las características específicas del sistema, como el volumen de datos, la latencia tolerable y la complejidad de implementación.  Es crucial comprender las ventajas e inconvenientes de cada estrategia para tomar una decisión informada y construir sistemas robustos y escalables.\n"}, {"numero": 12, "texto": "Diseña un escenario donde se necesite implementar un sistema reactivo distribuido. Describe los componentes clave y cómo se comunicarían entre sí utilizando principios reactivos. Considera aspectos como la consistencia eventual y la tolerancia a fallos.", "puntaje": 2, "respuestaAlumno": "", "respuestaProfesor": "## Escenario: Plataforma de Monitoreo de Sensores IoT para Agricultura de Precisión\n\nImaginemos una plataforma de monitoreo para agricultura de precisión que recolecta datos de miles de sensores IoT desplegados en un campo.  Estos sensores miden variables como temperatura, humedad del suelo, luminosidad y niveles de nutrientes en tiempo real. La plataforma debe procesar estos datos para proporcionar información útil a los agricultores, como recomendaciones de riego, fertilización y detección temprana de plagas.  Dado el volumen de datos, la necesidad de respuesta en tiempo real y la posibilidad de fallos en sensores o la red, un sistema reactivo distribuido es la arquitectura ideal.\n\n**Componentes Clave y Comunicación Reactiva:**\n\n1. **Sensores IoT (Publishers):** Los sensores actúan como *publishers*, enviando flujos de datos de manera continua a un **Message Broker**.  Utilizan un protocolo ligero como MQTT para la comunicación, minimizando el consumo de energía y el ancho de banda.\n\n2. **Message Broker (Intermediario):**  Un Message Broker distribuido como Kafka o RabbitMQ gestiona los flujos de datos provenientes de los sensores.  Su función es desacoplar a los *publishers* de los *subscribers*, permitiendo la escalabilidad y la tolerancia a fallos.  Implementa un mecanismo de *publish-subscribe* donde los datos se organizan en *topics* (ej. \"temperatura\", \"humedad\").\n\n3. **Microservicios de Procesamiento (Subscribers):**  Diversos microservicios se suscriben a los *topics* relevantes del Message Broker.  Ejemplos de estos microservicios:\n\n    * **Servicio de Agregación:**  Procesa los datos de temperatura y humedad para calcular promedios por zona del campo.\n    * **Servicio de Detección de Anomalías:**  Analiza los datos en busca de patrones inusuales que indiquen posibles problemas (ej. plagas, enfermedades).\n    * **Servicio de Recomendaciones:**  Genera recomendaciones personalizadas de riego y fertilización basándose en los datos procesados.\n\n    Estos microservicios se comunican entre sí de forma asíncrona utilizando *mensajes*.  Por ejemplo, el Servicio de Agregación, tras calcular los promedios, publica un mensaje con estos resultados a un nuevo *topic*.  El Servicio de Recomendaciones se suscribe a este *topic* para utilizar los promedios en sus cálculos.\n\n4. **API Gateway:**  Proporciona una interfaz unificada para que los agricultores accedan a la información procesada a través de aplicaciones web o móviles.  El API Gateway se comunica con los microservicios de forma reactiva, utilizando patrones como *backpressure* para controlar la carga y evitar la sobrecarga del sistema.\n\n5. **Base de Datos Distribuida:**  Una base de datos NoSQL distribuida como Cassandra o MongoDB almacena los datos procesados y las recomendaciones.  La consistencia eventual se utiliza para garantizar la disponibilidad y la tolerancia a fallos.  Los microservicios interactúan con la base de datos de forma asíncrona.\n\n**Consistencia Eventual y Tolerancia a Fallos:**\n\n* **Consistencia Eventual:**  Dado que los datos se procesan y almacenan de forma distribuida, la consistencia eventual es fundamental.  No se garantiza que todos los nodos tengan la misma información al mismo tiempo, pero se converge hacia un estado consistente eventualmente.  Esto permite al sistema seguir funcionando incluso con fallos en algunos nodos.\n* **Tolerancia a Fallos:** La arquitectura reactiva distribuida proporciona tolerancia a fallos a través de la replicación de los microservicios y la distribución de datos en el Message Broker y la base de datos.  Si un sensor, un microservicio o un nodo de la base de datos falla, el sistema puede continuar operando con los componentes restantes.  El Message Broker garantiza que los mensajes no se pierdan en caso de fallo de un subscriber.\n\n\n**Beneficios de la Arquitectura Reactiva Distribuida:**\n\n* **Escalabilidad:** El sistema puede escalar horizontalmente para manejar el creciente volumen de datos y las demandas de procesamiento.\n* **Resiliencia:** La tolerancia a fallos asegura la disponibilidad del sistema incluso con fallos en componentes individuales.\n* **Responsividad:** El procesamiento asíncrono y la comunicación no bloqueante permiten una respuesta rápida a los eventos.\n* **Eficiencia:**  El uso de protocolos ligeros y la optimización del consumo de recursos mejoran la eficiencia del sistema.\n\n\nEste escenario demuestra cómo un sistema reactivo distribuido puede ser utilizado para construir una plataforma robusta, escalable y resiliente para el monitoreo de sensores IoT en agricultura de precisión.  La comunicación asíncrona, la consistencia eventual y la tolerancia a fallos son principios clave que permiten al sistema manejar la complejidad y las demandas de este tipo de aplicaciones.\n"}, {"numero": 13, "texto": "Analiza las ventajas y desventajas de utilizar un framework reactivo en un proyecto de software. Considera factores como la complejidad del proyecto, la experiencia del equipo y los requisitos de rendimiento y escalabilidad.  ¿En qué situaciones recomendarías *no* utilizar un framework reactivo y por qué?", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Análisis de las Ventajas y Desventajas de un Framework Reactivo\n\nLos frameworks reactivos, basados en el manifiesto reactivo, ofrecen un enfoque para el desarrollo de software que enfatiza la respuesta a eventos, la resiliencia, la elasticidad y la orientación al mensaje. Si bien presentan ventajas significativas, también conllevan desventajas que deben considerarse cuidadosamente antes de su adopción.  La decisión de usar un framework reactivo debe basarse en una evaluación exhaustiva de las necesidades del proyecto, la experiencia del equipo y las expectativas de rendimiento y escalabilidad.\n\n**Ventajas:**\n\n* **Mayor capacidad de respuesta y rendimiento:** Los frameworks reactivos permiten la creación de aplicaciones altamente responsivas que manejan eficientemente flujos de datos asíncronos. Esto se traduce en una mejor experiencia de usuario, especialmente en aplicaciones con actualizaciones frecuentes o interacciones en tiempo real.\n* **Escalabilidad mejorada:** La arquitectura reactiva facilita la escalabilidad horizontal al permitir la distribución de la carga de trabajo entre múltiples nodos. Esto es crucial para aplicaciones que experimentan picos de tráfico o requieren un alto rendimiento.\n* **Mayor resiliencia:**  Gracias a su diseño modular y a la gestión de fallos integrada, las aplicaciones reactivas son más resistentes a errores y caídas.  El aislamiento de fallos evita que un componente problemático afecte al sistema completo.\n* **Mayor mantenibilidad y testabilidad:** El código reactivo suele ser más modular y fácil de entender, lo que simplifica el mantenimiento y la depuración.  Además, la naturaleza asíncrona del código facilita la escritura de pruebas unitarias y de integración.\n* **Simplificación de la programación asíncrona:** Los frameworks reactivos proporcionan abstracciones y operadores que simplifican la gestión de operaciones asíncronas, evitando el \"callback hell\" y haciendo el código más legible y mantenible.\n\n\n**Desventajas:**\n\n* **Mayor complejidad inicial:** La curva de aprendizaje de los frameworks reactivos puede ser pronunciada, especialmente para equipos sin experiencia previa con programación reactiva o funcional.  La depuración y el seguimiento de errores también pueden ser más complejos al principio.\n* **Sobrecarga para proyectos simples:** En proyectos pequeños o con requisitos de rendimiento y escalabilidad modestos, la complejidad añadida de un framework reactivo puede ser una sobrecarga innecesaria.  Un enfoque más tradicional podría ser más eficiente en estos casos.\n* **Dependencia de bibliotecas y frameworks:**  Los frameworks reactivos introducen dependencias adicionales al proyecto, lo que puede aumentar el tamaño del código y la complejidad de la gestión de dependencias.\n* **Dificultad para el debugging en sistemas distribuidos:** Si bien la resiliencia es una ventaja, la depuración en un sistema reactivo distribuido puede ser compleja debido a la naturaleza asíncrona y la propagación de eventos.\n\n\n**¿Cuándo *NO* usar un framework reactivo?**\n\n* **Proyectos pequeños y simples:** Si la aplicación es simple y no requiere un alto rendimiento ni escalabilidad, un framework reactivo añadirá complejidad innecesaria.\n* **Equipo sin experiencia:** Si el equipo de desarrollo no tiene experiencia con programación reactiva, el tiempo de aprendizaje y la probabilidad de errores pueden ser significativos, impactando negativamente el cronograma y el presupuesto del proyecto.\n* **Aplicaciones con requisitos de rendimiento predecibles y bajos:** Si la aplicación no necesita manejar picos de tráfico o un alto volumen de datos, un framework reactivo no ofrecerá beneficios significativos.\n* **Cuando la depuración en tiempo real es crítica:**  Si la aplicación requiere una depuración en tiempo real muy precisa, la complejidad de un sistema reactivo distribuido puede dificultar el proceso.\n\n\n**Conclusión:**\n\nLa decisión de utilizar un framework reactivo debe ser tomada con cuidado, considerando las ventajas y desventajas en relación con las necesidades específicas del proyecto.  Si bien ofrecen beneficios significativos en términos de rendimiento, escalabilidad y resiliencia, también introducen complejidad que puede ser contraproducente en ciertos escenarios.  Una evaluación exhaustiva de la complejidad del proyecto, la experiencia del equipo y los requisitos de rendimiento y escalabilidad es esencial para tomar la decisión correcta.\n"}], "casos_uso": [{"numero": 14, "descripcion": "1.\n   - Escenario práctico detallado: Una plataforma de trading financiero en tiempo real que recibe flujos constantes de datos de mercado (precios, volumen) de múltiples fuentes, procesa órdenes de compra/venta a muy alta velocidad y debe notificar a los usuarios sobre cambios relevantes en sus posiciones o el mercado con mínima latencia. La estabilidad y la capacidad de manejar picos de datos son críticas.\n   - Requisitos específicos: Analizar el escenario y generar dos preguntas prácticas sobre cómo una arquitectura reactiva podría abordar desafíos específicos del trading en tiempo real, centrándose cada pregunta en un caso de uso reactivo distinto dentro de este contexto (ej. manejo eficiente de streams de datos de mercado, aplicación de backpressure en el procesamiento de órdenes).\n   - Sugerencias de herramientas o enfoques: Considerar conceptos como streams de datos reactivos, manejo de backpressure, tolerancia a fallos, concurrencia asíncrona. Herramientas: Kafka, Akka, Spring WebFlux, Project Reactor, RxJava.\n\n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Soluciones para los 5 Casos de Uso de Arquitecturas Reactivas\n\nA continuación, se presentan dos preguntas y sus respectivas respuestas para cada uno de los cinco escenarios planteados, explorando cómo las arquitecturas reactivas pueden abordar los desafíos específicos de cada caso.\n\n**1. Plataforma de Trading Financiero en Tiempo Real**\n\n* **Pregunta 1:** ¿Cómo se puede utilizar un stream de datos reactivo para procesar eficientemente los flujos constantes de datos de mercado (precios, volumen) provenientes de múltiples fuentes, garantizando la mínima latencia en la actualización de información para los usuarios?\n\n* **Respuesta 1:**  Utilizando herramientas como Kafka o Apache Pulsar para la ingesta y distribución de datos de mercado.  Estos actúan como un bus de mensajes distribuido y tolerante a fallos.  Un stream reactivo, implementado con Project Reactor o RxJava, puede suscribirse a los topics de Kafka correspondientes a cada fuente de datos.  Las operaciones de transformación y enriquecimiento de datos (ej. calcular medias móviles, aplicar filtros) se realizan sobre el stream de forma asíncrona y no bloqueante.  Finalmente, el stream actualizado se utiliza para notificar a los usuarios en tiempo real a través de WebSockets, minimizando la latencia.  La naturaleza asíncrona y la capacidad de paralelizar el procesamiento del stream permiten manejar el alto volumen y velocidad de los datos de mercado.\n\n* **Pregunta 2:** ¿Cómo se puede aplicar backpressure en el procesamiento de órdenes de compra/venta para evitar la sobrecarga del sistema durante picos de actividad, manteniendo la responsividad de la plataforma?\n\n* **Respuesta 2:**  Implementando un mecanismo de backpressure utilizando Project Reactor o RxJava.  Cuando el sistema de procesamiento de órdenes (ej. un servicio de matching de órdenes) se acerca a su capacidad máxima, puede comunicar esta situación aguas arriba en el stream de órdenes.  Esto se puede lograr utilizando operadores como `onBackpressureBuffer`, `onBackpressureDrop` o `onBackpressureLatest`.  De esta manera, la fuente de órdenes (ej. la interfaz de usuario) puede ajustar la tasa de envío de nuevas órdenes, evitando la saturación del sistema y manteniendo su estabilidad.  La plataforma podría, por ejemplo, limitar la frecuencia con la que los usuarios pueden enviar órdenes o mostrar un mensaje de alerta indicando la alta carga del sistema.\n\n\n**2. Sistema de Monitoreo de Dispositivos IoT**\n\n* **Pregunta 1:** ¿Cómo se puede lograr la escalabilidad horizontal en la ingesta de datos de telemetría provenientes de millones de sensores IoT distribuidos?\n\n* **Respuesta 1:**  Utilizando un cluster de Kafka para la ingesta de datos. Los sensores IoT publican datos en topics específicos de Kafka. La escalabilidad horizontal se logra añadiendo más brokers a este clúster.  Herramientas como Apache NiFi pueden utilizarse para la recolección y pre-procesamiento de datos antes de enviarlos a Kafka, gestionando la heterogeneidad de los dispositivos y protocolos de comunicación.  Esta arquitectura distribuida permite manejar el volumen masivo de datos y la variabilidad en la tasa de datos provenientes de los sensores.\n\n* **Pregunta 2:** ¿Cómo se puede utilizar el procesamiento de streams de eventos para la detección de anomalías en tiempo real en los datos de telemetría?\n\n* **Respuesta 2:**  Empleando Apache Flink o Kafka Streams.  Estos frameworks permiten procesar streams de datos en tiempo real, aplicando funciones de agregación, filtrado y análisis a los datos de telemetría provenientes de Kafka.  Se pueden definir ventanas de tiempo para analizar los datos y detectar anomalías basadas en reglas predefinidas o modelos de machine learning.  Por ejemplo, se puede calcular la media móvil de la temperatura en una ventana de tiempo y generar una alerta si se supera un umbral determinado.  La detección de anomalías en tiempo real permite tomar acciones correctivas de forma inmediata.\n\n\n**3. Backend de Juego Multijugador Online**\n\n* **Pregunta 1:** ¿Cómo se pueden utilizar streams reactivos para sincronizar el estado del juego en tiempo real entre miles de jugadores concurrentes, minimizando la latencia?\n\n* **Respuesta 1:**  Utilizando una combinación de Akka y WebSockets. Akka Actors pueden representar a cada jugador y al estado del juego.  Los cambios en el estado del juego se propagan a través de mensajes entre los actores.  WebSockets permiten la comunicación bidireccional en tiempo real entre el servidor y los clientes (jugadores).  Los cambios en el estado del juego se envían a los clientes a través de WebSockets, asegurando la sincronización en tiempo real con mínima latencia.\n\n* **Pregunta 2:** ¿Cómo se puede manejar de forma resiliente la conexión y desconexión de jugadores, así como fallos de red, sin afectar la experiencia de juego de los demás participantes?\n\n* **Respuesta 2:**  Utilizando la supervisión de actores en Akka.  Cada jugador puede ser representado por un actor hijo supervisado por un actor padre.  Si un jugador se desconecta o ocurre un fallo de red, el actor hijo correspondiente termina, pero el actor padre puede reiniciarlo o tomar las acciones necesarias para mantener la consistencia del juego.  Esto permite manejar fallos de forma aislada sin afectar a otros jugadores.  El uso de un backend distribuido con Akka Cluster también proporciona tolerancia a fallos a nivel de nodos.\n\n\n**4. Plataforma de E-commerce de Alto Tráfico**\n\n* **Pregunta 1:** ¿Cómo se puede implementar el procesamiento asíncrono y resiliente de pedidos durante picos de demanda como el Black Friday?\n\n* **Respuesta 1:**  Utilizando colas de mensajes como Kafka o RabbitMQ.  Los pedidos se envían a una cola de mensajes para su procesamiento asíncrono.  Múltiples instancias de un servicio de procesamiento de pedidos consumen mensajes de la cola, permitiendo la escalabilidad horizontal.  Si un servicio falla, el mensaje permanece en la cola hasta que otro servicio lo procese, garantizando la resiliencia.\n\n* **Pregunta 2:** ¿Cómo se puede aplicar backpressure al interactuar con pasarelas de pago externas para evitar su sobrecarga durante picos de tráfico?\n\n* **Respuesta 2:**  Utilizando el patrón Circuit Breaker en conjunto con colas de mensajes.  El Circuit Breaker monitoriza la disponibilidad de la pasarela de pago.  Si la pasarela se sobrecarga o falla, el Circuit Breaker se abre, y los nuevos pedidos se acumulan en una cola de mensajes.  Una vez que la pasarela se recupera, el Circuit Breaker se cierra, y los pedidos en la cola se procesan.  Esto evita la cascada de fallos y protege la pasarela de pago de la sobrecarga.\n\n\n**5. Agregación de Feeds de Redes Sociales y Notificaciones Push**\n\n* **Pregunta 1:** ¿Cómo se puede implementar el consumo y transformación continua de streams de datos de múltiples APIs de redes sociales?\n\n* **Respuesta 1:**  Utilizando Apache NiFi o StreamSets para la ingesta y procesamiento de datos de las APIs.  Estos frameworks permiten definir pipelines de datos que consumen datos de diferentes fuentes (APIs de redes sociales), aplican transformaciones (filtrado, agregación) y envían los datos procesados a un sistema de mensajería como Kafka.  La naturaleza distribuida de estas herramientas permite la escalabilidad y la tolerancia a fallos.\n\n* **Pregunta 2:** ¿Cómo se puede manejar la alta concurrencia y aplicar backpressure en el envío de notificaciones push a millones de dispositivos móviles?\n\n* **Respuesta 2:**  Utilizando un sistema de colas de mensajes como Kafka o Pulsar en conjunto con un servicio de notificaciones push escalable.  Las notificaciones se envían a la cola de mensajes.  El servicio de notificaciones consume mensajes de la cola y envía las notificaciones a los dispositivos móviles.  El backpressure se puede aplicar limitando la tasa de consumo de mensajes del servicio de notificaciones, evitando la sobrecarga del servicio y garantizando la entrega de notificaciones de forma eficiente.  La escalabilidad se logra añadiendo más instancias del servicio de notificaciones.\n\n\nEsta solución proporciona una base sólida para comprender cómo aplicar los principios reactivos en diferentes escenarios. Recuerda que la elección de herramientas y la implementación específica dependerán de los requisitos de cada proyecto.  Es fundamental comprender los conceptos clave como la asincronía, la no-bloqueo, la resiliencia y la backpressure para diseñar sistemas reactivos eficientes y robustos.\n"}]}, "createdAt": "2025-04-30T16:23:36.631986", "expiration": "2025-05-07T21:23:36.518Z", "publicAccess": true}