{"id": "4cab46b1", "examenData": {"examen_id": "212635", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-06-01T21:42:32.099Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [], "preguntas_libres": [{"numero": 1, "texto": "Explique cómo el patrón de diseño \"Command Query Responsibility Segregation\" (CQRS) se integra con una arquitectura reactiva, detallando su impacto en la performance y la consistencia de datos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "CQRS mejora las arquitecturas reactivas al separar las operaciones de lectura (Queries) de las de escritura (Commands).  Esta segregación permite escalar cada parte independientemente según sus necesidades. Las consultas, a menudo más frecuentes, pueden optimizarse para la lectura, utilizando cachés y réplicas, incrementando la performance. Los comandos, por otro lado, se gestionan como una secuencia de eventos inmutables, facilitando la concurrencia y la auditabilidad.\n\nEsta separación, sin embargo, introduce la complejidad de la consistencia eventual.  Mientras que las lecturas ofrecen una vista consistente del pasado, las actualizaciones no se reflejan instantáneamente.  Se utilizan mecanismos como Event Sourcing para propagar los cambios y lograr la consistencia eventual.  Esto implica un trade-off: mayor performance y escalabilidad a cambio de una consistencia relajada, aceptable en muchos sistemas reactivos que priorizan la disponibilidad y la tolerancia a fallos.  En resumen, CQRS facilita la construcción de sistemas reactivos más escalables y performantes, gestionando la consistencia eventual de forma explícita.\n", "archivoId": "anexo_284879_1748470036329", "archivoNombre": "Diagrama sin título.drawio.pdf", "archivoUrl": "https://cloud.appwrite.io/v1/storage/buckets/APPWRITE_BUCKET_DOCUMENTO_ANEXO_EXAMEN/files/anexo_284879_1748470036329/view?project=67e565df00172171560", "archivoTamaño": 2352, "archivoTipo": "application/pdf"}, {"numero": 2, "texto": "Analice la implementación de un sistema de backpressure en una arquitectura reactiva, explicando diferentes estrategias para manejar la sobrecarga y cómo estas estrategias impactan en la resiliencia del sistema.  Incluya ejemplos concretos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Un sistema reactivo bajo presión puede implementar backpressure para evitar la sobrecarga.  Este mecanismo permite al consumidor controlar el flujo de datos del productor, previniendo desbordamientos.  Existen diversas estrategias para manejar la sobrecarga: control de flujo basado en buffer, donde el productor se bloquea si el buffer del consumidor está lleno;  ventanas de tiempo, limitando la cantidad de datos en un periodo; y dropping messages, descartando mensajes menos críticos cuando la capacidad se excede.  Por ejemplo, en un sistema de procesamiento de streams, si el consumidor se ve saturado procesando datos, puede aplicar backpressure.  Con un buffer limitado, el productor pausaría el envío hasta que el consumidor procese los datos existentes.  Usando ventanas de tiempo, el consumidor podría solicitar solo un número fijo de mensajes por segundo. Finalmente, descartando mensajes, se priorizarían mensajes críticos, como alertas del sistema, sobre datos menos relevantes, garantizando la resiliencia del sistema bajo alta carga. La elección de la estrategia depende de los requisitos de la aplicación y la tolerancia a la pérdida de datos.\n", "archivoId": "anexo_284879_1748469930521", "archivoNombre": "Documentos-de-embarque.pdf", "archivoUrl": "https://cloud.appwrite.io/v1/storage/buckets/APPWRITE_BUCKET_DOCUMENTO_ANEXO_EXAMEN/files/anexo_284879_1748469930521/view?project=67e565df00172171560", "archivoTamaño": 168651, "archivoTipo": "application/pdf"}, {"numero": 3, "texto": "Compare y contraste dos frameworks o librerías diferentes para el desarrollo de aplicaciones reactivas (ej. Spring WebFlux y Akka Streams).  Enfóquese en sus modelos de programación, sus fortalezas y debilidades en diferentes escenarios.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Spring WebFlux y Akka Streams son frameworks para construir aplicaciones reactivas, pero difieren en sus modelos de programación. WebFlux, basado en el patrón Reactor, utiliza un enfoque declarativo con operadores funcionales para componer flujos de datos asíncronos.  Akka Streams, por otro lado, se basa en el modelo Actor y ofrece un mayor control sobre el grafo de flujo de datos, permitiendo una gestión más granular del paralelismo y la retropresión.\n\nWebFlux, al integrarse fácilmente con el ecosistema Spring, simplifica el desarrollo de aplicaciones web reactivas. Es ideal para escenarios con alta concurrencia y I/O intensiva, como APIs REST. Sin embargo, su modelo puede ser menos flexible que Akka Streams para escenarios complejos de procesamiento de flujos.\n\nAkka Streams, con su modelo más flexible, brilla en escenarios que requieren un control preciso sobre el flujo de datos, como procesamiento de eventos en tiempo real o sistemas distribuidos.  No obstante, su curva de aprendizaje es más pronunciada y requiere una mayor comprensión del modelo Actor.  La elección entre ambos depende de las necesidades específicas del proyecto.\n", "archivoId": "anexo_284879_1748470036329", "archivoNombre": "", "archivoUrl": "", "archivoTamaño": 2352, "archivoTipo": "application/pdf"}, {"numero": 4, "texto": "Diseñe una arquitectura reactiva para una aplicación de streaming de video en tiempo real, considerando aspectos como la gestión de la conexión con los usuarios, el manejo de errores y la escalabilidad horizontal.  Justifique sus decisiones de diseño.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Una arquitectura reactiva para streaming de video debe ser resiliente y escalable.  Utilizaría un diseño basado en microservicios con los siguientes componentes: un servicio de gestión de conexiones (ej. WebSockets) para comunicación bidireccional con los clientes, un servicio de streaming encargado de la distribución del video, y un servicio de gestión de usuarios para autenticación y autorización.  Para la escalabilidad, emplearía balanceo de carga delante de cada servicio y orquestación de contenedores (ej. Kubernetes) para desplegar y escalar los microservicios horizontalmente según la demanda.  La gestión de errores se implementaría mediante reintentos, mecanismos de fallback y circuit breakers para evitar la cascada de fallos.  El almacenamiento del video se realizaría en un sistema distribuido como un object storage (ej. S3).  Esta arquitectura permite un streaming fluido, tolerante a fallos y adaptable a picos de usuarios, cruciales para una buena experiencia de usuario.  La elección de WebSockets permite una comunicación en tiempo real eficiente y la arquitectura de microservicios facilita el mantenimiento y la escalabilidad independiente de cada componente.\n"}], "casos_uso": []}, "createdAt": "2025-06-01T16:42:32.150394", "expiration": "2025-06-08T21:42:32.099Z", "publicAccess": true}