{"id": "58e720f2", "examenData": {"examen_id": "166614", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-21T22:37:59.783Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza comúnmente para manejar la concurrencia en sistemas reactivos?\nA) Singleton\nB) Factory\nC) Actor\nD) Observer\nE) Strategy", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 2, "texto": "¿Cuál es la principal ventaja de utilizar un backpressure en un sistema reactivo?\nA) Mayor velocidad de procesamiento\nB) Menor latencia\nC) Prevención de sobrecarga del sistema\nD) Simplificación del código\nE) Aumento del consumo de memoria", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 3, "texto": "¿Qué tecnología es ampliamente utilizada para implementar flujos de datos reactivos?\nA)  Spring Boot\nB)  ReactJS\nC)  RxJava\nD)  AngularJS\nE)  Node.js", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 4, "texto": "¿Cuál de las siguientes características describe mejor la resiliencia en una arquitectura reactiva?\nA) Capacidad de escalar horizontalmente\nB) Capacidad de recuperarse de fallos\nC) Alta velocidad de procesamiento\nD) Baja latencia\nE) Uso eficiente de recursos", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 5, "texto": "¿Qué concepto se refiere a la capacidad de un sistema reactivo de adaptarse a cambios en la carga?\nA) Responsividad\nB) Resiliencia\nC) Elasticidad\nD) Orientación a mensajes\nE) Consistencia", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}], "preguntas_libres": [{"numero": 6, "texto": "Explique cómo la implementación de un backpressure efectivo en una arquitectura reactiva puede prevenir el colapso del sistema ante picos de demanda inesperados.  Proporcione ejemplos concretos de mecanismos de backpressure.", "puntaje": 5, "respuestaAlumno": "", "respuestaProfesor": ""}], "casos_uso": [{"numero": 7, "descripcion": "Aquí tienes los 5 casos de uso prácticos sobre arquitecturas reactivas, cada uno con su estructura específica:\n\n**1. Procesamiento de Pedidos en Tiempo Real en E-commerce**\n- **Número único:** 1\n- **Escenario práctico detallado:** Una plataforma de comercio electrónico de alto tráfico necesita procesar miles de pedidos por minuto, actualizar el inventario en tiempo real para todos los usuarios, y gestionar la comunicación asíncrona con múltiples pasarelas de pago y servicios de envío. La lentitud en cualquier parte del proceso no debe bloquear el sistema ni afectar la experiencia del usuario en otras operaciones.\n- **Requisitos específicos:** Diseña el flujo de procesamiento de un pedido utilizando principios reactivos.\n    1.  Define un caso de uso reactivo para la actualización y visualización del inventario disponible a medida que los productos son comprados por diferentes usuarios simultáneamente. ¿Cómo se maneja la concurrencia y la propagación rápida del estado de stock?\n    2.  Define un caso de uso reactivo para el flujo completo de un pedido, desde que el usuario hace clic en \"Comprar\" hasta la notificación de envío. ¿Cómo se gestionan las dependencias externas lentas (como pasarelas de pago) sin bloquear el sistema principal?\n- **Sugerencias de herramientas o enfoques:** Spring WebFlux, Akka, Reactor, Kafka, RabbitMQ, patrón Saga.\n\n**2. Ingesta y Análisis de Datos de IoT a Gran Escala**\n- **Número único:** 2\n- **Escenario práctico detallado:** Una empresa gestiona una red masiva de dispositivos IoT (sensores, medidores, etc.) que envían datos de telemetría continuamente. El volumen de datos es enorme y varía, con picos inesperados. Se necesita un sistema capaz de ingerir estos datos de forma fiable, procesarlos en tiempo real para detección de anomalías y almacenar un historial para análisis posterior. La pérdida de datos o la incapacidad de procesar picos de tráfico son críticas.\n- **Requisitos específicos:** Diseña la arquitectura de ingesta y procesamiento inicial de datos de IoT.\n    1.  Define un caso de uso reactivo para la ingesta de datos desde millones de dispositivos IoT. ¿Cómo se asegura que el sistema puede absorber la alta velocidad y el volumen variable de datos sin caerse, aplicando principios de backpressure?\n    2.  Define un caso de uso reactivo para el procesamiento inicial en tiempo real de los datos ingeridos (ej. filtrado, normalización, agregación simple). ¿Cómo se garantiza la tolerancia a fallos en este paso si uno de los procesadores falla temporalmente?\n- **Sugerencias de herramientas o enfoques:** Kafka, Apache Flink, Akka Streams, Reactive Streams, MQTT, Protocolos basados en flujos.\n\n**3. Plataforma de Trading Financiero de Baja Latencia**\n- **Número único:** 3\n- **Escenario práctico detallado:** Una plataforma de trading online recibe flujos continuos de datos de mercado (precios, volumen) de múltiples bolsas y debe permitir a los usuarios ejecutar órdenes de compra/venta con la menor latencia posible. El sistema debe ser extremadamente rápido, concurrente y capaz de reaccionar instantáneamente a los cambios del mercado y a las órdenes de los usuarios, sin perder datos ni bloquearse bajo alta carga o fallos externos.\n- **Requisitos específicos:** Diseña los componentes centrales de la plataforma de trading que manejan datos de mercado y órdenes.\n    1.  Define un caso de uso reactivo para la recepción y procesamiento de flujos de datos de mercado (tickers, cotizaciones). ¿Cómo se maneja el alto volumen y la velocidad de estos datos para actualizar la vista de precios en tiempo real para todos los usuarios suscritos?\n    2.  Define un caso de uso reactivo para la ejecución de una orden de trading una vez que se recibe la señal del usuario o de un algoritmo. ¿Cómo se minimiza la latencia y se gestionan las respuestas asíncronas de las bolsas externas de forma eficiente y resiliente?\n- **Sugerencias de herramientas o enfoques:** Aeron, LMAX Disruptor (patrón), Akka, ReactiveX, ZeroMQ, WebSockets.\n\n**4. Sistema de Notificaciones y Feeds en Red Social**\n- **Número único:** 4\n- **Escenario práctico detallado:** Una red social con millones de usuarios activos necesita entregar actualizaciones de contenido (posts, comentarios) a los feeds de los seguidores y enviar notificaciones en tiempo real sobre interacciones (likes, menciones). El desafío es escalar para manejar la propagación de información a un gran número de usuarios simultáneamente y asegurar la entrega rápida y fiable de notificaciones sin sobrecargar los servidores o los dispositivos de los usuarios.\n- **Requisitos específicos:** Diseña el sistema de distribución de contenido y notificaciones.\n    1.  Define un caso de uso reactivo para la distribución de contenido al feed personalizado de un usuario. ¿Cómo se maneja el \"problema del fan-out\" (un usuario popular que publica algo que debe llegar a millones de seguidores) de manera eficiente y escalable?\n    2.  Define un caso de uso reactivo para el envío de notificaciones en tiempo real a los usuarios sobre interacciones relevantes. ¿Cómo se mantienen activas millones de conexiones simultáneas y se empujan las notificaciones de forma fiable y con baja latencia?\n- **Sugerencias de herramientas o enfoques:** Kafka, Apache Cassandra, WebSockets, Server-Sent Events (SSE), Redis Pub/Sub, Akka.\n\n**5. Pipeline de Procesamiento de Logs y Eventos Centralizado**\n- **Número único:** 5\n- **Escenario práctico detallado:** Una organización opera cientos de microservicios y servidores que generan grandes volúmenes de logs y eventos de auditoría. Se necesita un sistema centralizado para recolectar, agregar, transformar, filtrar y enrutar estos datos a diferentes destinos (almacenamiento a largo plazo, sistemas de monitoreo, plataformas de análisis). El sistema debe ser capaz de manejar picos de tráfico de logs y garantizar que no se pierdan datos importantes.\n- **Requisitos específicos:** Diseña el pipeline de procesamiento de logs y eventos.\n    1.  Define un caso de uso reactivo para la ingesta de logs y eventos desde múltiples fuentes distribuidas y heterogéneas. ¿Cómo se maneja la variabilidad en el volumen y formato de los datos de entrada y se aplica backpressure si los sistemas de procesamiento intermedios se saturan?\n    2.  Define un caso de uso reactivo para la transformación y enrutamiento condicional de los eventos procesados a diferentes destinos. ¿Cómo se asegura que la lógica de transformación se aplica de forma resiliente y que los eventos llegan a su destino correcto incluso si uno de los destinos está temporalmente no disponible?\n- **Sugerencias de herramientas o enfoques:** Kafka, Apache Flink, Logstash, Fluentd, Reactive Streams, Elasticsearch, S3.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 10, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": ""}]}, "createdAt": "2025-05-21T17:37:59.823318", "expiration": "2025-05-28T22:37:59.783Z", "publicAccess": true}