{"id": "78318a32", "examenData": {"id": "069934", "nombreExamen": "Programación UML", "tipoExamen": "Evaluación", "fecha": "2025-04-29", "profesor": "Mariela Isabel Camargo Román", "profesorId": "16MI987", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "¿Qué patrón de diseño es común en sistemas reactivos para manejar flujos de datos asíncronos?  \nA) Singleton  \nB) Observer  \nC) Factory  \nD) Decorator  \nE) Strategy", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 2, "texto": "¿Qué componente de las arquitecturas reactivas se encarga de manejar la comunicación entre servicios?  \nA) Base de datos relacional  \nB) Message Broker  \nC) Load Balancer  \nD) Servidor web  \nE) Cache distribuida", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 3, "texto": "¿Cuál de las siguientes tecnologías es ampliamente utilizada para implementar sistemas reactivos?  \nA) ReactJS  \nB) Akka  \nC) Django  \nD) Spring MVC  \nE) Hibernate", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 4, "texto": "¿Qué característica define a un sistema reactivo según el Manifiesto Reactivo?  \nA) Respuesta lenta  \nB) Escalabilidad limitada  \nC) Resiliencia  \nD) Acoplamiento fuerte  \nE) Procesamiento en batch", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 5, "texto": "¿Qué término describe la capacidad de un sistema reactivo para responder a fluctuaciones en la carga?  \nA) Elasticidad  \nB) Fragmentación  \nC) Serialización  \nD) Normalización  \nE) Compilación", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 6, "texto": "¿Cuál de los siguientes principios es clave en las arquitecturas reactivas?  \nA) Acoplamiento fuerte entre componentes  \nB) Tolerancia al bloqueo en las operaciones  \nC) Responsividad ante fallos y cargas variables  \nD) Dependencia de hardware especializado  \nE) Uso exclusivo de lenguajes de bajo nivel", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 7, "texto": "¿Qué patrón de diseño es común en sistemas reactivos para manejar flujos de datos?  \nA) Singleton  \nB) Observer  \nC) Factory  \nD) Decorator  \nE) Prototype", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 8, "texto": "¿Qué herramienta se usa a menudo para implementar programación reactiva en JavaScript?  \nA) Django  \nB) Reactor  \nC) RxJS  \nD) Hibernate  \nE) JUnit", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 9, "texto": "¿Qué beneficio principal ofrece el \"backpressure\" en sistemas reactivos?  \nA) Eliminar la necesidad de manejar errores  \nB) Controlar la velocidad de procesamiento entre componentes  \nC) Reducir el uso de memoria estática  \nD) Aumentar el acoplamiento entre módulos  \nE) Simplificar el despliegue en la nube", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 10, "texto": "¿Cuál de estos lenguajes NO es comúnmente asociado con programación reactiva?  \nA) Java  \nB) Python  \nC) C#  \nD) COBOL  \nE) Scala", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}], "preguntasLibres": [{"numero": 11, "texto": "**Intermedio:** Compara las arquitecturas reactivas con las arquitecturas tradicionales (como MVC), destacando ventajas, desventajas y casos de uso apropiados para cada una.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Arquitecturas Reactivas vs. Arquitecturas Tradicionales (e.g., MVC)\n\nLas arquitecturas reactivas y las tradicionales, como el Modelo-Vista-Controlador (MVC), representan enfoques diferentes para el diseño y desarrollo de software.  Mientras que MVC se centra en la organización del código y la separación de responsabilidades, las arquitecturas reactivas priorizan la respuesta a eventos y la propagación de cambios de forma eficiente.  A continuación, se presenta una comparación detallada:\n\n**Arquitecturas Tradicionales (e.g., MVC):**\n\n* **Principio fundamental:** Separación de responsabilidades en Modelo (datos), Vista (interfaz de usuario) y Controlador (lógica de negocio).  El flujo de información suele ser síncrono y basado en peticiones/respuestas.\n* **Ventajas:**\n    * **Simplicidad y familiaridad:**  MVC es un patrón ampliamente conocido y utilizado, lo que facilita su aprendizaje y aplicación.\n    * **Estructura clara:** La separación de responsabilidades facilita el mantenimiento y la evolución del código.\n    * **Fácil de depurar:** El flujo de ejecución es generalmente lineal y predecible.\n* **Desventajas:**\n    * **Escalabilidad limitada:**  El manejo de un alto volumen de peticiones concurrentes puede ser un desafío.\n    * **Complejidad en aplicaciones grandes:** A medida que la aplicación crece, la comunicación entre componentes puede volverse compleja.\n    * **No optimizado para datos en tiempo real:** MVC no se adapta fácilmente a escenarios donde los datos cambian constantemente.\n* **Casos de uso apropiados:**\n    * Aplicaciones web tradicionales con un flujo de datos predecible.\n    * Aplicaciones CRUD (Crear, Leer, Actualizar, Eliminar) simples.\n    * Proyectos pequeños a medianos con requisitos de escalabilidad moderados.\n\n\n**Arquitecturas Reactivas:**\n\n* **Principio fundamental:**  Basadas en el Manifiesto Reactivo, estas arquitecturas se centran en la construcción de sistemas **responsivos, resilientes, elásticos y orientados a mensajes**.  La propagación de cambios se realiza de forma asíncrona y eficiente.\n* **Ventajas:**\n    * **Alta escalabilidad:**  El manejo de un gran volumen de datos y peticiones concurrentes es más eficiente.\n    * **Mayor resiliencia:**  El diseño basado en mensajes permite aislar fallos y mantener la disponibilidad del sistema.\n    * **Optimizado para datos en tiempo real:**  Ideal para aplicaciones con flujos de datos constantes y cambiantes, como streaming o chat.\n* **Desventajas:**\n    * **Mayor complejidad:**  Requiere un cambio de paradigma en el diseño y desarrollo de software.\n    * **Curva de aprendizaje más pronunciada:**  Dominar los conceptos de programación reactiva puede ser un desafío.\n    * **Depuración más compleja:**  El flujo de datos asíncrono puede dificultar la identificación de errores.\n* **Casos de uso apropiados:**\n    * Aplicaciones en tiempo real, como chat, juegos online y dashboards.\n    * Sistemas de alta disponibilidad y escalabilidad, como plataformas de streaming y comercio electrónico.\n    * Aplicaciones que procesan grandes volúmenes de datos, como análisis de Big Data.\n\n\n**Tabla comparativa:**\n\n| Característica | Arquitectura Tradicional (e.g., MVC) | Arquitectura Reactiva |\n|---|---|---|\n| **Principio fundamental** | Separación de responsabilidades | Responsividad, resiliencia, elasticidad, orientación a mensajes |\n| **Escalabilidad** | Limitada | Alta |\n| **Resiliencia** | Moderada | Alta |\n| **Manejo de datos en tiempo real** | No optimizado | Optimizado |\n| **Complejidad** | Menor | Mayor |\n| **Curva de aprendizaje** | Menor | Mayor |\n\n\n**Conclusión:**\n\nLa elección entre una arquitectura reactiva y una tradicional depende de las necesidades específicas del proyecto.  MVC es una opción sólida para aplicaciones simples y bien definidas, mientras que las arquitecturas reactivas son más adecuadas para sistemas complejos, escalables y que requieren un alto grado de responsividad.  Es importante evaluar cuidadosamente las ventajas y desventajas de cada enfoque antes de tomar una decisión.\n"}, {"numero": 12, "texto": "**Avanzado:** Analiza cómo el patrón *Event Sourcing* puede integrarse en una arquitectura reactiva para mejorar la resiliencia y escalabilidad. Proporciona un ejemplo concreto.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Integración de Event Sourcing en una Arquitectura Reactiva para Mejorar la Resiliencia y Escalabilidad\n\nEl patrón *Event Sourcing* se integra de manera sinérgica con las arquitecturas reactivas para construir sistemas altamente resilientes y escalables. En esencia, *Event Sourcing* persiste el estado de una aplicación como una secuencia inmutable de eventos, en lugar de actualizar directamente el estado actual.  Esta característica clave habilita las propiedades reactivas de **responsividad, resiliencia, elasticidad y orientación a mensajes**.\n\n**¿Cómo mejora Event Sourcing la resiliencia?**\n\n* **Recuperación ante fallos simplificada:** Si un componente falla, puede reconstruir su estado reproduciendo los eventos relevantes desde el principio o desde un *snapshot*.  Esto elimina la dependencia de bases de datos transaccionales complejas y facilita la recuperación.\n* **Auditoría y depuración mejoradas:**  El registro inmutable de eventos proporciona una pista de auditoría completa de todos los cambios en el sistema. Esto facilita la identificación de la causa raíz de los problemas y la depuración de errores.\n* **Consistencia eventual:**  En arquitecturas distribuidas, la consistencia eventual es a menudo preferible a la consistencia fuerte para mejorar la disponibilidad. *Event Sourcing* facilita la consistencia eventual al propagar los eventos de forma asíncrona a los diferentes componentes del sistema.\n\n**¿Cómo mejora Event Sourcing la escalabilidad?**\n\n* **Lectura y escritura desacopladas:** La separación entre la escritura de eventos y la lectura del estado permite escalar cada parte de forma independiente. Los eventos se pueden escribir en un *log* de alta velocidad, mientras que las proyecciones del estado se pueden optimizar para consultas específicas.\n* **CQRS (Command Query Responsibility Segregation):** *Event Sourcing* se combina a menudo con CQRS, lo que permite optimizar las operaciones de lectura y escritura por separado. Las consultas se ejecutan contra vistas materializadas generadas a partir de los eventos, lo que mejora el rendimiento de lectura.\n* **Procesamiento paralelo:** Los eventos se pueden procesar en paralelo por múltiples consumidores, lo que permite escalar horizontalmente el sistema.\n\n\n**Ejemplo concreto: Una plataforma de comercio electrónico**\n\nImaginemos una plataforma de comercio electrónico que utiliza *Event Sourcing*.  Cuando un cliente realiza un pedido, se genera un evento `OrderCreated`. Este evento se persiste en un *event store* (ej. Kafka, Apache Pulsar).  \n\nDiversos microservicios reaccionan a este evento:\n\n* **Servicio de inventario:**  Recibe el evento `OrderCreated` y reduce el stock de los productos pedidos.  Genera un evento `InventoryUpdated`.\n* **Servicio de facturación:** Recibe el evento `OrderCreated` y genera una factura. Genera un evento `InvoiceCreated`.\n* **Servicio de envío:** Recibe el evento `OrderCreated` y programa el envío. Genera un evento `ShippingScheduled`.\n\nCada microservicio mantiene su propio estado reconstruyéndolo a partir de los eventos relevantes.  Si el servicio de inventario falla, puede reconstruir su estado reproduciendo los eventos `InventoryUpdated`.\n\nAdemás, se pueden crear vistas materializadas para consultas específicas.  Por ejemplo, se puede crear una vista que muestre el estado actual de un pedido combinando los eventos `OrderCreated`, `InventoryUpdated`, `InvoiceCreated` y `ShippingScheduled`.  Esta vista se actualiza asíncronamente a medida que se generan nuevos eventos.\n\n\n**Conclusión:**\n\n*Event Sourcing*, combinado con una arquitectura reactiva, ofrece una potente solución para construir sistemas resilientes y escalables.  Al persistir el estado como una secuencia inmutable de eventos, se facilita la recuperación ante fallos, la auditoría, la escalabilidad y la consistencia eventual.  Este patrón es particularmente adecuado para sistemas distribuidos complejos con altos requisitos de disponibilidad y rendimiento.  Sin embargo, introduce complejidad adicional en el diseño y la implementación, por lo que es crucial evaluar cuidadosamente si es la solución adecuada para un proyecto específico.\n"}, {"numero": 13, "texto": "**Intermedio:** Describe cómo se maneja el backpressure en sistemas reactivos y qué estrategias pueden implementarse para gestionarlo eficientemente.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Manejo de Backpressure en Sistemas Reactivos\n\nEn sistemas reactivos, el backpressure se refiere a la situación en la que un componente productor de datos genera información a una velocidad mayor a la que un componente consumidor puede procesarla.  Esta disparidad puede llevar a la saturación de buffers, pérdida de datos, latencia incrementada e incluso fallos del sistema.  Es crucial entender cómo se maneja el backpressure para construir sistemas reactivos robustos y resilientes.\n\nEl manejo efectivo del backpressure se basa en el principio de **control de flujo**, permitiendo al consumidor regular la velocidad a la que recibe datos del productor.  En lugar de un flujo unidireccional, se establece una comunicación bidireccional donde el consumidor comunica su capacidad de procesamiento al productor.\n\n**Mecanismos de Manejo de Backpressure:**\n\nExisten varias estrategias para implementar el control de flujo y gestionar el backpressure:\n\n1. **Buffering:**  Una estrategia simple es utilizar buffers intermedios para almacenar temporalmente los datos producidos.  Si el consumidor es más lento, el buffer se llena; si es más rápido, el buffer se vacía.  Sin embargo, el buffering solo pospone el problema. Si la diferencia de velocidad es persistente, el buffer eventualmente se desbordará.  Por lo tanto, el buffering es más efectivo cuando las fluctuaciones de velocidad son temporales y no muy significativas.\n\n2. **Control de Flujo Explícito:**  Esta estrategia implica una comunicación directa entre el productor y el consumidor.  El consumidor solicita explícitamente una cantidad específica de datos o indica su capacidad de procesamiento al productor.  Ejemplos de mecanismos de control de flujo explícito incluyen:\n\n    * **Pull-based systems (Sistemas basados en extracción):** El consumidor solicita datos al productor según su necesidad.  El productor solo envía datos cuando se le solicitan.  Ejemplos incluyen la paginación en APIs REST o el uso de iteradores.\n    * **Explicit signaling (Señalización explícita):** El consumidor envía señales al productor para indicar su capacidad de procesamiento.  El productor ajusta su velocidad de producción en base a estas señales.\n\n\n3. **Control de Flujo Implícito:**  En este enfoque, el control de flujo se maneja de forma implícita a través del mecanismo de transporte o el framework reactivo.  Ejemplos incluyen:\n\n    * **TCP Flow Control:**  El protocolo TCP implementa control de flujo a nivel de red para evitar la congestión.\n    * **Reactive Streams (Flujos Reactivos):**  El estándar Reactive Streams define una interfaz para el control de flujo reactivo, permitiendo la interoperabilidad entre diferentes bibliotecas reactivas.  Utiliza un mecanismo de solicitud/suscripción donde el consumidor solicita una cantidad de datos y el productor responde enviando los datos o una señal de error.\n\n\n**Estrategias para una Gestión Eficiente del Backpressure:**\n\nPara gestionar el backpressure eficientemente, se pueden aplicar las siguientes estrategias:\n\n* **Monitoreo:**  Es fundamental monitorear las métricas clave como el tamaño del buffer, la tasa de producción y la tasa de consumo para detectar posibles problemas de backpressure.\n* **Escalabilidad:**  Diseñar el sistema para ser escalable permite aumentar la capacidad de procesamiento del consumidor cuando sea necesario.\n* **Degradación elegante:**  Implementar mecanismos de degradación elegante, como descartar datos menos importantes o reducir la calidad del servicio, permite al sistema seguir funcionando bajo presión.\n* **Retroalimentación:**  Proporcionar retroalimentación al usuario sobre el estado del sistema y las posibles demoras puede mejorar la experiencia del usuario.\n* **Selección de la estrategia adecuada:**  La estrategia de backpressure más adecuada depende de las características específicas del sistema, como la naturaleza de los datos, la tolerancia a la latencia y la complejidad de la implementación.\n\n\nEn resumen, el backpressure es un aspecto crucial del diseño de sistemas reactivos.  Implementar estrategias de control de flujo y aplicar las mejores prácticas para la gestión del backpressure garantiza la robustez, resiliencia y rendimiento del sistema bajo diferentes condiciones de carga.  La elección de la estrategia correcta depende de las necesidades específicas del sistema, y una comprensión profunda de las diferentes opciones disponibles es esencial para construir sistemas reactivos exitosos.\n"}, {"numero": 14, "texto": "**Avanzado:** Diseña una arquitectura reactiva para un sistema de comercio electrónico de alta demanda, explicando cómo garantizarías escalabilidad, baja latencia y tolerancia a fallos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Arquitectura Reactiva para un Sistema de Comercio Electrónico de Alta Demanda\n\nUn sistema de comercio electrónico de alta demanda requiere una arquitectura que pueda manejar un gran volumen de transacciones concurrentes con baja latencia y alta disponibilidad. Una arquitectura reactiva, basada en los principios del Manifiesto Reactivo, es ideal para este propósito. A continuación, se describe una arquitectura reactiva para un sistema de comercio electrónico, enfocándose en la escalabilidad, baja latencia y tolerancia a fallos:\n\n**1. Componentes Principales:**\n\n* **API Gateway:** Punto de entrada para todas las solicitudes.  Utiliza un balanceador de carga para distribuir el tráfico a los microservicios.\n* **Microservicios:** Funcionalidades descompuestas en servicios independientes (ej. catálogo, carrito, pedidos, pagos, envíos, usuarios).  Cada microservicio tiene su propia base de datos y se comunica con otros a través de mensajes asíncronos.\n* **Bus de Mensajes (ej. Kafka, RabbitMQ):** Facilita la comunicación asíncrona entre microservicios.  Permite desacoplamiento y escalabilidad independiente.\n* **Base de Datos Reactiva (ej. Cassandra, MongoDB):**  Ofrece alta disponibilidad, escalabilidad horizontal y consistencia eventual.  Se adapta bien a la naturaleza distribuida del sistema.\n* **Caché Distribuida (ej. Redis, Memcached):** Almacena datos frecuentemente accedidos para reducir la latencia y la carga en la base de datos.\n* **Sistema de Monitorización (ej. Prometheus, Grafana):**  Proporciona visibilidad del rendimiento del sistema, permitiendo la detección temprana de problemas y la optimización.\n\n**2. Escalabilidad:**\n\n* **Escalabilidad Horizontal:** Los microservicios, la base de datos reactiva y la caché distribuida pueden escalarse horizontalmente agregando más nodos al clúster según la demanda.  El bus de mensajes gestiona la distribución de la carga entre los nodos.\n* **Backpressure:** Mecanismo para controlar el flujo de datos entre componentes, evitando la sobrecarga del sistema.  Un componente sobrecargado puede solicitar a los componentes upstream que reduzcan la velocidad de envío de datos.\n* **Stateless Services:** Los microservicios son stateless, lo que facilita el escalado horizontal y la tolerancia a fallos.  El estado se almacena en la base de datos o la caché distribuida.\n\n**3. Baja Latencia:**\n\n* **Comunicación Asíncrona:** El uso de un bus de mensajes permite el procesamiento asíncrono de solicitudes, evitando bloqueos y reduciendo la latencia.\n* **Caché Distribuida:** El almacenamiento en caché de datos frecuentemente accedidos reduce el tiempo de respuesta a las solicitudes.\n* **Optimización de Consultas a la Base de Datos:** Diseño eficiente del esquema de la base de datos y uso de índices para acelerar las consultas.\n\n**4. Tolerancia a Fallos:**\n\n* **Replicación:** Los microservicios, la base de datos reactiva y la caché distribuida se replican en múltiples nodos para garantizar la disponibilidad en caso de fallo de un nodo.\n* **Circuit Breaker:**  Patrón de diseño que previene la cascada de fallos en el sistema.  Si un servicio falla repetidamente, el circuit breaker se abre, evitando que otras solicitudes lleguen al servicio fallido.\n* **Supervisión y Alertas:** El sistema de monitorización detecta fallos y envía alertas para que se tomen medidas correctivas.\n* **Fallback Mechanisms:**  Implementación de mecanismos de fallback para proporcionar una respuesta degradada en caso de fallo de un servicio.\n\n\n**5. Ejemplo de Flujo de una Transacción:**\n\n1. El usuario agrega un producto al carrito a través de la API Gateway.\n2. La API Gateway redirige la solicitud al microservicio de carrito.\n3. El microservicio de carrito publica un evento en el bus de mensajes.\n4. El microservicio de inventario consume el evento y actualiza el inventario.\n5. El microservicio de carrito confirma la operación al usuario.\n\n**Conclusión:**\n\nEsta arquitectura reactiva proporciona una base sólida para un sistema de comercio electrónico de alta demanda.  La combinación de microservicios, comunicación asíncrona, base de datos reactiva y caché distribuida permite lograr escalabilidad, baja latencia y tolerancia a fallos.  La monitorización continua y la implementación de patrones de diseño como circuit breaker y backpressure son cruciales para garantizar la resiliencia del sistema.  La modularidad de la arquitectura facilita la evolución y la adaptación a las cambiantes necesidades del negocio.\n"}, {"numero": 15, "texto": "**Intermedio**: Compara y contrasta el enfoque de la programación reactiva con el paradigma tradicional orientado a objetos, destacando ventajas y desventajas en el manejo de flujos de datos asíncronos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Comparación entre Programación Reactiva y Programación Orientada a Objetos en el manejo de flujos de datos asíncronos\n\nLa programación orientada a objetos (POO) y la programación reactiva (PR) son dos paradigmas de programación que ofrecen enfoques distintos para el desarrollo de software, especialmente en el manejo de flujos de datos asíncronos. Si bien pueden coexistir y complementarse, sus filosofías centrales difieren significativamente.\n\n**Programación Orientada a Objetos (POO):**\n\n* **Enfoque:** Se centra en la organización del código en objetos que encapsulan datos y métodos. La interacción entre objetos se realiza a través de llamadas a métodos, generalmente de forma síncrona.  Para manejar asincronía, la POO tradicionalmente utiliza callbacks, promesas o async/await.\n* **Manejo de asincronía:** En POO, el manejo de flujos asíncronos puede volverse complejo con el incremento de las interacciones.  Callbacks anidados (\"callback hell\") dificultan la lectura y el mantenimiento del código. Promesas y async/await mejoran la situación, pero la lógica asíncrona sigue estando dispersa en el código.\n* **Ventajas:**\n    * **Modularidad y Reusabilidad:** Facilita la creación de componentes reutilizables y bien definidos.\n    * **Encapsulación:** Protege los datos y la lógica interna de los objetos.\n    * **Fácil de aprender (inicialmente):**  Los conceptos básicos de POO son relativamente sencillos de comprender.\n* **Desventajas (en el contexto de asincronía):**\n    * **Complejidad en la gestión de flujos asíncronos complejos:** Callbacks anidados, manejo de errores disperso.\n    * **Dificultad para la composición de operaciones asíncronas:** Combinar múltiples flujos asíncronos puede ser engorroso.\n    * **Estado mutable:**  La gestión del estado en aplicaciones asíncronas puede ser propensa a errores.\n\n\n**Programación Reactiva (PR):**\n\n* **Enfoque:** Se basa en el concepto de flujos de datos asíncronos y la propagación de cambios. Los datos se representan como flujos observables (streams) a los que los componentes pueden suscribirse.  Cuando el valor de un flujo cambia, las notificaciones se propagan automáticamente a los suscriptores.\n* **Manejo de asincronía:** La PR simplifica el manejo de asincronía al tratar los datos como flujos continuos.  Los operadores como `map`, `filter`, `flatMap` permiten transformar y combinar flujos de forma declarativa, evitando callbacks anidados y facilitando la composición.\n* **Ventajas:**\n    * **Simplifica el código asíncrono:**  Elimina la necesidad de callbacks anidados y facilita la composición de operaciones asíncronas.\n    * **Manejo de errores centralizado:**  Los flujos pueden manejar errores de forma integrada.\n    * **Mayor eficiencia:** Permite optimizar el uso de recursos al procesar datos asíncronos de forma eficiente.\n    * **Mejor manejo del estado:**  Facilita la implementación de patrones como Redux o MobX para una gestión de estado más robusta.\n* **Desventajas:**\n    * **Curva de aprendizaje más pronunciada:**  Requiere comprender conceptos como observables, operadores y programación funcional reactiva.\n    * **Debugging puede ser más complejo:**  Rastrear el flujo de datos a través de múltiples operadores puede ser desafiante.\n    * **Overkill para aplicaciones simples:**  Para aplicaciones con poca asincronía, la PR puede añadir complejidad innecesaria.\n\n\n\n**Tabla comparativa:**\n\n| Característica | POO | PR |\n|---|---|---|\n| Enfoque | Objetos y métodos | Flujos de datos y propagación de cambios |\n| Manejo de asincronía | Callbacks, Promesas, Async/await | Observables y operadores |\n| Complejidad asíncrona | Alta | Baja |\n| Composición asíncrona | Difícil | Fácil |\n| Manejo de errores | Disperso | Centralizado |\n| Curva de aprendizaje | Inicialmente baja, alta para asincronía compleja | Alta |\n\n\n**Conclusión:**\n\nLa POO y la PR ofrecen diferentes enfoques para el desarrollo de software. Mientras que la POO es un paradigma general con mecanismos para manejar asincronía, la PR se centra específicamente en la gestión eficiente de flujos de datos asíncronos.  La elección del paradigma depende de las necesidades del proyecto.  Para aplicaciones con una alta complejidad asíncrona, la PR ofrece una solución más elegante y mantenible.  Sin embargo, para proyectos más simples, la POO puede ser suficiente.  En muchos casos, ambos paradigmas pueden coexistir y complementarse, aprovechando las fortalezas de cada uno.\n"}], "casosUso": [{"numero": 16, "descripcion": "**Caso 1**  \n- **Escenario**: Un sistema de reservas de vuelos debe manejar picos de tráfico masivos durante temporadas vacacionales, garantizando disponibilidad y consistencia de datos.  \n- **Requisitos**: Implementa un servicio de reservas reactivo que utilice event sourcing para manejar cambios de estado y CQRS para separar consultas y comandos.  \n- **Herramientas**: Akka, Apache Kafka, Cassandra.  \n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución al Caso 1: Sistema de Reservas de Vuelos con Event Sourcing y CQRS\n\nEste diseño propone una solución reactiva para un sistema de reservas de vuelos utilizando Event Sourcing, CQRS, Akka, Apache Kafka y Cassandra, enfocada en manejar picos de tráfico y garantizar la consistencia de datos.\n\n**Arquitectura:**\n\nLa arquitectura se basa en el patrón CQRS, separando las operaciones de lectura (Queries) de las de escritura (Commands).  Utilizamos Event Sourcing para persistir los cambios de estado como una secuencia inmutable de eventos.\n\n**Componentes Principales:**\n\n* **Command Service:** Recibe las solicitudes de reserva (Commands), valida la información y genera un evento.\n* **Event Store (Kafka):**  Almacena los eventos de forma persistente y ordenada. Kafka proporciona alta disponibilidad y escalabilidad para manejar el alto volumen de eventos durante picos de tráfico.\n* **Event Handlers (Akka Actors):**  Procesan los eventos del Event Store.  Existen diferentes tipos de Event Handlers:\n    * **Aggregate Handler:** Aplica los eventos al estado actual de la reserva (ej.,  `ReservaAgregada`).  Garantiza la consistencia del estado.\n    * **Projection Handler:** Crea y actualiza las vistas materializadas (read models) en Cassandra optimizadas para las consultas.  Por ejemplo, una vista para buscar vuelos disponibles.\n    * **Notification Handler:**  Envía notificaciones (ej., email de confirmación) basadas en los eventos.\n* **Query Service:** Recibe las solicitudes de consulta (Queries) y las responde utilizando las vistas materializadas en Cassandra.  Cassandra ofrece bajo latency y alta disponibilidad para las lecturas.\n\n**Flujo de una Reserva:**\n\n1. **Solicitud de Reserva (Command):** El usuario solicita una reserva a través de la interfaz de usuario. Esta solicitud se envía al Command Service.\n2. **Validación y Generación de Evento:** El Command Service valida la solicitud (ej., disponibilidad de asientos). Si la validación es exitosa, genera un evento (ej., `ReservaCreada`).\n3. **Publicación del Evento:** El evento se publica en el Event Store (Kafka).\n4. **Procesamiento del Evento:**\n    * **Aggregate Handler:**  El Aggregate Handler correspondiente a la reserva procesa el evento `ReservaCreada` y actualiza el estado interno de la reserva.\n    * **Projection Handler:**  El Projection Handler recibe el evento y actualiza la vista materializada de vuelos disponibles en Cassandra, decrementando el número de asientos.\n    * **Notification Handler:**  El Notification Handler recibe el evento y envía un email de confirmación al usuario.\n5. **Consulta de Disponibilidad (Query):**  El usuario puede consultar la disponibilidad de vuelos.  El Query Service consulta directamente la vista materializada en Cassandra, proporcionando una respuesta rápida.\n\n\n**Ventajas de esta solución:**\n\n* **Escalabilidad:**  Kafka y Cassandra permiten escalar horizontalmente para manejar picos de tráfico.  Akka facilita la distribución de la carga entre los actores.\n* **Consistencia de Datos:** Event Sourcing garantiza la consistencia del estado de las reservas mediante la secuencia inmutable de eventos.\n* **Rendimiento:**  CQRS permite optimizar las consultas y los comandos por separado. Cassandra proporciona un alto rendimiento para las lecturas.\n* **Auditabilidad:**  El Event Store proporciona un registro completo de todos los cambios de estado, facilitando la auditoría.\n* **Flexibilidad:**  La arquitectura permite añadir nuevas funcionalidades fácilmente mediante la creación de nuevos Event Handlers y vistas materializadas.\n\n\n**Consideraciones adicionales:**\n\n* **Manejo de Idempotencia:**  Es importante manejar la idempotencia de los comandos para evitar la duplicación de reservas en caso de reintentos.\n* **Versionado de Eventos:**  Se debe implementar un mecanismo de versionado de eventos para asegurar la compatibilidad hacia atrás.\n* **Monitoreo:**  Es crucial monitorear el rendimiento del sistema, especialmente durante picos de tráfico.\n\n\n**Conclusión:**\n\nEsta solución proporciona una arquitectura robusta y escalable para un sistema de reservas de vuelos, utilizando Event Sourcing y CQRS para manejar picos de tráfico y garantizar la consistencia de datos. La combinación de Akka, Kafka y Cassandra ofrece las herramientas necesarias para implementar un sistema de alto rendimiento y disponibilidad.  El diseño modular y la separación de responsabilidades facilitan el mantenimiento y la evolución del sistema a largo plazo.\n"}, {"numero": 17, "descripcion": "1. **Caso de Uso: Sistema de Reservas en Tiempo Real para un Cine**  \n   - **Escenario**: Un cine necesita un sistema que actualice en tiempo real la disponibilidad de asientos cuando los clientes realizan reservas desde múltiples dispositivos.  \n   - **Requisitos**: Implementar un backend reactivo que maneje concurrencia alta y garantice consistencia en los datos. El estudiante debe usar un enfoque de eventos para actualizar el estado de los asientos.  \n   - **Herramientas/Enfoques**: Akka (Actor Model), Spring WebFlux, bases de datos reactivas como MongoDB o Cassandra.  \n\n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución: Sistema de Reservas en Tiempo Real para un Cine\n\nEste documento describe una solución para un sistema de reservas en tiempo real para un cine utilizando un backend reactivo con Akka, Spring WebFlux y MongoDB.  El enfoque se centra en la gestión de la concurrencia y la consistencia de datos mediante un sistema basado en eventos.\n\n**Arquitectura:**\n\nLa arquitectura propuesta se basa en los siguientes componentes:\n\n* **API REST con Spring WebFlux:**  Expone endpoints para que los clientes puedan consultar la disponibilidad de asientos y realizar reservas.\n* **Actores de Akka:** Gestionan el estado de las salas y los asientos. Cada sala de cine se representa mediante un actor, y cada asiento dentro de la sala también puede ser un actor (o el estado de los asientos puede gestionarse dentro del actor de la sala, dependiendo de la granularidad deseada).\n* **MongoDB:** Almacena la información de las películas, horarios, salas y la configuración general del cine. Se utiliza como una base de datos eventualmente consistente para información que no requiere una consistencia estricta en tiempo real, como la cartelera.  El estado de las reservas se gestiona principalmente en memoria por los actores de Akka para un rendimiento óptimo.\n* **Sistema de Eventos:**  Se utiliza para propagar los cambios en el estado de los asientos.  Cuando un asiento se reserva, se publica un evento. Otros componentes del sistema, como la API REST, pueden suscribirse a estos eventos para actualizar su estado en tiempo real.\n\n**Flujo de una Reserva:**\n\n1. **Solicitud del Cliente:** El cliente solicita la disponibilidad de asientos para una función específica a través de la API REST.\n2. **Consulta de Disponibilidad:** La API REST envía un mensaje al actor correspondiente a la sala de cine.\n3. **Respuesta del Actor:** El actor de la sala verifica el estado de los asientos y responde con la información de disponibilidad.\n4. **Solicitud de Reserva:** El cliente selecciona los asientos y envía una solicitud de reserva a la API REST.\n5. **Procesamiento de la Reserva:** La API REST envía un mensaje de reserva al actor de la sala.\n6. **Validación y Actualización:** El actor de la sala valida la solicitud (verifica que los asientos sigan disponibles) y, si es válida, actualiza el estado de los asientos.\n7. **Publicación del Evento:** El actor publica un evento indicando que los asientos se han reservado.\n8. **Notificación:** La API REST, suscrita al evento, recibe la notificación y actualiza su estado interno.  También puede notificar al cliente sobre el éxito de la reserva.\n9. **Persistencia (opcional):**  El actor puede persistir el estado de la reserva en MongoDB de forma asíncrona para tener un registro histórico y para la recuperación en caso de fallos.  Esto no bloquea el flujo principal de la reserva.\n\n\n**Implementación con Akka y Spring WebFlux:**\n\n```java\n// Ejemplo simplificado de un Actor de Sala\npublic class SalaActor extends AbstractActor {\n    private final Map<String, Boolean> asientos;\n\n    public SalaActor(int numAsientos) {\n        this.asientos = new HashMap<>();\n        for (int i = 1; i <= numAsientos; i++) {\n            asientos.put(\"A\" + i, false); // Inicialmente todos los asientos están libres\n        }\n    }\n\n    @Override\n    public Receive createReceive() {\n        return receiveBuilder()\n                .match(ConsultaDisponibilidad.class, msg -> {\n                    sender().tell(new Disponibilidad(asientos), self());\n                })\n                .match(ReservaAsientos.class, msg -> {\n                    if (msg.asientos.stream().allMatch(asiento -> asientos.getOrDefault(asiento, true) == false)) {\n                        msg.asientos.forEach(asiento -> asientos.put(asiento, true));\n                        getContext().getSystem().getEventStream().publish(new AsientosReservados(msg.asientos));\n                        sender().tell(new ReservaConfirmada(), self());\n                    } else {\n                        sender().tell(new ReservaRechazada(), self());\n                    }\n                })\n                .build();\n    }\n}\n\n// ... Mensajes, DTOs, y configuración de Spring WebFlux ...\n```\n\n\n**Ventajas de este enfoque:**\n\n* **Concurrencia:** Akka maneja la concurrencia de forma eficiente, permitiendo que múltiples clientes realicen reservas simultáneamente sin problemas de consistencia.\n* **Escalabilidad:** El sistema puede escalar horizontalmente agregando más actores de sala.\n* **Resiliencia:**  El modelo de actores proporciona tolerancia a fallos.\n* **Tiempo Real:** El uso de eventos permite actualizaciones en tiempo real del estado de los asientos.\n\n\n**Consideraciones adicionales:**\n\n* **Manejo de errores:** Implementar un manejo adecuado de errores para gestionar situaciones como fallos de red o errores en la base de datos.\n* **Seguridad:** Implementar medidas de seguridad para proteger la información del cliente y prevenir accesos no autorizados.\n* **Pruebas:** Realizar pruebas exhaustivas para asegurar el correcto funcionamiento del sistema bajo diferentes escenarios de carga.\n* **Optimización del rendimiento:**  Considerar estrategias de caching y optimización de consultas para mejorar el rendimiento.\n\n\nEsta solución proporciona una base sólida para un sistema de reservas en tiempo real para un cine.  La combinación de Akka, Spring WebFlux y una base de datos reactiva permite construir un sistema escalable, resiliente y con un alto rendimiento.  Recuerda que este es un ejemplo simplificado y debe ser adaptado a las necesidades específicas del cine.\n"}]}, "createdAt": "2025-04-29T15:31:50.712039", "expiration": "2025-05-06T20:31:50.656Z", "publicAccess": true}