{"id": "7c246da7", "examenData": {"id": "932360", "fecha": "2025-04-08", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál de las siguientes es una característica principal de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Alta acoplamiento entre componentes", "valor": "A"}, {"texto": "B) Procesamiento en lotes (batch)", "valor": "B"}, {"texto": "C) Respuesta en tiempo real a eventos", "valor": "C"}, {"texto": "D) Uso exclusivo de bases de datos relacionales", "valor": "D"}, {"texto": "E) Dependencia de un único servidor centralizado", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1. **Intermedio:** Explique las diferencias clave entre una arquitectura en capas tradicional (como MVC) y una arquitectura hexagonal (puertos y adaptadores). Incluya en su respuesta ventajas, desventajas y casos de uso recomendados para cada enfoque.", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso de Uso 1-1:**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos de ventas flash, garantizando alta disponibilidad y respuestas en tiempo real para actualizaciones de inventario y notificaciones a los usuarios.  \n\n**Preguntas de caso de uso:**  \n1. ¿Cómo diseñarías un sistema reactivo para escalar automáticamente durante picos de demanda?  \n2. ¿Qué estrategias usarías para garantizar la consistencia de datos en un entorno distribuido?  \n\n**Requisitos específicos:**  \n- Implementar un sistema basado en mensajería asíncrona para actualizaciones de inventario.  \n- Usar patrones como Circuit Breaker para manejar fallos en servicios externos.  \n- Garantizar latencia mínima en notificaciones en tiempo real.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Kafka, Akka, Spring WebFlux, Kubernetes (para escalado automático).  \n- Enfoques: Event Sourcing, CQRS, replicación de datos eventualmente consistente.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-07T20:10:06.909272", "expiration": "2025-04-15T01:10:06.883Z", "publicAccess": true}