{"id": "90a6d72a", "examenData": {"examen_id": "278546", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-31T22:17:59.579Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño es fundamental para la gestión de errores en un sistema reactivo?\nA) Singleton\nB) Factory\nC) Circuit Breaker\nD) Observer\nE) Strategy", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 2, "texto": "¿Cuál tecnología es ampliamente utilizada para implementar flujos de datos reactivos?\nA) JDBC\nB)  Spring MVC\nC)  Reactive Streams\nD)  Hibernate\nE)  JSP", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 3, "texto": "¿Qué característica describe mejor la elasticidad en una arquitectura reactiva?\nA) Capacidad de manejar picos de carga\nB)  Alta disponibilidad\nC)  Tolerancia a fallos\nD)  Respuesta rápida a eventos\nE)  Escalabilidad vertical", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 4, "texto": "¿Cuál es la principal ventaja de utilizar un backpressure en un sistema reactivo?\nA)  Mejor rendimiento en bases de datos\nB)  Aumento de la latencia\nC)  Prevención de sobrecarga del sistema\nD)  Reducción del consumo de memoria\nE)  Mayor complejidad de implementación", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 5, "texto": "¿Qué concepto se refiere a la capacidad de un sistema reactivo para continuar funcionando a pesar de fallos?\nA)  Escalabilidad\nB)  Elasticidad\nC)  Resiliencia\nD)  Responsividad\nE)  Modularidad", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}], "preguntas_libres": [{"numero": 6, "texto": "Explique cómo la programación reactiva y el patrón de diseño \"Command Query Responsibility Segregation\" (CQRS) pueden complementarse para mejorar la escalabilidad y el rendimiento de una aplicación distribuida.", "puntaje": 1, "respuestaAlumno": "", "archivoId": "anexo_284879_1748470036329", "archivoNombre": "Diagrama sin título.drawio.pdf", "archivoUrl": "https://cloud.appwrite.io/v1/storage/buckets/APPWRITE_BUCKET_DOCUMENTO_ANEXO_EXAMEN/files/anexo_284879_1748470036329/view?project=67e565df00172171560", "archivoTamaño": 2352, "archivoTipo": "application/pdf", "respuestaProfesor": "La programación reactiva y CQRS se complementan para construir aplicaciones distribuidas escalables y de alto rendimiento.  La programación reactiva, basada en flujos de datos asíncronos, gestiona eficientemente las actualizaciones en tiempo real, mientras que CQRS separa las operaciones de lectura (Queries) y escritura (Commands) del modelo de datos.  Esta separación permite optimizar cada ruta de forma independiente.  Por ejemplo, las consultas, a menudo más frecuentes, pueden escalarse horizontalmente utilizando cachés distribuidas y bases de datos de lectura optimizadas.  Los comandos, que requieren consistencia, pueden implementarse con un enfoque orientado a eventos y mecanismos de concurrencia optimizados.  Al combinar ambos patrones, se logra una mayor  reactividad,  escalabilidad y tolerancia a fallos, ya que las operaciones de lectura no bloquean las de escritura y viceversa, facilitando la gestión de la complejidad inherente a los sistemas distribuidos.  Además, la naturaleza asíncrona de la programación reactiva se alinea perfectamente con el procesamiento de eventos típico de CQRS, simplificando la implementación y mejorando la eficiencia.\n"}, {"numero": 7, "texto": "Analice la importancia del manejo de errores y la resiliencia en un sistema distribuido basado en arquitecturas reactivas.  ¿Qué estrategias se pueden implementar para garantizar la tolerancia a fallos y la recuperación ante situaciones inesperadas?", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "En sistemas distribuidos reactivos, el manejo de errores y la resiliencia son cruciales para mantener la disponibilidad y la consistencia.  Dado que estos sistemas operan en entornos complejos y propensos a fallos, es esencial diseñar mecanismos que permitan al sistema tolerar fallos individuales sin afectar el funcionamiento global.  \n\nLa resiliencia se logra mediante la implementación de estrategias como la replicación de datos, el aislamiento de fallos mediante *bulkheads* y *circuit breakers*, y la supervisión continua del estado del sistema. La replicación asegura la disponibilidad de la información incluso si un nodo falla.  Los *bulkheads* limitan el impacto de un fallo a una sección específica del sistema, mientras que los *circuit breakers* previenen la cascada de fallos al interrumpir la comunicación con un servicio problemático.  Finalmente, la supervisión permite detectar y reaccionar a problemas rápidamente.  Estas estrategias, combinadas con un diseño basado en mensajes asíncronos, contribuyen a la construcción de sistemas robustos y capaces de recuperarse ante situaciones inesperadas.\n"}, {"numero": 8, "texto": "Compare y contraste dos frameworks o librerías populares para la implementación de arquitecturas reactivas (ej: Spring Reactor, Akka).  Discuta sus fortalezas y debilidades en diferentes contextos de aplicación.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Spring Reactor y Akka son dos frameworks populares para implementar sistemas reactivos, aunque difieren en enfoque y alcance. Reactor, basado en el patrón Reactor y centrado en flujos de datos, es ideal para aplicaciones intensivas en E/S como microservicios y APIs REST. Su fortaleza radica en su simplicidad y fácil integración con Spring. Sin embargo, su modelo de concurrencia basado en hilos puede ser menos eficiente para tareas de alta computación.\n\nAkka, por otro lado, adopta el modelo Actor, promoviendo la concurrencia basada en mensajes y la tolerancia a fallos a través de la supervisión.  Es adecuado para sistemas distribuidos complejos y aplicaciones con alta concurrencia como procesamiento de datos en tiempo real. Su mayor fortaleza es su robusta gestión de la concurrencia y la distribución.  Sin embargo, su curva de aprendizaje es más pronunciada que la de Reactor, requiriendo un entendimiento más profundo de los actores y su ciclo de vida.  La elección entre ambos depende del contexto de la aplicación: Reactor para simplicidad en E/S, Akka para robustez en concurrencia distribuida.\n"}, {"numero": 9, "texto": "Diseñe una arquitectura reactiva para una aplicación de comercio electrónico que maneje un alto volumen de transacciones concurrentes, incluyendo la gestión de inventario, procesamiento de pagos y notificaciones al usuario.  Detalle las tecnologías y patrones de diseño que utilizaría y justifique sus elecciones.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Para una aplicación de comercio electrónico de alto volumen, una arquitectura reactiva es crucial.  Utilizaría microservicios basados en Spring Boot con Spring WebFlux para manejar la concurrencia.  Cada microservicio, como gestión de inventario, procesamiento de pagos y notificaciones, operaría independientemente y se comunicaría de forma asíncrona utilizando un broker de mensajes como Kafka.  Esto permite escalabilidad y resiliencia.  \n\nPara la gestión de inventario, emplearía el patrón CQRS (Command Query Responsibility Segregation) para separar las operaciones de lectura y escritura, optimizando el rendimiento.  El procesamiento de pagos se integraría con pasarelas de pago a través de APIs RESTful, asegurando transacciones seguras. Las notificaciones al usuario se implementarían con un sistema de publicación/suscripción utilizando WebSockets o Server-Sent Events para actualizaciones en tiempo real.  Finalmente, un gateway API como Spring Cloud Gateway gestionaría las solicitudes entrantes y dirigiría el tráfico a los microservicios correspondientes.  Esta arquitectura reactiva, basada en eventos y no bloqueante, garantiza un rendimiento óptimo y una alta disponibilidad incluso bajo picos de tráfico.\n"}], "casos_uso": [{"numero": 10, "descripcion": "Demostrar que el sistema puede escalar el número de workers para procesar un aumento en la tasa de ingesta de fragmentos y que la falla simulada de un worker no detiene el procesamiento por parte de otros.\n    -   **Sugerencias de herramientas o enfoques:** Akka Actors/Akka Streams (Scala/Java), RabbitMQ/Kafka para colas de mensajes, Kubernetes para orquestación y escalado de workers. Considerar el patrón de Backpressure.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "Para demostrar la escalabilidad y la tolerancia a fallos en el procesamiento de fragmentos, se propone una solución basada en Akka Streams y Kubernetes, utilizando Kafka como sistema de mensajería.\n\nLa arquitectura consiste en un conjunto de workers implementados como Akka Actors, cada uno suscrito a un topic de Kafka donde se publican los fragmentos.  Akka Streams proporciona un framework reactivo para procesar los flujos de datos provenientes de Kafka.  La configuración de `SupervisionStrategy` dentro del sistema Akka permite reiniciar automáticamente los actores en caso de fallo, garantizando la continuidad del procesamiento.\n\nEl escalado se gestiona a través de Kubernetes.  Se define un Deployment para los workers, configurado con un Horizontal Pod Autoscaler (HPA). El HPA monitoriza el consumo de recursos de los pods (CPU o memoria) y ajusta automáticamente el número de réplicas (workers) en función de la carga.  Un aumento en la tasa de ingesta de fragmentos se traduce en un mayor consumo de recursos, lo que dispara el HPA para escalar horizontalmente el número de workers.\n\nKafka actúa como buffer, desacoplando la ingesta de fragmentos del procesamiento.  Esto permite manejar picos de carga sin perder datos.  El patrón de Backpressure se implementa mediante la configuración del `bufferSize` en Akka Streams.  Si la tasa de procesamiento de un worker es menor que la tasa de ingesta, el buffer se llena, aplicando backpressure a Kafka y regulando el flujo de datos.\n\nPara simular la falla de un worker, se puede utilizar el comando `kubectl delete pod <nombre_del_pod>` en Kubernetes.  Esto eliminará un pod, simulando un fallo.  El HPA detectará la reducción en el número de réplicas y creará un nuevo pod para mantener el número deseado de workers, demostrando la tolerancia a fallos del sistema.  El resto de workers continuarán procesando los fragmentos sin interrupción, gracias a la naturaleza distribuida de Kafka y la gestión de fallos de Akka.  Esta arquitectura garantiza la escalabilidad y la resiliencia del sistema frente a fluctuaciones en la carga y fallos de los workers.\n", "archivoId": "anexo_284879_1748469930521", "archivoNombre": "Documentos-de-embarque.pdf", "archivoUrl": "https://cloud.appwrite.io/v1/storage/buckets/APPWRITE_BUCKET_DOCUMENTO_ANEXO_EXAMEN/files/anexo_284879_1748469930521/view?project=67e565df00172171560", "archivoTamaño": 168651, "archivoTipo": "application/pdf"}, {"numero": 11, "descripcion": "-   **Escenario práctico detallado:** Un sistema de gestión de inventario para una cadena de supermercados con cientos de tiendas necesita procesar en tiempo real las ventas de cada caja registradora, actualizar el stock centralizado y generar automáticamente pedidos de reposición a los proveedores cuando", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "Para gestionar el inventario en tiempo real y la reposición automática en una cadena de supermercados con cientos de tiendas, se propone una solución basada en una arquitectura distribuida con los siguientes componentes:\n\n**1. Punto de Venta (POS):** Cada caja registradora contará con un sistema POS conectado a una base de datos local que almacena temporalmente las transacciones.  Al finalizar cada venta, el POS enviará los detalles de la transacción (productos vendidos, cantidades, etc.) a un servidor central a través de una conexión segura.\n\n**2. Servidor Central de Inventario:** Este servidor recibirá las actualizaciones de ventas de todos los POS en tiempo real.  Utilizará una base de datos centralizada para mantener un registro preciso del inventario global de la cadena.  Al recibir una actualización, el servidor decrementará el stock del producto correspondiente y verificará si se ha alcanzado el punto de reorden.\n\n**3. Sistema de Reposición Automática:** Si el stock de un producto cae por debajo del punto de reorden predefinido, el sistema generará automáticamente una orden de compra al proveedor correspondiente.  Esta orden incluirá la cantidad de producto a reponer, la información del proveedor y la tienda de destino.  El sistema también notificará al departamento de compras sobre la orden generada.\n\n**4. Interfaz con Proveedores:** El sistema se integrará con los sistemas de los proveedores para automatizar el proceso de pedido.  Las órdenes de compra se enviarán electrónicamente a los proveedores, quienes podrán confirmar la recepción y programar la entrega.\n\n**5. Sistema de Reportes:** El sistema generará reportes de inventario, ventas y reposición para facilitar la toma de decisiones.  Estos reportes permitirán a la gerencia monitorear el desempeño de las tiendas, identificar tendencias de ventas y optimizar los niveles de inventario.\n\n**Tecnologías:** Se recomienda utilizar una base de datos distribuida como Apache Cassandra o Amazon DynamoDB para manejar el alto volumen de transacciones y asegurar la alta disponibilidad.  Para la comunicación entre los POS y el servidor central, se puede utilizar un protocolo ligero como MQTT o un sistema de mensajería como Kafka.\n\nEsta solución permite una gestión eficiente del inventario, minimiza la posibilidad de desabastecimiento, reduce los costos de almacenamiento y mejora la satisfacción del cliente.\n"}]}, "createdAt": "2025-05-31T17:17:59.632735", "expiration": "2025-06-07T22:17:59.579Z", "publicAccess": true}