{"id": "95d3d192", "examenData": {"examen_id": "477032", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-22T01:41:09.527Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza a menudo para manejar la concurrencia en sistemas reactivos?\nA) Singleton\nB) Factory\nC) Actor\nD) Observer\nE) Command", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 2, "texto": "¿Cuál es la principal ventaja del uso de backpressure en un sistema reactivo?\nA) Mayor rendimiento\nB) Menor latencia\nC) Prevención de sobrecarga del sistema\nD) Aumento de la concurrencia\nE) Simplificación del código", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}], "preguntas_libres": [{"numero": 3, "texto": "Explique cómo la programación reactiva aborda el problema de la gestión de errores en un sistema distribuido, considerando la propagación de fallos y la recuperación de la aplicación.  Proporcione ejemplos concretos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Gestión de Errores en Sistemas Distribuidos con Programación Reactiva\n\nLa programación reactiva ofrece un enfoque elegante y robusto para la gestión de errores en sistemas distribuidos, simplificando el manejo de la propagación de fallos y facilitando la recuperación de la aplicación.  En lugar de depender de mecanismos tradicionales como `try-catch` dispersos por el código, la programación reactiva utiliza flujos de datos asíncronos y operadores específicos para encapsular y gestionar los errores de forma declarativa. Esto proporciona una mayor claridad, facilita el razonamiento sobre el comportamiento del sistema en situaciones de fallo y promueve la resiliencia.\n\n**Propagación de Fallos:**\n\nEn un sistema distribuido, un fallo en un componente puede propagarse rápidamente a otros, causando un efecto cascada.  La programación reactiva aborda esto mediante:\n\n* **Encapsulación de Errores en el Flujo de Datos:** Los errores se representan como eventos dentro del flujo de datos reactivo, en lugar de excepciones que interrumpen el flujo de ejecución.  Esto permite que el sistema continúe procesando otros eventos, incluso en presencia de fallos.\n\n* **Operadores de Gestión de Errores:**  Bibliotecas reactivas como RxJava o Reactor ofrecen operadores específicos para manejar errores, como:\n    * `onErrorReturn`:  Retorna un valor por defecto en caso de error.\n    * `onErrorResume`:  Sustituye el flujo de datos original por otro en caso de error, permitiendo una lógica de fallback.\n    * `retry`:  Reintenta la operación un número determinado de veces en caso de error.\n    * `retryWhen`:  Permite una lógica de reintento más sofisticada, controlando el tiempo entre reintentos y el tipo de errores que se reintentan.\n\n**Recuperación de la Aplicación:**\n\nLa programación reactiva facilita la recuperación de la aplicación tras un fallo mediante:\n\n* **Aislamiento de Fallos:** La encapsulación de errores en el flujo de datos limita el impacto de un fallo a una parte específica del sistema, evitando que se propague a otros componentes.\n\n* **Fallback y Degradación Graciosa:** Los operadores como `onErrorResume` permiten implementar estrategias de fallback, ofreciendo una funcionalidad alternativa o degradada en caso de fallo de un servicio.  Esto mejora la experiencia del usuario y mantiene la disponibilidad del sistema.\n\n* **Supervisión y Observabilidad:**  La naturaleza reactiva del sistema facilita la supervisión del estado de los componentes y la detección de fallos.  Los flujos de datos pueden ser observados para identificar patrones de error y tomar medidas correctivas.\n\n**Ejemplos Concretos:**\n\n1. **Servicio de Recomendaciones:** Imaginemos un servicio que obtiene recomendaciones de productos de múltiples microservicios.  Si uno de estos microservicios falla, en lugar de que toda la aplicación falle, podemos usar `onErrorResume` para obtener recomendaciones de un servicio de fallback o mostrar un conjunto de recomendaciones por defecto.\n\n```java\n// Usando Reactor\nMono<List<Recommendation>> recommendations = \n    recommendationsService.getRecommendations()\n        .onErrorResume(error -> fallbackRecommendationsService.getRecommendations());\n```\n\n2. **Retrying una Operación de Red:** Si una llamada a una API externa falla debido a un problema de red temporal, podemos usar `retryWhen` para reintentar la operación con un retardo exponencial.\n\n```java\n// Usando RxJava\nObservable<Data> data = api.getData()\n    .retryWhen(errors -> errors\n        .flatMap(error -> {\n            if (error instanceof NetworkException) {\n                return Flowable.timer(retryDelay, TimeUnit.MILLISECONDS);\n            } else {\n                return Flowable.error(error);\n            }\n        }));\n```\n\n**Conclusión:**\n\nLa programación reactiva proporciona un conjunto de herramientas poderosas para gestionar errores en sistemas distribuidos. La encapsulación de errores, los operadores específicos y la naturaleza asíncrona de los flujos de datos facilitan la propagación controlada de fallos, la implementación de estrategias de recuperación y la construcción de aplicaciones más resilientes y tolerantes a fallos.  Al adoptar un enfoque declarativo para la gestión de errores, los desarrolladores pueden escribir código más limpio, comprensible y fácil de mantener, lo que en última instancia conduce a sistemas más robustos y fiables.\n"}], "casos_uso": [{"numero": 4, "descripcion": "Use Case 1 (Ingestión y Distribución de Video): Describe cómo una arquitectura reactiva puede manejar la alta tasa de datos de múltiples fuentes de video entrantes y distribuirlas eficientemente a los servicios de transcodificación y a los usuarios finales, asegurando que el sistema permanezca receptivo incluso bajo carga extrema. Propón un patrón de comunicación asíncrona adecuado.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para el Caso de Ingestión y Distribución de Video con Arquitectura Reactiva\n\nEste caso requiere una arquitectura reactiva capaz de manejar un alto volumen de datos de video desde múltiples fuentes, distribuirlos eficientemente a servicios de transcodificación y a usuarios finales, y mantener la responsividad bajo carga extrema.  A continuación, se propone una solución utilizando un patrón de comunicación asíncrona basado en un **bus de mensajes (Message Broker)**.\n\n**Arquitectura:**\n\nLa arquitectura se compone de los siguientes componentes:\n\n1. **Ingesta de Video (Video Ingestion):**  Múltiples instancias de este componente reciben flujos de video de diversas fuentes.  Cada instancia es responsable de recibir, segmentar el video en chunks y publicar metadatos y la ubicación de estos chunks en el bus de mensajes.  No realizan transcodificación, lo que les permite mantenerse ligeros y receptivos.\n\n2. **Bus de Mensajes (Message Broker - ej. Kafka, RabbitMQ):** Actúa como el backbone de la arquitectura, desacoplando productores (Ingesta de Video) y consumidores (Transcodificación, Distribución).  Proporciona durabilidad, escalabilidad y tolerancia a fallos. Se utilizarán diferentes topics para la gestión de mensajes: uno para nuevos videos, otro para notificaciones de transcodificación completada, etc.\n\n3. **Servicio de Transcodificación (Transcoding Service):**  Múltiples instancias de este servicio se suscriben al topic de nuevos videos.  Consumen mensajes, descargan los chunks de video desde su ubicación, realizan la transcodificación a diferentes formatos (ej. 480p, 720p, 1080p) y publican un mensaje en el topic de transcodificación completada, incluyendo la ubicación de los videos transcodificados.  La escalabilidad horizontal de este servicio es crucial para manejar picos de demanda.\n\n4. **Servicio de Distribución (Distribution Service):** Este servicio se suscribe al topic de transcodificación completada.  Recibe notificaciones de videos transcodificados, actualiza la base de datos con la información de los diferentes formatos disponibles y se encarga de servir el video a los usuarios finales a través de un CDN o un sistema de streaming.\n\n5. **Base de Datos (Database):** Almacena metadatos de los videos, incluyendo información sobre las diferentes transcodificaciones disponibles y su ubicación.\n\n**Patrón de Comunicación Asíncrona:**\n\nEl patrón utilizado es **publish-subscribe** a través del bus de mensajes.  Esto permite:\n\n* **Desacoplamiento:**  Los componentes no necesitan conocerse entre sí, solo interactúan a través del bus de mensajes.\n* **Escalabilidad:**  Cada componente puede escalar independientemente según la demanda.\n* **Resiliencia:**  Si un componente falla, los demás continúan funcionando.  El bus de mensajes garantiza la entrega de los mensajes una vez que el componente se recupera.\n* **Backpressure:**  Mecanismos de backpressure en el bus de mensajes pueden ayudar a gestionar la carga en los consumidores, evitando que se saturen.\n\n**Flujo de Trabajo:**\n\n1. Un nuevo flujo de video llega al componente de Ingesta de Video.\n2. La Ingesta de Video segmenta el video, guarda los chunks y publica un mensaje en el topic de \"nuevos videos\" con la ubicación de los chunks y metadatos.\n3. El Servicio de Transcodificación consume el mensaje, descarga los chunks, realiza la transcodificación y publica un mensaje en el topic de \"transcodificación completada\".\n4. El Servicio de Distribución consume el mensaje de \"transcodificación completada\", actualiza la base de datos y pone el video a disposición de los usuarios finales.\n\n**Beneficios de la Arquitectura Reactiva:**\n\n* **Alta Responsividad:**  El sistema permanece receptivo incluso bajo alta carga gracias al desacoplamiento y la asincronía.\n* **Escalabilidad:**  Cada componente puede escalar independientemente para manejar picos de demanda.\n* **Resiliencia:**  El sistema es tolerante a fallos gracias al desacoplamiento y la durabilidad del bus de mensajes.\n* **Eficiencia:**  La transcodificación se realiza en segundo plano, permitiendo una entrega rápida del video original a los usuarios mientras se generan diferentes formatos.\n\n**Consideraciones Adicionales:**\n\n* **Monitorización:**  Es crucial monitorizar el rendimiento de cada componente y el bus de mensajes para detectar cuellos de botella y asegurar un funcionamiento óptimo.\n* **Seguridad:**  Se deben implementar medidas de seguridad para proteger los flujos de video y el acceso a los diferentes componentes.\n* **Almacenamiento:**  Se debe considerar una estrategia de almacenamiento eficiente y escalable para los chunks de video y las diferentes transcodificaciones.\n\n\nEsta solución proporciona una arquitectura robusta y escalable para la ingestión y distribución de video, utilizando principios reactivos y un patrón de comunicación asíncrona para manejar altas tasas de datos y mantener la responsividad bajo carga extrema.\n"}]}, "createdAt": "2025-05-21T20:41:09.561273", "expiration": "2025-05-29T01:41:09.527Z", "publicAccess": true}