{"id": "971ba611", "examenData": {"examen_id": "120139", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Practica", "fecha": "2025-05-08T14:22:11.600Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "En una arquitectura reactiva, ¿qué significa el principio de Responsiveness?\nA) El sistema responde rápidamente a fallos.\nB) El sistema se mantiene ágil bajo carga variable.\nC) El sistema responde de forma oportuna si es posible.\nD) El sistema se basa en la comunicación síncrona.\nE) El sistema limita la concurrencia para mejorar el rendimiento.", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 2, "texto": "¿Qué principio de la arquitectura reactiva se relaciona con la capacidad del sistema para recuperarse de fallos y mantenerse disponible?\nA) Elasticity\nB) Responsiveness\nC) Message-Driven\nD) Resilience\nE) Scalability", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 3, "texto": "¿Cuál es el mecanismo de comunicación fundamental en un sistema reactivo Message-Driven?\nA) Llamadas a procedimientos remotos síncronas.\nB) Intercambio de datos a través de bases de datos compartidas.\nC) Comunicación asíncrona basada en el paso de mensajes.\nD) Llamadas a API REST síncronas.\nE) Uso exclusivo de colas de mensajes persistentes.", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 4, "texto": "La Elasticidad en una arquitectura reactiva implica que el sistema puede:\nA) Recuperarse de fallos sin intervención manual.\nB) Mantener una respuesta oportuna bajo carga variable.\nC) Escalar hacia arriba o hacia abajo automáticamente.\nD) Utilizar programación funcional para el procesamiento de datos.\nE) Priorizar las tareas críticas sobre las menos críticas.", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 5, "texto": "¿Qué patrón de diseño se asocia frecuentemente con la implementación de sistemas reactivos para manejar flujos de datos asíncronos?\nA) Model-View-Controller (MVC)\nB) Observer Pattern\nC) Factory Pattern\nD) Singleton Pattern\nE) Decorator Pattern", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 6, "texto": "¿Qué patrón se utiliza comúnmente en sistemas reactivos para prevenir fallos en cascada mediante el aislamiento de servicios potencialmente fallidos?\n    A) Patrón Command\n    B) Patrón Observer\n    C) Circuit Breaker (Cortocircuito)\n    D) Patrón Singleton\n    E) Patrón Factory", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 7, "texto": "En un sistema reactivo orientado a mensajes, ¿cuál es una característica principal de la comunicación entre componentes?\n    A) Llamadas Directas a Métodos\n    B) Memoria Compartida\n    C) Asíncrona y No Bloqueante\n    D) Transacciones de Base de Datos\n    E) Llamadas a Procedimientos Remotos Bloqueantes", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 8, "texto": "La Elasticidad en los sistemas reactivos se refiere a la capacidad de:\n    A) Manejar fallos de manera elegante\n    B) Responder de manera oportuna\n    C) Mantener la capacidad de respuesta bajo carga variable\n    D) Comunicarse usando mensajes\n    E) Mantener un número fijo de instancias", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 9, "texto": "¿Cuál es un beneficio clave de adoptar una arquitectura reactiva?\n    A) Aumento de la complejidad\n    B) Mayor facilidad para depurar sistemas distribuidos\n    C) Mejora en la utilización de recursos y escalabilidad\n    D) Ejecución secuencial garantizada\n    E) Reducción de la necesidad de monitorización", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 1}, {"numero": 10, "texto": "¿Qué concepto es fundamental para lograr la Resiliencia en sistemas reactivos?\n    A) Manejo Centralizado de Errores\n    B) Aislamiento y Contención de Fallos\n    C) Diseño con Punto Único de Fallo\n    D) Procesos de Recuperación Manuales\n    E) Gestión de Estado Global", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}], "preguntas_libres": [{"numero": 11, "texto": "Describe cómo el principio de \"no bloqueo\" se implementa en un sistema reactivo y proporciona un ejemplo concreto de cómo esto beneficia el rendimiento general.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## El Principio de \"No Bloqueo\" en Sistemas Reactivos\n\nEl principio de \"no bloqueo\" es fundamental en el diseño de sistemas reactivos, asegurando que el sistema permanezca responsivo incluso bajo alta carga o en presencia de operaciones de larga duración.  Este principio dicta que una operación no debe bloquear el progreso de otras operaciones. En esencia, se busca evitar que un hilo o proceso quede esperando indefinidamente a que otro termine, liberando así recursos y permitiendo que el sistema continúe procesando otras solicitudes.\n\n**Implementación del Principio de \"No Bloqueo\":**\n\nLa implementación del principio de \"no bloqueo\" se logra principalmente mediante las siguientes técnicas:\n\n1. **Asincronía:**  Las operaciones de larga duración, como las interacciones con la red o el acceso a disco, se realizan de forma asíncrona. En lugar de esperar a que la operación complete, el sistema continúa procesando otras tareas. Cuando la operación asíncrona finaliza, se notifica al sistema mediante mecanismos como callbacks, promesas o futures.\n\n2. **Programación basada en eventos:** Los sistemas reactivos se basan en eventos para comunicar la finalización de operaciones o la ocurrencia de cambios.  En lugar de un hilo esperar a que otro termine, se registra un \"listener\" o manejador de eventos que se ejecutará cuando el evento correspondiente se produzca. Esto permite que el hilo principal continúe procesando otros eventos sin bloquearse.\n\n3. **Uso de hilos o procesos ligeros:**  Utilizar múltiples hilos o, preferiblemente en muchos casos, procesos ligeros (como corrutinas o fibras) permite que diferentes partes del sistema operen concurrentemente.  Mientras un hilo o proceso ligero está bloqueado esperando una operación I/O, otros pueden continuar procesando solicitudes.  Es crucial gestionar adecuadamente la concurrencia para evitar problemas como condiciones de carrera y bloqueos.\n\n4. **Estructuras de datos no bloqueantes:**  El uso de estructuras de datos diseñadas específicamente para entornos concurrentes y no bloqueantes, como colas concurrentes o variables atómicas,  permite que múltiples hilos o procesos ligeros accedan y modifiquen datos compartidos sin necesidad de bloqueos tradicionales, que pueden afectar el rendimiento.\n\n\n**Ejemplo Concreto:**\n\nImaginemos un servidor web que debe atender múltiples solicitudes de clientes. Si el servidor utiliza un modelo de bloqueo, cada solicitud bloquearía el hilo principal hasta que se complete la operación (por ejemplo, leer un archivo del disco o consultar una base de datos).  Esto significa que el servidor no podría atender a otros clientes hasta que la solicitud actual finalice, lo que resultaría en un rendimiento deficiente y una mala experiencia de usuario.\n\nEn cambio, si el servidor implementa el principio de \"no bloqueo\" utilizando asincronía y un modelo basado en eventos,  puede atender múltiples solicitudes concurrentemente.  Cuando llega una solicitud que requiere una operación de larga duración, el servidor la delega a un hilo o proceso ligero y registra un manejador de eventos.  El hilo principal queda libre para atender otras solicitudes. Cuando la operación asíncrona finaliza, el manejador de eventos se ejecuta y la respuesta se envía al cliente.\n\n**Beneficios del Principio de \"No Bloqueo\":**\n\n* **Mayor rendimiento y escalabilidad:** El sistema puede manejar un mayor número de solicitudes concurrentes sin degradación del rendimiento.\n* **Mejor responsividad:** El sistema permanece responsivo incluso bajo alta carga, ya que las operaciones de larga duración no bloquean el procesamiento de otras solicitudes.\n* **Mayor eficiencia en el uso de recursos:** Se evita el desperdicio de recursos del sistema, como tiempo de CPU, al no mantener hilos bloqueados esperando.\n* **Mejor experiencia de usuario:**  Los usuarios experimentan tiempos de respuesta más rápidos y una mayor fluidez en la interacción con el sistema.\n\n\nEn resumen, el principio de \"no bloqueo\" es esencial para construir sistemas reactivos robustos, escalables y responsivos. Su implementación mediante técnicas como la asincronía, la programación basada en eventos y el uso de estructuras de datos no bloqueantes permite maximizar el rendimiento y la eficiencia del sistema, proporcionando una mejor experiencia al usuario.\n"}, {"numero": 12, "texto": "¿Cómo se manejan los fallos en cascada en una arquitectura reactiva y qué mecanismos específicos se utilizan para aislar los fallos y prevenir la propagación de errores a otros componentes del sistema?", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Manejo de Fallos en Cascada en Arquitecturas Reactivas\n\nLas arquitecturas reactivas, basadas en el Manifiesto Reactivo, se diseñan para ser resilientes a fallos.  Sin embargo, la naturaleza distribuida de estos sistemas introduce el riesgo de fallos en cascada, donde un fallo en un componente puede propagarse rápidamente a otros, causando una interrupción generalizada.  Para mitigar este riesgo, se emplean diversos mecanismos de aislamiento y contención de fallos.\n\n**¿Qué son los fallos en cascada?**\n\nUn fallo en cascada ocurre cuando un fallo en un componente del sistema desencadena una serie de fallos en otros componentes interconectados.  Imagine un efecto dominó, donde la caída de una ficha provoca la caída de las demás.  En sistemas reactivos, esto puede ocurrir debido a:\n\n* **Dependencias:**  Si un servicio crítico falla, los servicios que dependen de él también pueden fallar.\n* **Sobrecarga:** Un componente sobrecargado puede fallar y, a su vez, sobrecargar otros componentes que intentan comunicarse con él, propagando el fallo.\n* **Propagación de errores:**  Un error no gestionado en un componente puede propagarse a otros componentes a través de llamadas a funciones o mensajes.\n\n**Mecanismos para Aislar Fallos y Prevenir la Propagación de Errores:**\n\nLas arquitecturas reactivas utilizan varios mecanismos para abordar los fallos en cascada:\n\n1. **Aislamiento de Fallos (Fault Isolation):**\n\n    * **Bulkheads:**  Similar a los compartimentos estancos de un barco, los bulkheads dividen la aplicación en grupos de componentes aislados.  Si un grupo falla, los otros permanecen operativos.  Esto limita el impacto de un fallo a un área específica.  Se pueden implementar bulkheads a nivel de hilos, pools de conexiones, y recursos.\n    * **Timeouts:**  Establecen un límite de tiempo para la respuesta de un servicio. Si el servicio no responde dentro del timeout, la solicitud se considera fallida.  Esto previene que un componente espere indefinidamente a un servicio que no responde, evitando bloqueos y la propagación de la sobrecarga.\n    * **Circuit Breakers:**  Actúan como interruptores automáticos.  Monitorean las llamadas a un servicio y, si detecta un número excesivo de fallos en un período de tiempo determinado, \"abren el circuito\", impidiendo futuras llamadas al servicio fallido durante un tiempo de \"enfriamiento\".  Esto da tiempo al servicio para recuperarse y evita que el sistema se sobrecargue con solicitudes fallidas.\n\n\n2. **Contención de Errores (Error Containment):**\n\n    * **Supervisión y registro:**  Un sistema de monitoreo robusto proporciona información sobre el estado de los componentes y alerta sobre posibles problemas.  El registro detallado ayuda a rastrear la causa raíz de los fallos.\n    * **Manejo de excepciones:**  Implementar un manejo de excepciones adecuado en cada componente es crucial para capturar y gestionar errores localmente, evitando que se propaguen a otros componentes.  El uso de estrategias como reintentos, fallback a valores predeterminados o la generación de eventos de error permite una respuesta controlada a las excepciones.\n    * **Propagación de backpressure:**  Permite que los componentes downstream comuniquen su capacidad de procesamiento a los componentes upstream.  Si un componente downstream está sobrecargado, puede señalar a los componentes upstream que reduzcan la velocidad de envío de solicitudes, evitando la sobrecarga y los fallos en cascada.\n\n\n3. **Replicación y Redundancia:**\n\n    * **Instancias Múltiples:**  Ejecutar múltiples instancias de un servicio proporciona redundancia.  Si una instancia falla, las otras pueden continuar procesando las solicitudes.  Load balancers distribuyen la carga entre las instancias disponibles.\n    * **Replicación de Datos:**  Replicar datos en múltiples nodos asegura la disponibilidad de la información incluso si un nodo falla.\n\n\n**Ejemplo:**\n\nImaginemos un sistema de comercio electrónico.  Si el servicio de pago falla, un bulkhead puede aislar el fallo, permitiendo que otras partes del sistema, como la navegación del catálogo o la gestión del carrito de compras, sigan funcionando.  Un circuit breaker puede evitar que el sistema intente repetidamente procesar pagos a través del servicio fallido, mientras que un sistema de monitoreo alerta a los administradores sobre el problema.\n\nEn resumen, el manejo de fallos en cascada en arquitecturas reactivas requiere una estrategia multifacética que combine aislamiento de fallos, contención de errores, replicación y redundancia.  Al implementar estos mecanismos, se puede construir un sistema resiliente capaz de tolerar fallos individuales sin sufrir interrupciones generalizadas.\n"}, {"numero": 13, "texto": "Analiza las ventajas y desventajas de utilizar un enfoque reactivo para el desarrollo de microservicios, considerando aspectos como la complejidad de la implementación, la gestión de la consistencia de datos y la observabilidad.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Análisis de las Ventajas y Desventajas de un Enfoque Reactivo en el Desarrollo de Microservicios\n\nUn enfoque reactivo en el desarrollo de microservicios se basa en los principios de la programación reactiva, que promueve sistemas responsivos, resilientes, elásticos y orientados a mensajes. Si bien ofrece ventajas significativas, también presenta desafíos que deben considerarse cuidadosamente.\n\n**Ventajas:**\n\n* **Mayor Responsividad y Elasticidad:** Los sistemas reactivos manejan la asincronía y la concurrencia de forma eficiente, lo que permite responder rápidamente a las solicitudes incluso bajo alta carga.  La no-bloqueo inherente a este enfoque facilita el escalado horizontal de los microservicios para adaptarse a las fluctuaciones en la demanda.\n* **Resiliencia Mejorada:** El manejo de fallos se simplifica mediante mecanismos como los circuit breakers y los timeouts, que aíslan los fallos y evitan la propagación de errores en cascada. La inmutabilidad de los datos y la gestión de eventos contribuyen a la recuperación rápida ante fallos.\n* **Acoplamiento Débil entre Microservicios:** La comunicación asíncrona basada en mensajes reduce el acoplamiento entre microservicios.  Esto facilita la evolución independiente de cada servicio, permitiendo actualizaciones y despliegues sin afectar a otros componentes del sistema.\n* **Mayor Eficiencia en el Uso de Recursos:** La no-bloqueo permite que los hilos de ejecución se utilicen de manera más eficiente, evitando el desperdicio de recursos mientras se espera la respuesta de otros servicios. Esto se traduce en un mejor rendimiento y menor consumo de recursos.\n* **Simplicidad en la Gestión de la Concurrencia:** Los frameworks reactivos proporcionan abstracciones para manejar la concurrencia, simplificando el desarrollo y reduciendo la probabilidad de errores relacionados con la sincronización.\n\n\n**Desventajas:**\n\n* **Complejidad de la Implementación:**  Adoptar un enfoque reactivo requiere un cambio de paradigma en la forma de pensar y diseñar sistemas. La gestión de la asincronía, los flujos de datos y la depuración pueden ser más complejos que en un enfoque tradicional.  La curva de aprendizaje para los desarrolladores puede ser pronunciada.\n* **Gestión de la Consistencia de Datos:**  En un sistema distribuido con comunicación asíncrona, mantener la consistencia de datos puede ser un desafío.  Se requieren estrategias específicas como sagas o CQRS para garantizar la integridad de los datos a través de múltiples microservicios.\n* **Observabilidad:**  Depurar y monitorizar sistemas reactivos puede ser más complejo debido a la naturaleza asíncrona de las interacciones. Se necesitan herramientas y técnicas específicas para rastrear el flujo de datos y diagnosticar problemas.  La gestión de logs y el tracing requieren una planificación cuidadosa.\n* **Madurez de las Tecnologías:** Si bien las tecnologías reactivas están ganando popularidad, algunas aún están en etapas relativamente tempranas de madurez.  Esto puede implicar una menor disponibilidad de documentación, soporte y bibliotecas en comparación con enfoques más tradicionales.\n* **Testing:**  Probar sistemas reactivos requiere enfoques diferentes a los utilizados en sistemas síncronos.  Se necesitan herramientas y frameworks específicos para simular eventos asíncronos y verificar el comportamiento del sistema bajo diferentes condiciones de carga.\n\n\n**Conclusión:**\n\nUn enfoque reactivo para el desarrollo de microservicios ofrece ventajas significativas en términos de responsividad, resiliencia y escalabilidad.  Sin embargo, introduce complejidad en la implementación, la gestión de la consistencia de datos y la observabilidad.  Es crucial evaluar cuidadosamente las ventajas y desventajas antes de adoptar este enfoque, considerando las necesidades específicas del proyecto y la experiencia del equipo de desarrollo.  Una planificación adecuada, la selección de las herramientas correctas y una sólida estrategia de testing son fundamentales para el éxito de un proyecto de microservicios reactivos.\n"}, {"numero": 14, "texto": "Diseña una estrategia para migrar un sistema monolítico existente a una arquitectura reactiva, incluyendo los pasos clave, las consideraciones de diseño y los posibles desafíos que se podrían encontrar durante el proceso.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Migración de un Sistema Monolítico a una Arquitectura Reactiva: Una Estrategia Detallada\n\nMigrar un sistema monolítico a una arquitectura reactiva es un proceso complejo que requiere una planificación cuidadosa y una ejecución metódica.  No se trata de una simple reescritura, sino de una transformación gradual que busca mejorar la resiliencia, la escalabilidad y la capacidad de respuesta del sistema.  A continuación, se presenta una estrategia detallada para abordar esta migración:\n\n**I. Fase de Evaluación y Planificación:**\n\n1. **Análisis del Monolito:**  Comprender la arquitectura actual del monolito es crucial.  Identificar los módulos, las dependencias, los flujos de datos y los puntos de congestión.  Utilizar herramientas de profiling y análisis de rendimiento para obtener una visión clara del comportamiento del sistema.\n\n2. **Definición de Objetivos:**  Establecer objetivos claros para la migración. ¿Se busca mejorar la escalabilidad, la resiliencia, la capacidad de respuesta o la mantenibilidad?  Definir métricas para medir el éxito de la migración.\n\n3. **Selección de un Patrón Reactivo:**  Existen diversos patrones reactivos como CQRS, Event Sourcing y Sagas.  Seleccionar el patrón más adecuado para las necesidades del sistema.\n\n4. **Diseño de la Arquitectura Objetivo:**  Definir la arquitectura reactiva objetivo, incluyendo los microservicios, las APIs, los mecanismos de comunicación (mensajería, streaming) y las bases de datos.  Considerar la segregación de responsabilidades y la autonomía de los microservicios.\n\n5. **Plan de Migración Incremental:**  Descomponer la migración en etapas incrementales.  Priorizar los módulos del monolito que se beneficiarán más de la arquitectura reactiva.  Definir un cronograma realista para cada etapa.\n\n**II. Fase de Implementación:**\n\n1. **Desarrollo de Microservicios Reactivos:**  Implementar los nuevos microservicios utilizando principios reactivos: responsividad, resiliencia, elasticidad y orientación a mensajes.  Utilizar frameworks y bibliotecas reactivas.\n\n2. **Integración con el Monolito:**  Implementar mecanismos de integración entre los nuevos microservicios y el monolito existente.  Utilizar patrones como el \"Strangler Fig Pattern\" para estrangular gradualmente la funcionalidad del monolito.\n\n3. **Pruebas Exhaustivas:**  Realizar pruebas unitarias, de integración y de sistema para asegurar la correcta funcionalidad y el rendimiento de los nuevos microservicios y la integración con el monolito.  Implementar pruebas de resiliencia para simular fallos y verificar la capacidad de recuperación del sistema.\n\n4. **Despliegue Incremental:**  Desplegar los nuevos microservicios de forma incremental, minimizando el impacto en los usuarios.  Utilizar técnicas de despliegue como Blue/Green Deployment o Canary Deployment.\n\n5. **Monitorización y Observabilidad:**  Implementar un sistema de monitorización y observabilidad para recopilar métricas y logs del sistema.  Utilizar estas herramientas para detectar problemas de rendimiento, errores y comportamientos anómalos.\n\n**III. Fase de Optimización y Mantenimiento:**\n\n1. **Afinamiento del Rendimiento:**  Optimizar el rendimiento de los microservicios y la comunicación entre ellos.  Identificar y eliminar cuellos de botella.\n\n2. **Refactorización Continua:**  Refactorizar el código de los microservicios para mejorar la mantenibilidad y la escalabilidad.\n\n3. **Actualización Tecnológica:**  Mantener las bibliotecas y frameworks reactivos actualizados para aprovechar las nuevas funcionalidades y mejoras de rendimiento.\n\n\n**Consideraciones de Diseño:**\n\n* **Comunicación Asíncrona:**  Favorecer la comunicación asíncrona mediante mensajería o streaming para desacoplar los microservicios y mejorar la resiliencia.\n* **Idempotencia:**  Diseñar los microservicios para que sean idempotentes, es decir, que puedan procesar el mismo mensaje varias veces sin producir efectos secundarios no deseados.\n* **Manejo de Errores:**  Implementar estrategias robustas de manejo de errores para asegurar la resiliencia del sistema.\n* **Transacciones Distribuidas:**  Utilizar patrones como Sagas para gestionar transacciones distribuidas en un entorno reactivo.\n\n\n**Posibles Desafíos:**\n\n* **Complejidad:**  La arquitectura reactiva introduce una mayor complejidad en el sistema, especialmente en la gestión de la comunicación asíncrona y el manejo de errores.\n* **Curva de Aprendizaje:**  Los desarrolladores necesitan adquirir nuevas habilidades y conocimientos para trabajar con frameworks y bibliotecas reactivas.\n* **Pruebas:**  Las pruebas en un entorno reactivo pueden ser más complejas debido a la naturaleza asíncrona de la comunicación.\n* **Monitorización:**  La monitorización de un sistema reactivo requiere herramientas y técnicas específicas para rastrear el flujo de mensajes y detectar problemas de rendimiento.\n\n\n**Conclusión:**\n\nMigrar un sistema monolítico a una arquitectura reactiva es un proceso desafiante pero gratificante.  Una planificación cuidadosa, una ejecución metódica y una atención constante a los detalles son cruciales para el éxito de la migración.  Al seguir una estrategia incremental y abordar los desafíos de forma proactiva, se puede lograr una transformación exitosa que mejore significativamente la resiliencia, la escalabilidad y la capacidad de respuesta del sistema.\n"}, {"numero": 15, "texto": "¿Cómo se implementa la resiliencia en un sistema reactivo y qué mecanismos específicos se utilizan para manejar fallos y asegurar la disponibilidad?", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Implementando la Resiliencia en Sistemas Reactivos\n\nLa resiliencia en un sistema reactivo se refiere a su capacidad de mantenerse responsivo y funcional ante fallos,  sobrecargas y otros eventos disruptivos.  No se trata de evitar los fallos, sino de aceptarlos como inevitables y diseñar el sistema para que pueda recuperarse rápidamente y continuar operando, aunque sea con funcionalidad degradada.  La implementación de la resiliencia en sistemas reactivos se basa en varios mecanismos clave:\n\n**1. Replicación y Redundancia:**\n\n* **Replicación de datos:**  Múltiples copias de los datos se mantienen en diferentes nodos o ubicaciones. Si un nodo falla, otro puede tomar el relevo sin pérdida de información.  Ejemplos incluyen bases de datos distribuidas como Cassandra o sistemas de almacenamiento como HDFS.\n* **Replicación de servicios:**  Instancias múltiples del mismo servicio se ejecutan concurrentemente. Un balanceador de carga distribuye las peticiones entre las instancias disponibles. Si una instancia falla, las demás continúan procesando las solicitudes.  Kubernetes y Docker Swarm son ejemplos de orquestadores que facilitan la replicación de servicios.\n\n**2. Aislamiento de Fallos:**\n\n* **Compartamentalización:** El sistema se divide en componentes aislados. Un fallo en un componente no debería propagarse a otros, limitando el impacto del fallo.  Microservicios y el patrón Bulkhead son ejemplos de esta estrategia.\n* **Supervisores:**  Procesos dedicados monitorizan la salud de otros componentes. Si un componente falla, el supervisor puede reiniciarlo, escalarlo o tomar otras acciones correctivas.  Erlang/OTP y Akka ofrecen mecanismos robustos de supervisión.\n* **Timeouts y Retries:** Se establecen límites de tiempo para las operaciones y se implementan mecanismos de reintento para manejar fallos transitorios, como problemas de red.  Librerías como Resilience4j y Hystrix ofrecen funcionalidades para gestionar timeouts y reintentos.\n\n**3. Degradación Graceful:**\n\n* **Disyuntores (Circuit Breakers):**  Impiden que un sistema sobrecargado continúe enviando solicitudes a un servicio que falla repetidamente.  El disyuntor \"se abre\" temporalmente, evitando una cascada de fallos.  Resilience4j y Hystrix implementan este patrón.\n* **Fallback:**  Proporciona una respuesta alternativa o un servicio degradado cuando el servicio principal no está disponible.  Por ejemplo, mostrar contenido en caché en lugar de contenido dinámico si la base de datos no responde.\n* **Priorización y Throttling:**  Prioriza las solicitudes críticas y limita la tasa de solicitudes para evitar la sobrecarga del sistema.  Esto permite que el sistema continúe funcionando, aunque con un rendimiento reducido, durante periodos de alta demanda.\n\n**4. Monitoreo y Observabilidad:**\n\n* **Logging:** Registrar eventos importantes, incluyendo errores y excepciones, para facilitar la identificación y el diagnóstico de problemas.\n* **Métricas:**  Recolectar datos sobre el rendimiento del sistema, como la latencia, el número de errores y la utilización de recursos, para identificar posibles problemas antes de que se conviertan en fallos.  Prometheus y Grafana son herramientas populares para el monitoreo y la visualización de métricas.\n* **Tracing:**  Rastrear el flujo de una solicitud a través de diferentes componentes del sistema para identificar cuellos de botella y puntos de fallo.  Jaeger y Zipkin son ejemplos de herramientas de tracing.\n\n\n**En resumen,** la resiliencia en sistemas reactivos se logra mediante una combinación de estrategias que buscan aislar fallos, replicar componentes críticos, degradar el servicio de forma controlada y monitorizar constantemente el estado del sistema.  La elección de los mecanismos específicos dependerá de los requisitos de disponibilidad, el presupuesto y la complejidad del sistema.  Implementar estas estrategias permite a los sistemas reactivos manejar fallos de forma efectiva, manteniendo la disponibilidad y proporcionando una experiencia de usuario robusta incluso en entornos desafiantes.\n"}], "casos_uso": [{"numero": 16, "descripcion": "Diseñar e implementar un componente de ingesta que pueda recibir un volumen masivo y variable de eventos de telemetría de forma concurrente, sin bloquear el origen de los datos y aplicando algún mecanismo de control de flujo (backpressure) si los sistemas de procesamiento están saturados.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para la Ingesta de Eventos de Telemetría a Gran Escala\n\nEste problema requiere un diseño robusto y escalable para manejar un flujo masivo y variable de eventos de telemetría. La solución propuesta se basa en una arquitectura distribuida que utiliza un broker de mensajes, un mecanismo de backpressure y workers concurrentes para procesar los datos.\n\n**Arquitectura:**\n\n1. **Fuente de Datos (Telemetry Producers):**  Los diversos componentes o sistemas que generan los eventos de telemetría.  Estos productores deben ser no bloqueantes, es decir, enviar los eventos y continuar su operación sin esperar confirmación del procesamiento.\n\n2. **Broker de Mensajes (e.g., Kafka, RabbitMQ, Redis Streams):** Actúa como un buffer intermedio entre los productores y los consumidores. Permite el desacoplamiento temporal y espacial, manejando la concurrencia y la persistencia de los mensajes.  Elegir el broker adecuado depende de los requisitos específicos del sistema (volumen, latencia, persistencia, etc.).\n\n3. **Workers (Consumidores):** Procesan los eventos de telemetría recibidos del broker.  Se implementan como procesos o hilos concurrentes para maximizar el throughput.\n\n4. **Sistema de Procesamiento (Backend):**  El destino final de los datos procesados (e.g., base de datos, sistema de almacenamiento, sistema de análisis).\n\n**Mecanismo de Backpressure:**\n\nPara evitar la sobrecarga de los workers y el sistema de procesamiento, se implementa un mecanismo de backpressure. Este mecanismo limita la tasa de ingesta de datos cuando los sistemas downstream están saturados.  Existen varias estrategias:\n\n* **Basado en el Broker:**  Algunos brokers (como Kafka) ofrecen mecanismos de control de flujo incorporados. Se puede configurar para pausar el consumo de mensajes cuando las particiones se llenan.\n* **Basado en la Cola de Workers:**  Se limita el tamaño de la cola de mensajes que cada worker puede procesar. Cuando la cola está llena, el worker deja de consumir del broker temporalmente.\n* **Basado en Métricas:**  Se monitorizan métricas clave del sistema (e.g., uso de CPU, memoria, latencia de procesamiento) y se ajusta la velocidad de consumo en función de estas métricas.  Se puede implementar utilizando un algoritmo de control de congestión.\n\n\n**Implementación (Ejemplo conceptual con Python y Kafka):**\n\n```python\n# Productor (Ejemplo simplificado)\nfrom kafka import KafkaProducer\n\nproducer = KafkaProducer(bootstrap_servers='kafka:9092')\nfor event in generate_telemetry_events():\n    future = producer.send('telemetry-topic', event.encode('utf-8'))\n    # Asíncrono, no bloquea\n\n# Consumidor (Ejemplo simplificado)\nfrom kafka import KafkaConsumer\n\nconsumer = KafkaConsumer('telemetry-topic',\n                         bootstrap_servers='kafka:9092',\n                         group_id='telemetry-group',\n                         auto_offset_reset='earliest')\n\nfor message in consumer:\n    process_event(message.value.decode('utf-8'))\n    # Implementar lógica de backpressure aquí, por ejemplo,\n    # monitoreando el tamaño de una cola interna o métricas del sistema.\n    if queue.full():\n        time.sleep(0.1) # Pausa el consumo temporalmente\n\ndef process_event(event):\n    # Lógica para procesar el evento y enviarlo al backend.\n    # ...\n```\n\n**Consideraciones Adicionales:**\n\n* **Escalabilidad Horizontal:**  La arquitectura debe ser fácilmente escalable agregando más workers y particiones al broker de mensajes.\n* **Tolerancia a Fallos:** Implementar mecanismos de redundancia y recuperación ante fallos tanto en los productores, el broker como en los consumidores.\n* **Monitoreo:**  Monitorear constantemente el rendimiento del sistema (throughput, latencia, errores) para identificar cuellos de botella y optimizar el rendimiento.\n* **Serialización:**  Elegir un formato de serialización eficiente (e.g., Avro, Protobuf) para los eventos de telemetría.\n* **Seguridad:**  Implementar medidas de seguridad para proteger los datos en tránsito y en reposo.\n\n\n**Conclusión:**\n\nEsta solución proporciona una arquitectura robusta y escalable para la ingesta de un volumen masivo y variable de eventos de telemetría. El uso de un broker de mensajes, workers concurrentes y un mecanismo de backpressure garantiza un procesamiento eficiente y confiable de los datos, incluso bajo picos de carga. La elección de las tecnologías específicas y la implementación del mecanismo de backpressure dependerán de los requisitos y restricciones del sistema en particular.  Es crucial monitorizar y ajustar el sistema continuamente para asegurar un rendimiento óptimo.\n"}, {"numero": 127, "descripcion": "Crear un módulo de procesamiento de datos que, al recibir la telemetría, filtre y transforme los eventos relevantes (ej. errores críticos, caídas de calidad) y los envíe a un servicio de alertas de forma asíncrona y garantizando la entrega, incluso si el servicio de alertas no está disponible temporalmente.\nSugerencias de herramientas o enfoques: Akka Streams, Project Reactor, Kafka, RabbitMQ, Netty, Vert.x.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para el procesamiento de telemetría y envío de alertas\n\nEste diseño utiliza Kafka como broker de mensajes para garantizar la entrega de alertas incluso con la indisponibilidad temporal del servicio de alertas.  Akka Streams se emplea para el procesamiento asíncrono y la gestión de la concurrencia.\n\n**Arquitectura:**\n\n1. **Entrada de Telemetría:** La telemetría se ingesta a través de un endpoint, que puede ser una API REST, un socket, etc.\n\n2. **Akka Streams Pipeline:** Un pipeline de Akka Streams procesa la telemetría en tiempo real.  Este pipeline se divide en las siguientes etapas:\n\n    * **`Source`:** Define la fuente de datos de telemetría.\n    * **`Flow (Filtro)`:** Implementa la lógica de filtrado para identificar eventos relevantes (errores críticos, caídas de calidad).  Este filtro utiliza criterios predefinidos o reglas configurables.\n    * **`Flow (Transformación)`:** Transforma los eventos filtrados en un formato adecuado para el servicio de alertas (ej. JSON con campos específicos).\n    * **`Sink (Kafka Producer)`:** Envía los eventos transformados a un topic de Kafka.\n\n3. **Kafka:** Actúa como un buffer persistente y distribuido para las alertas.  Garantiza la entrega incluso si el servicio de alertas está caído.\n\n4. **Servicio de Alertas (Consumidor Kafka):** Un consumidor Kafka se suscribe al topic y procesa las alertas, enviándolas al sistema de notificaciones correspondiente (email, SMS, etc.).\n\n**Implementación (Conceptual con Akka Streams y Kafka):**\n\n```scala\nimport akka.kafka.ProducerSettings\nimport akka.kafka.scaladsl.Producer\nimport akka.stream.scaladsl.{Flow, Sink, Source}\nimport org.apache.kafka.clients.producer.ProducerRecord\nimport org.apache.kafka.common.serialization.StringSerializer\nimport spray.json._\n\n// ... (Importaciones necesarias para Kafka y Akka Streams) ...\n\n// Suponiendo un formato JSON para la telemetría\ncase class Telemetry(eventType: String, severity: Int, message: String)\nobject TelemetryProtocol extends DefaultJsonProtocol {\n  implicit val telemetryFormat = jsonFormat3(Telemetry)\n}\nimport TelemetryProtocol._\n\n// Configuración de Kafka Producer\nval producerSettings = ProducerSettings(system, new StringSerializer, new StringSerializer)\n  .withBootstrapServers(\"localhost:9092\") // Ajustar según la configuración de Kafka\n\n// Fuente de telemetría (Ejemplo: desde un archivo)\nval telemetrySource = Source.fromFile(new File(\"telemetry.json\")).map(_.parseJson.convertTo[Telemetry])\n\n// Lógica de filtrado (Ejemplo: eventos con severidad mayor o igual a 5)\nval filterFlow = Flow[Telemetry].filter(_.severity >= 5)\n\n// Lógica de transformación (Ejemplo: formatear a JSON)\nval transformFlow = Flow[Telemetry].map(_.toJson.compactPrint)\n\n// Sink para enviar a Kafka\nval kafkaSink = Producer.plainSink(producerSettings, producerSettings.createKafkaProducer())\n  .contramap[String](message => new ProducerRecord[String, String](\"alerts-topic\", message))\n\n// Conectar el pipeline\nval pipeline = telemetrySource\n  .via(filterFlow)\n  .via(transformFlow)\n  .to(kafkaSink)\n\n// Ejecutar el pipeline\npipeline.run()\n\n// Servicio de alertas (Consumidor Kafka - Implementación separada)\n// ... (Lógica para consumir mensajes del topic \"alerts-topic\") ...\n```\n\n**Ventajas de este enfoque:**\n\n* **Asincronía:** El procesamiento de telemetría y el envío de alertas se realizan de forma asíncrona, evitando bloqueos y maximizando el rendimiento.\n* **Garantía de entrega:** Kafka asegura que las alertas se entreguen incluso si el servicio de alertas no está disponible temporalmente.\n* **Escalabilidad:**  Akka Streams y Kafka son altamente escalables, permitiendo manejar grandes volúmenes de telemetría.\n* **Resiliencia:** Akka Streams proporciona mecanismos de manejo de errores y recuperación, asegurando la estabilidad del sistema.\n\n**Consideraciones adicionales:**\n\n* **Manejo de errores:** Implementar estrategias de reintento y manejo de errores en el consumidor Kafka.\n* **Monitoreo:**  Monitorear el pipeline de Akka Streams y el estado de Kafka para detectar problemas y optimizar el rendimiento.\n* **Seguridad:**  Configurar la autenticación y autorización en Kafka para proteger la información sensible.\n\nEste diseño proporciona una solución robusta y escalable para el procesamiento de telemetría y el envío de alertas, abordando los requisitos de asincronía, garantía de entrega y manejo de la indisponibilidad del servicio de alertas.  Se puede adaptar y extender para cubrir necesidades específicas de cada caso.\n"}]}, "createdAt": "2025-05-08T09:22:11.678184", "expiration": "2025-05-15T14:22:11.600Z", "publicAccess": true}