{"id": "98e7e3b8", "examenData": {"examen_id": "258390", "nombre_examen": "Programación UML", "tipo_examen": "Evaluación", "fecha": "2025-05-02T16:19:16.769Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [], "preguntas_libres": [], "casos_uso": [{"numero": 1, "descripcion": "**Escenario:** Una plataforma de comercio electrónico que gestiona un gran volumen de transacciones concurrentes. Debe garantizar la consistencia de datos y la disponibilidad del servicio durante picos de tráfico.\n    **Requisitos:**  Desarrollar un sistema de procesamiento de pedidos que pueda manejar un alto volumen de solicitudes, gestionar el inventario en tiempo real y proporcionar actualizaciones de estado del pedido a los usuarios.\n    **Sugerencias:** Akka, CQRS, Event Sourcing.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 2, "descripcion": "**Escenario:** Una aplicación de chat en tiempo real que permite la comunicación instantánea entre múltiples usuarios. Debe ser escalable para manejar un número creciente de usuarios y mensajes.\n    **Requisitos:**  Crear una aplicación que permita a los usuarios enviar y recibir mensajes en tiempo real, gestionar la presencia de usuarios y notificar nuevos mensajes.\n    **Sugerencias:** WebSockets, Vert.x, Node.js con Socket.IO.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 3, "descripcion": "**Escenario:** Un sistema de control de tráfico aéreo que debe procesar datos de sensores en tiempo real y reaccionar a eventos críticos instantáneamente.  Debe ser altamente resiliente a fallos.\n    **Requisitos:** Desarrollar un sistema que reciba datos de sensores, detecte posibles colisiones y genere alertas en tiempo real para los controladores de tráfico aéreo.\n    **Sugerencias:** Akka Cluster, Erlang.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 4, "descripcion": "**Escenario:** Una plataforma de juegos multijugador en línea que requiere baja latencia y actualizaciones en tiempo real para todos los jugadores. Debe manejar la sincronización de datos entre múltiples jugadores.\n    **Requisitos:** Implementar un sistema que gestione las interacciones de los jugadores, actualice el estado del juego en tiempo real y proporcione una experiencia de juego fluida.\n    **Sugerencias:**  WebSockets, Netty, Actor Model.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-05-02T11:19:16.802733", "expiration": "2025-05-09T16:19:16.769Z", "publicAccess": true}