{"id": "a8798892", "examenData": {"id": "188086", "fecha": "2025-04-07", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál de los siguientes es un principio fundamental de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Acoplamiento fuerte entre componentes", "valor": "A"}, {"texto": "B) Tolerancia al fallo", "valor": "B"}, {"texto": "C) Uso exclusivo de bases de datos relacionales", "valor": "C"}, {"texto": "D) Sincronización obligatoria de procesos", "valor": "D"}, {"texto": "E) Jerarquía rígida de componentes", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1 Compara y contrasta las arquitecturas en capas y la arquitectura hexagonal, detallando sus ventajas, desventajas y casos de uso ideales para cada una. Incluye ejemplos concretos que ilustren las diferencias en su implementación y cómo cada enfoque maneja la separación de responsabilidades.", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso 1-1**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos de ventas flash sin degradar el rendimiento. Debes diseñar un sistema reactivo que procese órdenes de compra asincrónicamente y notifique a los usuarios en tiempo real sobre el estado de sus pedidos.  \n\n**Preguntas de casos de uso:**  \n1. ¿Cómo garantizarías la escalabilidad del sistema para manejar miles de solicitudes concurrentes durante un evento de venta?  \n2. ¿Qué estrategias implementarías para asegurar la consistencia de datos entre los microservicios de órdenes y inventario?  \n\n**Requisitos específicos:**  \n- Implementar un patrón de cola (ej. Kafka, RabbitMQ) para desacoplar el procesamiento de órdenes.  \n- Usar una base de datos distribuida (ej. Cassandra) para el inventario.  \n- Incluir un servicio de notificaciones en tiempo real (ej. WebSockets).  \n\n**Sugerencias de herramientas/enfoques:**  \n- Kafka para mensajería asincrónica.  \n- Spring WebFlux o Akka para manejo reactivo de peticiones.  \n- Cassandra para almacenamiento escalable.  \n- WebSockets o Server-Sent Events (SSE) para notificaciones.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-07T17:37:17.998608", "expiration": "2025-04-14T22:37:17.987Z", "publicAccess": true}