{"id": "c4276fb6", "examenData": {"examen_id": "691763", "nombre_examen": "Programación UML", "tipo_examen": "Evaluación", "fecha": "2025-04-30T19:57:28.225Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño es común en sistemas reactivos para manejar flujos de datos asíncronos?  \nA) Singleton  \nB) Observer  \nC) Decorator  \nD) Factory  \nE) Proxy", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 2, "texto": "¿Qué tecnología se utiliza comúnmente para implementar sistemas reactivos en Java?  \nA) Spring MVC  \nB) Hibernate  \nC) Reactor  \nD) JDBC  \nE) JSP", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 3, "texto": "¿Cuál de las siguientes características NO es parte del Manifiesto Reactivo?  \nA) Responsivo  \nB) Escalable  \nC) Monolítico  \nD) Resiliente  \nE) Orientado a mensajes", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 4, "texto": "¿Qué tipo de comunicación se promueve en las arquitecturas reactivas?  \nA) Síncrona  \nB) Bloqueante  \nC) Asíncrona  \nD) Directa  \nE) Basada en sesiones", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}, {"numero": 5, "texto": "¿Qué componente es esencial en un sistema reactivo para manejar la concurrencia?  \nA) Hilos tradicionales  \nB) Event loops  \nC) Variables globales  \nD) Locks explícitos  \nE) Transacciones largas", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}], "preguntas_libres": [{"numero": 6, "texto": "**Intermedio:** Compara y contrasta el uso de *Event Sourcing* con *CQRS* en una arquitectura reactiva, detallando los beneficios y desafíos de cada enfoque en un escenario de alta concurrencia.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Comparación y Contraste de Event Sourcing y CQRS en Arquitecturas Reactivas bajo Alta Concurrencia\n\nEvent Sourcing (ES) y Command Query Responsibility Segregation (CQRS) son patrones arquitectónicos que a menudo se usan juntos, especialmente en sistemas reactivos que manejan alta concurrencia. Sin embargo, son conceptos distintos con beneficios y desafíos específicos.  Aunque complementarios, no son mutuamente dependientes.\n\n**Event Sourcing (ES)**\n\n* **Concepto:** ES persiste el estado de una entidad como una secuencia inmutable de eventos, en lugar de guardar solo el último estado. Cada evento representa un cambio en el estado de la entidad. Para reconstruir el estado actual, se reproducen todos los eventos desde el inicio.\n\n* **Beneficios en alta concurrencia:**\n    * **Optimiza la escritura:** Las escrituras se convierten en simples apéndices al log de eventos, eliminando bloqueos y mejorando el rendimiento, especialmente bajo alta concurrencia.  No hay conflictos de escritura tradicionales.\n    * **Auditoria e historial completo:**  Proporciona un registro auditable de todos los cambios, facilitando la depuración, el análisis de datos y la reversión a estados anteriores.\n    * **Escalabilidad horizontal:** El log de eventos puede ser fácilmente particionado y distribuido para una mejor escalabilidad.\n    * **Arquitectura orientada a eventos:** Facilita la integración con otros sistemas a través de la publicación de eventos.\n\n* **Desafíos en alta concurrencia:**\n    * **Complejidad de lectura:** Reconstruir el estado actual puede ser costoso, especialmente para entidades con un largo historial de eventos.  Se requieren estrategias de optimización como snapshots.\n    * **Versionamiento de eventos:**  La evolución del esquema de eventos puede ser compleja, requiriendo mecanismos de migración para mantener la compatibilidad.\n    * **Dependencia del orden de eventos:**  El orden de los eventos es crucial para la consistencia del estado.  Gestionar la concurrencia en la escritura de eventos puede ser complejo.\n\n\n**CQRS (Command Query Responsibility Segregation)**\n\n* **Concepto:** CQRS separa las operaciones de lectura (Queries) de las operaciones de escritura (Commands). Esto permite optimizar cada ruta de acceso de forma independiente.\n\n* **Beneficios en alta concurrencia:**\n    * **Escalabilidad independiente:**  Permite escalar las lecturas y escrituras de forma independiente, adaptándose a diferentes patrones de carga.  Se pueden usar diferentes modelos de datos para lectura y escritura.\n    * **Rendimiento optimizado:**  Se pueden utilizar bases de datos especializadas y cachés para optimizar tanto las lecturas como las escrituras.\n    * **Simplicidad:**  Simplifica el diseño y la implementación de cada operación, al separar las responsabilidades.\n\n* **Desafíos en alta concurrencia:**\n    * **Consistencia eventual:**  La separación de modelos de datos puede llevar a una consistencia eventual entre lecturas y escrituras. Se necesitan estrategias para manejar esta eventual consistencia.\n    * **Complejidad añadida:**  CQRS introduce una capa adicional de complejidad en la arquitectura.\n\n\n**ES y CQRS Juntos**\n\nES y CQRS se complementan bien.  ES proporciona un flujo natural de eventos que CQRS puede utilizar para actualizar los modelos de lectura.  Los comandos pueden generar eventos que se persisten en el log de eventos (ES) y luego se utilizan para actualizar las vistas de lectura (CQRS).\n\n**Ejemplo en un escenario de alta concurrencia:**\n\nImagine una plataforma de comercio electrónico con un alto volumen de pedidos.  Usando ES, cada pedido se representaría como una secuencia de eventos (e.g., `PedidoCreado`, `ProductoAgregado`, `DirecciónEnviada`, `PagoRealizado`).  CQRS permitiría escalar las consultas de estado del pedido independientemente del procesamiento de nuevos pedidos.  Las vistas de lectura podrían ser optimizadas para consultas específicas, como \"pedidos por cliente\" o \"pedidos por fecha\".\n\n**Conclusión:**\n\nTanto ES como CQRS ofrecen beneficios significativos en escenarios de alta concurrencia, particularmente en arquitecturas reactivas. Sin embargo, también presentan desafíos que deben ser considerados cuidadosamente.  La decisión de usar ES, CQRS, o ambos, depende de los requisitos específicos del sistema y la complejidad que se esté dispuesto a asumir.  Usados correctamente, pueden mejorar significativamente la escalabilidad, el rendimiento y la mantenibilidad de una aplicación.\n"}, {"numero": 7, "texto": "**Avanzado:** Analiza cómo el *Backpressure* se maneja en sistemas reactivos y propón una estrategia para implementarlo en un flujo de datos en tiempo real con picos de carga impredecibles.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Respuesta Modelo: Manejo de Backpressure en Sistemas Reactivos\n\nEl *backpressure* es un mecanismo crucial en los sistemas reactivos que permite a un consumidor controlar el flujo de datos proveniente de un productor cuando el consumidor no puede procesar los datos a la misma velocidad que los recibe.  Sin un manejo adecuado, el *backpressure* puede llevar a la sobrecarga del sistema, pérdida de datos y fallos.  En sistemas con picos de carga impredecibles, un manejo robusto del *backpressure* es aún más crítico.\n\n**Mecanismos de Backpressure en Sistemas Reactivos:**\n\nLos sistemas reactivos, basados en el Manifiesto Reactivo, suelen manejar el *backpressure* a través de diferentes estrategias:\n\n1. **Push-based con control de flujo:**  En este modelo, el productor \"empuja\" datos al consumidor.  El control de flujo se implementa para regular la velocidad de envío. Algunos ejemplos incluyen:\n\n    * **Buffering:** El consumidor utiliza un buffer para almacenar temporalmente los datos recibidos.  Sin embargo, con picos de carga, el buffer puede desbordarse.\n    * **Throttling:** El consumidor solicita al productor que reduzca la velocidad de envío.  Esto requiere comunicación bidireccional entre productor y consumidor.\n    * **Windowing:** Se procesan los datos en ventanas de tiempo o tamaño, permitiendo al consumidor gestionar la carga en bloques.\n\n2. **Pull-based:**  El consumidor \"tira\" de los datos del productor a su propio ritmo. Este modelo es inherentemente resistente al *backpressure* ya que el productor solo envía datos cuando el consumidor los solicita.  Ejemplos incluyen:\n\n    * **Iteradores:** El consumidor solicita el siguiente elemento al productor cuando está listo.\n    * **Suscripciones a demanda:** El consumidor se suscribe a un flujo de datos y solicita explícitamente los datos cuando los necesita.\n\n\n**Estrategia para Picos de Carga Impredecibles:**\n\nPara un flujo de datos en tiempo real con picos de carga impredecibles, una estrategia efectiva combina elementos de *push* y *pull* con mecanismos de control de flujo dinámico:\n\n1. **Reactive Streams:**  Utilizar una implementación de Reactive Streams (como RxJava, Project Reactor, o Akka Streams) proporciona una base sólida para el manejo de *backpressure*.  Estas bibliotecas ofrecen operadores específicos para control de flujo.\n\n2. **Buffering adaptativo:**  Implementar un buffer con tamaño dinámico que se ajuste a la carga actual.  Monitorizar el nivel de llenado del buffer y ajustar su capacidad según sea necesario.  Esto ayuda a absorber picos de carga momentáneos.\n\n3. **Throttling dinámico:**  Utilizar un mecanismo de *throttling* que ajuste la velocidad de producción en función de la capacidad del consumidor.  Esto requiere una comunicación bidireccional eficiente entre productor y consumidor.\n\n4. **Degradación elegante:**  En casos de sobrecarga extrema, implementar mecanismos de degradación elegante, como descartar datos menos importantes o reducir la calidad del servicio.  Priorizar la estabilidad del sistema sobre el procesamiento completo de datos durante picos de carga.\n\n5. **Monitorización y alertas:**  Implementar un sistema de monitorización que rastree métricas clave como el nivel de llenado del buffer, la tasa de producción y la tasa de consumo.  Configurar alertas para notificar a los administradores del sistema sobre posibles problemas de *backpressure*.\n\n\n**Ejemplo conceptual (pseudo-código):**\n\n```java\n// Productor (ej. sensor de datos)\nFlux<Data> dataStream = Flux.generate(...); // Flujo de datos\n\n// Consumidor (ej. procesador de datos)\ndataStream\n  .onBackpressureBuffer(bufferSize, data -> log.warn(\"Buffer lleno, descartando dato: \" + data), BufferOverflowStrategy.DROP_OLDEST)\n  .onBackpressureLatest() // Solo procesar el dato más reciente\n  .limitRate(rateLimiter.getRate()) // Control de flujo dinámico\n  .subscribe(data -> processData(data));\n```\n\n\n**Conclusión:**\n\nEl manejo efectivo del *backpressure* es fundamental para la estabilidad y el rendimiento de los sistemas reactivos, especialmente en escenarios con picos de carga impredecibles.  Combinar estrategias de *push* y *pull* con control de flujo dinámico, buffering adaptativo y degradación elegante permite construir sistemas robustos y resilientes.  La monitorización continua y las alertas son esenciales para detectar y mitigar problemas de *backpressure* antes de que afecten la operación del sistema.\n"}, {"numero": 8, "texto": "**Intermedio:** Explica cómo las arquitecturas reactivas abordan el problema de la latencia en sistemas distribuidos, mencionando patrones como *Circuit Breaker* o *Bulkheading* con ejemplos concretos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Respuesta Modelo: Arquitecturas Reactivas y la Latencia en Sistemas Distribuidos\n\nLas arquitecturas reactivas buscan construir sistemas distribuidos resilientes y responsivos, minimizando el impacto de la latencia inherente a estos entornos.  Lo logran mediante la aplicación de principios como la **responsividad**, la **elasticidad**, la **resiliencia** y la **orientación a mensajes**.  Estos principios se materializan en patrones concretos que abordan directamente el problema de la latencia.\n\nLa latencia, en el contexto de sistemas distribuidos, se refiere al tiempo que tarda una solicitud en ser procesada y la respuesta en ser recibida.  En sistemas complejos con múltiples servicios interconectados, la latencia puede acumularse y afectar negativamente el rendimiento y la experiencia del usuario.  Las arquitecturas reactivas combaten esto mediante:\n\n**1. Asincronismo y No-Bloqueo:**  Favorecen la comunicación asíncrona y no bloqueante entre componentes.  En lugar de esperar una respuesta inmediata, un componente envía un mensaje y continúa con su trabajo.  Esto evita que un componente lento bloquee a otros, minimizando el impacto de la latencia de un servicio particular en el sistema completo.\n\n**2. Patrones de Resiliencia:** Implementan patrones específicos para aislar y gestionar fallos, evitando que la latencia derivada de un fallo se propague por todo el sistema.  Dos ejemplos clave son:\n\n* **Circuit Breaker:**  Actúa como un interruptor automático para las llamadas a servicios externos.  Si un servicio falla repetidamente (ej., alta latencia o tiempos de espera agotados), el Circuit Breaker se \"abre\", impidiendo futuras llamadas durante un periodo de tiempo.  Esto evita que el sistema pierda recursos intentando comunicarse con un servicio no disponible, reduciendo la latencia global y protegiendo al sistema de la cascada de fallos.\n\n    **Ejemplo:** Imaginemos un servicio de recomendaciones de productos que depende de un servicio externo de inventario. Si el servicio de inventario experimenta una alta latencia o se cae, el Circuit Breaker del servicio de recomendaciones se abrirá.  En lugar de esperar indefinidamente la respuesta del servicio de inventario, el servicio de recomendaciones podría mostrar un mensaje genérico (\"Recomendaciones no disponibles en este momento\") o utilizar una caché local, ofreciendo una respuesta degradada pero rápida al usuario.\n\n* **Bulkheading:**  Aísla diferentes partes del sistema en compartimentos estancos.  Si un componente falla, el fallo se limita a su compartimento, evitando que afecte a otros componentes.  Esto limita el impacto de la latencia causada por un fallo y mantiene la funcionalidad del resto del sistema.\n\n    **Ejemplo:** Una aplicación de comercio electrónico podría utilizar Bulkheading para separar los servicios de carrito de compras, procesamiento de pagos y gestión de inventario.  Si el servicio de procesamiento de pagos experimenta una alta latencia, los usuarios aún podrán agregar artículos al carrito y navegar por el catálogo, ya que estos servicios operan en compartimentos separados.\n\n**3. Backpressure:**  Mecanismo para controlar el flujo de datos entre componentes.  Si un componente se ve sobrecargado y no puede procesar mensajes a la velocidad a la que los recibe, puede comunicar esta situación al emisor para que reduzca la velocidad de envío.  Esto evita la saturación del sistema y la consiguiente latencia.\n\n**4. Replicación y Balanceo de Carga:**  Replicar servicios y distribuir la carga entre múltiples instancias reduce la latencia al evitar la congestión en un único punto.  Además, permite al sistema seguir funcionando incluso si una instancia falla.\n\n\nEn resumen, las arquitecturas reactivas abordan la latencia en sistemas distribuidos mediante la combinación de asincronismo, patrones de resiliencia como Circuit Breaker y Bulkheading, mecanismos de backpressure, y estrategias de replicación y balanceo de carga.  Estos enfoques permiten construir sistemas que son responsivos, elásticos y resilientes a fallos y fluctuaciones en la latencia, ofreciendo una mejor experiencia al usuario.\n"}, {"numero": 9, "texto": "**Avanzado:** Diseña un esquema de comunicación entre microservicios reactivos utilizando mensajería asíncrona, justificando la elección de tecnologías como Kafka o RabbitMQ y cómo garantizas la consistencia eventual.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Diseño de un Esquema de Comunicación Asíncrona entre Microservicios Reactivos\n\nUn sistema de microservicios reactivo se beneficia enormemente de la comunicación asíncrona basada en mensajes, permitiendo desacoplamiento, escalabilidad y resiliencia.  Este esquema utiliza un broker de mensajes como eje central para la comunicación, facilitando la interacción no bloqueante entre los servicios.\n\n**Arquitectura Propuesta:**\n\nEl esquema se basa en los siguientes componentes:\n\n1. **Microservicios Reactivos:** Implementados con frameworks como Spring WebFlux o Vert.x, estos servicios consumen y producen mensajes de forma asíncrona.  Su diseño reactivo interno les permite manejar la concurrencia de manera eficiente y responder a la carga fluctuante.\n\n2. **Broker de Mensajes (Kafka/RabbitMQ):** Actúa como intermediario, almacenando y distribuyendo mensajes entre los microservicios. La elección entre Kafka y RabbitMQ depende de las necesidades específicas:\n\n    * **Kafka:** Ideal para alto throughput, procesamiento de streams de datos y tolerancia a fallos a gran escala. Su arquitectura distribuida y persistencia de mensajes lo hacen robusto para escenarios de Big Data.\n\n    * **RabbitMQ:**  Adecuado para sistemas con menor volumen de datos, donde se requiere un control más granular sobre el routing y la entrega de mensajes. Ofrece diferentes patrones de intercambio (topic, direct, fanout) que permiten una mayor flexibilidad.\n\n3. **Topics/Exchanges y Colas:**  Mecanismos para organizar y distribuir los mensajes.  En Kafka, los mensajes se publican en topics con particiones, mientras que en RabbitMQ se utilizan exchanges para enrutar mensajes a las colas correspondientes.\n\n4. **Serialización:**  Los mensajes se serializan en un formato común, como JSON o Avro, para la interoperabilidad entre servicios.  Avro ofrece un esquema formal, lo que proporciona una mayor robustez y eficiencia.\n\n**Flujo de Comunicación:**\n\n1. **Publicación:** Un microservicio publica un mensaje en un topic/exchange específico.\n2. **Suscripción:**  Los microservicios interesados se suscriben a ese topic/exchange o a las colas correspondientes.\n3. **Consumo:** El broker de mensajes entrega los mensajes a los suscriptores de forma asíncrona.\n4. **Procesamiento:** Los microservicios procesan los mensajes y pueden, a su vez, publicar nuevos mensajes como respuesta.\n\n**Garantizando la Consistencia Eventual:**\n\nLa consistencia eventual es crucial en sistemas distribuidos asíncronos.  Para garantizarla, se pueden emplear las siguientes estrategias:\n\n1. **Patrones de Saga:**  Orquestan una secuencia de transacciones locales en diferentes microservicios.  En caso de fallo, se ejecutan compensaciones para revertir los cambios y mantener la consistencia.  Se pueden implementar sagas de orquestación o coreografía.\n\n2. **Manejo Idempotente de Mensajes:**  Los microservicios deben ser capaces de procesar el mismo mensaje múltiples veces sin efectos secundarios no deseados.  Esto se logra asignando identificadores únicos a los mensajes y rastreando su procesamiento.\n\n3. **Control de Versiones de Eventos:**  Incluir la versión del evento en el mensaje permite a los consumidores manejar diferentes versiones de los eventos y aplicar la lógica adecuada según la versión recibida.\n\n4. **Retención de Mensajes:**  Configurar el broker para retener mensajes durante un período de tiempo permite a los nuevos suscriptores acceder al historial de eventos y alcanzar la consistencia eventual.\n\n5. **Monitorización y Logging:**  Un sistema de monitorización robusto es esencial para rastrear el flujo de mensajes, detectar errores y asegurar la entrega de mensajes.  El logging detallado facilita la depuración y el análisis del sistema.\n\n**Ejemplo con Kafka:**\n\nUn microservicio de \"Pedidos\" publica un evento \"PedidoCreado\" en el topic \"pedidos\".  Los microservicios de \"Inventario\" y \"Facturación\" se suscriben a este topic.  Al recibir el evento, \"Inventario\" actualiza el stock y \"Facturación\" genera la factura.  Cada microservicio maneja sus transacciones locales y utiliza estrategias de manejo idempotente para asegurar la consistencia eventual.\n\n**Conclusión:**\n\nEste esquema de comunicación asíncrona con Kafka o RabbitMQ proporciona un marco robusto y escalable para la interacción entre microservicios reactivos.  La elección del broker, la implementación de patrones de saga y el manejo idempotente de mensajes son cruciales para garantizar la consistencia eventual y la resiliencia del sistema.  Una monitorización adecuada y un logging detallado son esenciales para la operación y el mantenimiento del sistema.\n"}, {"numero": 10, "texto": "**Intermedio**: Compara y contrasta el modelo de actores con los sistemas basados en eventos en arquitecturas reactivas, destacando ventajas, desventajas y casos de uso típicos para cada uno.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Comparación y Contraste entre el Modelo de Actores y Sistemas Basados en Eventos en Arquitecturas Reactivas\n\nTanto el modelo de actores como los sistemas basados en eventos son enfoques populares para construir arquitecturas reactivas, permitiendo la creación de sistemas altamente concurrentes, escalables y resilientes. Sin embargo, difieren en su forma de manejar el estado, la comunicación y la concurrencia.\n\n**Modelo de Actores:**\n\n* **Principios:**  Se basa en \"actores\" independientes que encapsulan estado y comportamiento. Los actores se comunican exclusivamente mediante el intercambio de mensajes asincrónicos, evitando el acceso compartido a la memoria y los problemas de concurrencia tradicionales.  Cada actor tiene un buzón donde recibe mensajes y los procesa secuencialmente.\n\n* **Ventajas:**\n    * **Simplicidad en la concurrencia:** La naturaleza asincrónica y el aislamiento del estado simplifican el manejo de la concurrencia, evitando deadlocks y race conditions.\n    * **Escalabilidad:**  Los actores pueden distribuirse fácilmente en múltiples nodos, permitiendo la escalabilidad horizontal.\n    * **Resiliencia:**  El fallo de un actor no afecta a otros, promoviendo la tolerancia a fallos.\n    * **Abstracción:** El modelo de actores ofrece una abstracción de alto nivel que simplifica el diseño y la implementación de sistemas complejos.\n\n* **Desventajas:**\n    * **Complejidad de depuración:** El flujo de mensajes asincrónico puede dificultar la depuración y el seguimiento del estado del sistema.\n    * **Sobrecarga de mensajes:**  La comunicación exclusivamente por mensajes puede generar una sobrecarga, especialmente en sistemas con alta interacción entre actores.\n    * **Curva de aprendizaje:**  El paradigma de actores puede requerir un cambio de mentalidad para desarrolladores acostumbrados a modelos de programación imperativos.\n\n* **Casos de uso típicos:**\n    * **Sistemas distribuidos:** Plataformas de comercio electrónico, redes sociales, juegos online.\n    * **Procesamiento de flujos de datos (streaming):** Análisis de datos en tiempo real, procesamiento de eventos complejos.\n    * **Simulaciones:** Modelado de sistemas complejos con múltiples agentes interactuando.\n\n\n**Sistemas Basados en Eventos:**\n\n* **Principios:** Se centran en la propagación de eventos a través de un bus de eventos o un sistema de mensajería. Los componentes se suscriben a eventos de interés y reaccionan a ellos. El estado se gestiona típicamente en una base de datos o un almacén de datos separado.\n\n* **Ventajas:**\n    * **Acoplamiento flexible:** Los componentes están débilmente acoplados, ya que no necesitan conocerse directamente.  Facilitan la evolución y el mantenimiento del sistema.\n    * **Escalabilidad:**  La arquitectura basada en eventos permite escalar horizontalmente al agregar más consumidores de eventos.\n    * **Extensibilidad:**  Es fácil agregar nuevas funcionalidades al sistema simplemente suscribiéndose a los eventos relevantes.\n    * **Auditoria:**  El registro de eventos proporciona una pista de auditoría completa de las acciones del sistema.\n\n* **Desventajas:**\n    * **Consistencia eventual:**  La naturaleza asincrónica de los eventos puede llevar a la consistencia eventual, lo que puede ser problemático en algunos casos.\n    * **Complejidad de gestión de eventos:**  La gestión de un gran número de eventos y suscripciones puede volverse compleja.\n    * **Depuración:**  Rastrear el flujo de eventos y depurar problemas puede ser desafiante.\n\n\n* **Casos de uso típicos:**\n    * **Microservicios:** Comunicación asíncrona entre microservicios.\n    * **Aplicaciones en tiempo real:**  Monitoreo de sistemas, notificaciones en tiempo real.\n    * **Integración de sistemas:**  Conexión de diferentes sistemas a través de eventos.\n\n\n**Conclusión:**\n\nTanto el modelo de actores como los sistemas basados en eventos son herramientas valiosas para construir arquitecturas reactivas. La elección entre ambos depende de las necesidades específicas del proyecto.  El modelo de actores es ideal para sistemas con alta concurrencia y donde el estado es crucial, mientras que los sistemas basados en eventos son más adecuados para sistemas con acoplamiento flexible y extensibilidad.  En algunos casos, incluso se pueden combinar ambos enfoques para aprovechar las ventajas de cada uno.  Por ejemplo, se pueden utilizar actores para procesar eventos complejos dentro de un sistema basado en eventos más amplio.\n"}], "casos_uso": [{"numero": 11, "descripcion": "1. **Caso de uso 1: Sistema de reservas en tiempo real para un cine**  \n   - **Escenario**: Un cine necesita un sistema que permita a los usuarios reservar asientos en tiempo real, evitando conflictos cuando múltiples usuarios intentan reservar el mismo asiento simultáneamente.  \n   - **Requisitos**:  \n     - Implementar un sistema reactivo que notifique a los usuarios cuando un asiento ya está ocupado.  \n     - Garantizar la consistencia de los datos en alta concurrencia.  \n   - **Herramientas sugeridas**: Akka (Actor Model), WebSockets, Base de datos con soporte para transacciones (PostgreSQL).  \n\n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": ""}]}, "createdAt": "2025-04-30T14:57:28.278944", "expiration": "2025-05-07T19:57:28.225Z", "publicAccess": true}