{"id": "cac03eb6", "examenData": {"examen_id": "899876", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-12T01:01:47.644Z", "nombre_profesor": "Mariela Isabel Camargo Roman", "profesor_id": "16MI765", "preguntas_marcar": [{"numero": 1, "texto": "En el contexto de las arquitecturas reactivas, ¿qué significa ser \"Elástico\"?\nA) Mantener un rendimiento consistente bajo cualquier carga\nB) Fallar rápidamente ante errores\nC) Escalar o reducir recursos bajo demanda\nD) Utilizar colas de mensajes persistentes\nE) Procesar datos en lotes grandes", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 2, "texto": "¿Qué patrón de diseño se utiliza comúnmente en sistemas reactivos para prevenir la sobrecarga del consumidor por parte del productor?\nA) Circuit Breaker\nB) Bulkhead\nC) Backpressure\nD) Saga\nE) Command Query Responsibility Segregation (CQRS)", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 3, "texto": "¿Cuál es un beneficio clave de la comunicación \"Orientada a Mensajes\" en sistemas reactivos?\nA) Mayor acoplamiento entre componentes\nB) Facilita el uso de transacciones distribuidas\nC) Permite el procesamiento síncrono de solicitudes\nD) Promueve el aislamiento y el desacoplamiento\nE) Garantiza la entrega en orden de todos los mensajes", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 4, "texto": "¿Qué significa que un sistema reactivo sea \"Resiliente\"?\nA) Que puede procesar un gran volumen de solicitudes simultáneamente\nB) Que responde rápidamente a las interacciones del usuario\nC) Que permanece receptivo ante fallos de algún componente\nD) Que puede escalar horizontalmente de forma automática\nE) Que utiliza mecanismos de persistencia a prueba de fallos", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 5, "texto": "¿Cuál es el principal objetivo de lograr que un sistema reactivo sea \"Receptivo\" (Responsive)?\nA) Minimizar el costo de infraestructura\nB) Asegurar que el sistema responda de forma rápida y consistente\nC) Facilitar el despliegue continuo\nD) Permitir la integración con sistemas legados\nE) Optimizar el uso de la memoria", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 6, "texto": "¿Qué característica describe mejor la elasticidad en una arquitectura reactiva?\nA) La capacidad de recuperarse de fallos\nB) La habilidad de escalar hacia arriba y hacia abajo automáticamente\nC) La respuesta rápida a las peticiones\nD) El manejo de mensajes asíncronos\nE) El uso de un único punto de control", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 7, "texto": "¿Qué patrón de comunicación es central en la mayoría de las arquitecturas reactivas?\nA) Llamada a procedimiento remoto (RPC)\nB) Comunicación síncrona punto a punto\nC) Intercambio de mensajes asíncrono\nD) Transacciones distribuidas ACID\nE) Solicitud/Respuesta bloqueante", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 8, "texto": "¿Cuál de los siguientes NO es un beneficio clave de adoptar una arquitectura reactiva?\nA) Mejor utilización de recursos\nB) Mayor capacidad de respuesta bajo carga\nC) Reducción de la complejidad en sistemas distribuidos\nD) Mayor tolerancia a fallos\nE) Facilidad para escalar horizontalmente", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 9, "texto": "En el contexto de la resiliencia, ¿qué significa la \"aislación de fallos\" en un sistema reactivo?\nA) Que una falla en un componente no afecte a otros\nB) Que el sistema puede operar sin ninguna falla\nC) Que todos los fallos son notificados inmediatamente al usuario\nD) Que se utilizan transacciones distribuidas para recuperarse\nE) Que se duplican todos los componentes para evitar fallos", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 10, "texto": "¿Qué papel juega la \"presión de espalda\" (backpressure) en los flujos reactivos?\nA) Permite que el consumidor le indique al productor que reduzca la velocidad\nB) Garantiza que todos los mensajes sean procesados en orden FIFO\nC) Asegura que el productor envíe mensajes lo más rápido posible\nD) Es un mecanismo para reintentar el envío de mensajes fallidos\nE) Facilita la comunicación síncrona entre componentes", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}], "preguntas_libres": [{"numero": 11, "texto": "Describe cómo el patrón \"Back-pressure\" ayuda a gestionar la congestión en un sistema reactivo y proporciona un ejemplo concreto de su implementación.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 12, "texto": "Compara y contrasta los enfoques síncronos y asíncronos en el contexto de las arquitecturas reactivas, destacando las ventajas y desventajas de cada uno en términos de rendimiento y complejidad.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 13, "texto": "Analiza cómo el principio de aislamiento en las arquitecturas reactivas contribuye a la tolerancia a fallos y explica las diferentes estrategias que se pueden utilizar para implementarlo.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 14, "texto": "Diseña un escenario donde una arquitectura reactiva sería la solución ideal y justifica tu elección detallando los beneficios que aportaría en comparación con una arquitectura tradicional.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 15, "texto": "Describe cómo el patrón \"Back-pressure\" se implementa en un sistema reactivo y explica su importancia para la estabilidad del sistema bajo cargas pesadas.", "puntaje": 1, "respuestaAlumno": ""}], "casos_uso": [{"numero": 1, "descripcion": "**Escenario Práctico:** Un sistema de monitoreo de bolsa necesita procesar un flujo constante y de alto volumen de actualizaciones de precios de acciones en tiempo real. La velocidad del flujo puede variar drásticamente. Se requiere calcular promedios móviles y detectar picos o caídas significativas para alertar a los usuarios, pero los consumidores de estas alertas pueden no ser tan rápidos como el productor de datos.\n    **Requisitos Específicos:** Implementar un componente que consuma un flujo de datos simulado de precios, aplique transformaciones (cálculo de promedio móvil, detección de anomalías) y publique los resultados. El componente debe ser capaz de manejar la contrapresión (backpressure) si el sistema aguas abajo no puede procesar los datos tan rápido como llegan.\n    **Sugerencias de Herramientas o Enfoques:** Librería de programación reactiva (Project Reactor, RxJava), sistema de mensajería con soporte para flujos (Kafka, RabbitMQ), frameworks de procesamiento de streams (Kafka Streams, Akka Streams).", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 2, "descripcion": "**Escenario Práctico:** Un servicio de agregación de datos para un portal de noticias debe recopilar información (titulares, resúmenes, imágenes) de múltiples fuentes RSS externas. Algunas fuentes pueden ser lentas en responder o fallar temporalmente. El servicio debe responder rápidamente a las solicitudes de los usuarios, incluso si algunas fuentes tardan en entregar datos, y no debe bloquear el hilo principal mientras espera.\n    **Requisitos Específicos:** Construir un servicio API que, al recibir una solicitud, consulte de forma asíncrona y no bloqueante a múltiples fuentes de datos externas con latencias simuladas. La agregación debe manejar tiempos de espera (timeouts) y fallos de fuentes individuales de manera resiliente, sin afectar la disponibilidad general del servicio ni bloquear los recursos del servidor.\n    **Sugerencias de Herramientas o Enfoques:** Framework web reactivo (Spring WebFlux, Vert.x), clientes HTTP reactivos, patrones de diseño para resiliencia (Circuit Breaker, Bulkhead), programación reactiva para composición de llamadas asíncronas.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-05-11T20:01:47.719830", "expiration": "2025-05-19T01:01:47.644Z", "publicAccess": true}