{"id": "d1f7b75b", "examenData": {"examen_id": "423633", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-06-16T17:33:35.511Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI765", "preguntas_marcar": [], "preguntas_libres": [{"numero": 1, "texto": "Describe los principios fundamentales de las arquitecturas reactivas y explica cómo se diferencian de los enfoques de programación tradicionales orientados a objetos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "Las arquitecturas reactivas se basan en cuatro principios fundamentales: **responsividad**, **elasticidad**, **resiliencia** y **orientación a mensajes**. La responsividad garantiza tiempos de respuesta rápidos y consistentes, crucial para una experiencia de usuario fluida. La elasticidad permite al sistema adaptarse a las fluctuaciones de carga, escalando recursos según sea necesario. La resiliencia asegura que el sistema siga funcionando incluso ante fallos, aislando los problemas y recuperándose rápidamente. Finalmente, la orientación a mensajes facilita la comunicación asíncrona entre componentes, desacoplándolos y mejorando la concurrencia.\n\nA diferencia de la programación orientada a objetos tradicional, que se centra en el estado mutable y las llamadas a métodos síncronas, las arquitecturas reactivas priorizan el flujo de datos asíncrono e inmutable.  En lugar de invocar métodos directamente, los componentes reaccionan a cambios en flujos de datos.  Esto promueve un diseño más modular, escalable y tolerante a fallos, ideal para sistemas distribuidos y de alta concurrencia, en contraste con el enfoque más acoplado y secuencial de la POO tradicional.\n"}], "casos_uso": [{"numero": 1, "descripcion": "## Casos de Uso Prácticos: Arquitecturas Reactivas - Preguntas y Escenarios\n\n**1. Sistema de Monitorización de Sensores IoT**\n\n*   **Escenario:** Una empresa de agricultura inteligente utiliza una red de sensores IoT para monitorizar la humedad del suelo, la temperatura ambiente y la luz solar en sus campos. Los datos de los sensores llegan en flujos constantes y variables. Necesitan un sistema que procese estos datos en tiempo real para alertar a los agricultores sobre condiciones críticas (ej., suelo demasiado seco) y para optimizar el riego.\n*   **Requisitos:** Implementa un sistema que reciba flujos de datos de sensores IoT, filtre los datos relevantes (ej., humedad < 20%), y envíe notificaciones push a una aplicación móvil para los agricultores. Debe ser capaz de escalar para manejar un número creciente de sensores.\n*   **Sugerencias:** Reactor, RxJava, Spring WebFlux, Kafka, MQTT.\n\n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para el Sistema de Monitorización de Sensores IoT\n\nPara el escenario de la empresa de agricultura inteligente, se propone una arquitectura reactiva basada en Spring WebFlux, Kafka y MQTT.\n\n**1. Ingesta de Datos:** Los sensores IoT publicarán datos de telemetría (humedad, temperatura, luz solar) a un broker MQTT.  MQTT es ideal para entornos con recursos limitados y redes inestables.\n\n**2. Procesamiento de Datos en Tiempo Real:** Un servicio Spring WebFlux se suscribirá a los topics MQTT relevantes.  Spring WebFlux, basado en Reactor, permite un procesamiento asíncrono y no bloqueante de los flujos de datos.  Este servicio filtrará los datos según las reglas definidas (ej., humedad < 20%). Los datos filtrados se enviarán a un topic Kafka para su posterior procesamiento y persistencia.\n\n**3. Notificaciones Push:** Otro servicio Spring WebFlux consumirá los datos del topic Kafka. Este servicio se encargará de generar notificaciones push a la aplicación móvil de los agricultores utilizando un servicio de notificaciones push (ej., Firebase Cloud Messaging). Las notificaciones incluirán información relevante sobre la condición crítica detectada (ej., \"Humedad críticamente baja en el sector X\").\n\n**4. Escalabilidad y Resiliencia:** Kafka proporciona escalabilidad horizontal para manejar el creciente número de sensores. La arquitectura reactiva de Spring WebFlux, con su naturaleza no bloqueante, permite un uso eficiente de los recursos del servidor, mejorando la capacidad de respuesta del sistema bajo carga.  Además, la replicación de datos en Kafka garantiza la resiliencia del sistema.\n\n**5.  Persistencia de Datos:**  Opcionalmente, se puede utilizar una base de datos NoSQL como Cassandra para almacenar los datos históricos de los sensores para análisis posteriores y generación de informes.  Kafka Connect puede facilitar la integración con Cassandra.\n\n\n**Tecnologías Clave:**\n\n* **MQTT:** Protocolo ligero para comunicación máquina a máquina.\n* **Spring WebFlux:** Framework reactivo para construir aplicaciones web no bloqueantes.\n* **Kafka:** Plataforma de streaming distribuida para procesamiento de datos en tiempo real.\n* **Cassandra (Opcional):** Base de datos NoSQL para almacenamiento de datos históricos.\n* **Firebase Cloud Messaging (o similar):** Servicio para envío de notificaciones push.\n\n\nEsta arquitectura reactiva proporciona un sistema escalable, resiliente y eficiente para monitorizar los sensores IoT y alertar a los agricultores sobre condiciones críticas en tiempo real.\n"}]}, "createdAt": "2025-06-16T12:33:35.530578", "expiration": "2025-06-23T17:33:35.511Z", "publicAccess": true}