{"id": "d7a4f386", "examenData": {"id": "058318", "fecha": "2025-04-07", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál de las siguientes es una característica principal de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Alta acoplamiento entre componentes", "valor": "A"}, {"texto": "B) Escalabilidad limitada", "valor": "B"}, {"texto": "C) Tolerancia a fallos", "valor": "C"}, {"texto": "D) Latencia predecible en condiciones de carga", "valor": "D"}, {"texto": "E) Uso exclusivo de bases de datos relacionales", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1. **Avanzado**: Compare y contraste la arquitectura en capas tradicional con la arquitectura hexagonal, detallando cómo cada una maneja la separación de responsabilidades, la escalabilidad y el acoplamiento entre componentes. Proporcione ejemplos concretos de escenarios donde una sería más adecuada que la otra.", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso 1-1:**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico impredecibles durante eventos como el Black Friday. Debes diseñar un sistema reactivo que garantice escalabilidad y resiliencia para procesar órdenes y actualizar inventarios en tiempo real.  \n\n**Preguntas de caso de uso:**  \n1. ¿Cómo garantizarías que el sistema procese órdenes sin perder mensajes durante picos de demanda?  \n2. ¿Qué estrategias implementarías para mantener la consistencia de datos entre el servicio de órdenes y el de inventario?  \n\n**Requisitos específicos:**  \n- Usar un patrón de diseño reactivo como Event Sourcing o CQRS.  \n- Implementar un broker de mensajes para manejar colas de órdenes.  \n- Garantizar tolerancia a fallos y sobrecarga mediante backpressure.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Kafka, Akka, Spring WebFlux.  \n- Enfoques: Circuit Breaker, proyecciones de eventos, particionado de datos.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-07T16:47:10.492754", "expiration": "2025-04-14T21:47:10.470Z", "publicAccess": true}