{"id": "dee49cd5", "examenData": {"examen_id": "124464", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-22T21:58:14.904Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza frecuentemente en arquitecturas reactivas para manejar flujos de datos asíncronos?\nA) Singleton\nB) Factory\nC) Observer\nD) Strategy\nE) Decorator", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 2, "texto": "¿Cuál es la principal ventaja de utilizar un backpressure en un sistema reactivo?\nA) Mayor velocidad de procesamiento\nB) Menor consumo de memoria\nC) Prevención de sobrecarga del sistema\nD) Mejor manejo de errores\nE) Aumento de la concurrencia", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 3, "texto": "¿Qué tecnología es comúnmente utilizada para implementar arquitecturas reactivas?\nA) Spring MVC\nB) Struts\nC) Reactor\nD) JSF\nE) Servlet", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 4, "texto": "¿Cuál de las siguientes afirmaciones sobre los actores en un sistema reactivo es FALSA?\nA) Son unidades de concurrencia independientes.\nB) Pueden comunicarse mediante el paso de mensajes.\nC) Son gestionados por un scheduler.\nD) Siempre comparten estado mutable.\nE) Pueden fallar de forma independiente sin afectar al sistema completo.", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 5, "texto": "¿Qué tipo de sistema es ideal para ser implementado con una arquitectura reactiva?\nA) Sistemas de procesamiento de lotes\nB) Sistemas monolíticos con baja concurrencia\nC) Sistemas de alta concurrencia y eventos en tiempo real\nD) Sistemas con pocos datos\nE) Sistemas sin necesidad de escalabilidad", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 6, "texto": "¿Qué patrón de diseño se utiliza a menudo para manejar la concurrencia en arquitecturas reactivas?\nA) Singleton\nB) Factory\nC) Actor\nD) Observer\nE) Strategy", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 7, "texto": "¿Cuál es la principal ventaja de usar un backpressure en una arquitectura reactiva?\nA) Mayor velocidad de procesamiento\nB) Menor latencia\nC) Prevención de sobrecarga del sistema\nD) Aumento de la concurrencia\nE) Simplificación del código", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 8, "texto": "¿Qué tecnología es comúnmente utilizada para implementar flujos de datos reactivos?\nA) JDBC\nB) Spring MVC\nC) RxJava\nD) Hibernate\nE) JPA", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 9, "texto": "¿Qué característica describe mejor la resiliencia en una arquitectura reactiva?\nA) Capacidad para manejar picos de tráfico\nB) Capacidad para recuperarse de fallos\nC) Capacidad para escalar horizontalmente\nD) Capacidad para responder rápidamente a las solicitudes\nE) Capacidad para procesar grandes volúmenes de datos", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 10, "texto": "¿Cuál de las siguientes afirmaciones sobre la elasticidad en las arquitecturas reactivas es FALSA?\nA) Permite escalar recursos según la demanda.\nB) Reduce los costos al optimizar el uso de recursos.\nC) Implica una configuración estática de recursos.\nD) Se adapta a cambios en la carga de trabajo.\nE) Mejora la eficiencia del sistema.", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}], "preguntas_libres": [{"numero": 11, "texto": "1. Describa las ventajas y desventajas de utilizar un enfoque reactivo en el diseño de una arquitectura de microservicios, comparándolo con un enfoque tradicional basado en peticiones-respuestas.  Proporcione ejemplos concretos.\n\n2. Explique cómo la programación reactiva y el patrón Reactor (o un patrón similar) contribuyen a la escalabilidad y resistencia a fallos en una arquitectura distribuida.  Detalle ejemplos de implementaciones concretas en un caso de uso específico.\n\n3. Analice las implicaciones de la gestión de backpressure en una arquitectura reactiva, incluyendo estrategias para su manejo y las consecuencias de una mala gestión del mismo.  Proporcione ejemplos de escenarios donde la gestión de backpressure sea crítica.\n\n4. Compare y contraste dos frameworks de programación reactiva diferentes (ej. RxJava y Project Reactor) en términos de sus características principales, fortalezas y debilidades.  ¿En qué situaciones sería preferible utilizar uno sobre el otro?\n\n5. Diseñe una arquitectura reactiva para una aplicación de comercio electrónico de alto volumen de transacciones, considerando aspectos como la persistencia de datos, la gestión de eventos y la integración con sistemas externos.  Justifique las decisiones de diseño tomadas.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 12, "texto": "Explique cómo la gestión de errores y la tolerancia a fallos se abordan de manera diferente en una arquitectura reactiva en comparación con una arquitectura monolítica.  Illustre su respuesta con ejemplos de patrones de diseño reactivos relevantes.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 13, "texto": "Analice el impacto del uso de backpressure en una arquitectura reactiva distribuida. ¿Cómo se implementa el backpressure y qué estrategias se pueden utilizar para manejarlo eficazmente en un escenario de alta concurrencia?", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 14, "texto": "Explique cómo la elasticidad y la resiliencia se implementan en una arquitectura reactiva, proporcionando ejemplos concretos de mecanismos utilizados para lograr estos objetivos en un sistema distribuido.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 15, "texto": "Analice el impacto del backpressure en una arquitectura reactiva. ¿Cómo se gestiona eficazmente para evitar la sobrecarga del sistema y garantizar la estabilidad?  Describa diferentes estrategias y sus implicaciones.", "puntaje": 1, "respuestaAlumno": ""}], "casos_uso": [{"numero": 16, "descripcion": "-   **Escenario práctico detallado:** Un sistema de monitoreo de redes recibe un flujo continuo de eventos (ej. errores de conexión, cambios de estado de dispositivos). Estos eventos deben ser procesados en tiempo real para detectar patrones (ej. múltiples errores en un dispositivo) y generar alertas. El volumen de eventos puede ser muy alto y variable.\n-   **Requisitos específicos:** Construir un servicio que consuma un stream de eventos de red, aplique reglas de correlación y detección de patrones sobre la ventana de tiempo de los eventos, y emita eventos de alerta cuando se detecten condiciones predefinidas. El sistema debe procesar los eventos de forma no bloqueante y ser capaz de escalar para manejar picos de tráfico.\n-   **Sugerencias de herramientas o enfoques:** Usar frameworks de stream processing (Akka Streams, Kafka Streams, Apache Flink) o librerías de programación reactiva con operadores de ventana y agregación (Reactor, RxJava). Considerar el uso de un message broker (Kafka) como fuente del stream de eventos.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 17, "descripcion": "-   **Escenario práctico detallado:** Desarrollar el backend para una aplicación de chat en tiempo real. Los mensajes enviados por un usuario deben ser instantáneamente visibles para todos los demás usuarios en la misma sala. El sistema debe manejar miles de usuarios concurrentes y la entrega de mensajes debe ser eficiente y de baja latencia.\n-   **Requisitos específicos:** Implementar un servicio que reciba mensajes de chat de usuarios, los persista (opcionalmente) y los difunda eficientemente a todos los clientes suscritos a una sala específica. La comunicación entre el servidor y los clientes web debe ser en tiempo real y bidireccional.\n-   **Sugerencias de herramientas o enfoques:** Utilizar WebSockets o Server-Sent Events (SSE) con un framework web reactivo (Spring WebFlux, Vert.x, Akka HTTP). Usar", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-05-22T16:58:14.956162", "expiration": "2025-05-29T21:58:14.904Z", "publicAccess": true}