{"id": "e0b724c7", "examenData": {"id": "465966", "nombreExamen": "Programación UML", "tipoExamen": "Evaluación", "fecha": "2025-04-29", "profesor": "Mariela Isabel Camargo Román", "profesorId": "16MI987", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "¿Cuál de los siguientes es un principio clave de las arquitecturas reactivas?  \nA) Acoplamiento fuerte entre componentes  \nB) Tolerancia al fracaso  \nC) Procesamiento sincrónico  \nD) Jerarquía rígida de servicios  \nE) Uso exclusivo de lenguajes compilados", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 3}, {"numero": 2, "texto": "¿Qué patrón de diseño es común en sistemas reactivos?  \nA) Singleton  \nB) Observer  \nC) Factory  \nD) Decorator  \nE) Adapter", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 4}, {"numero": 3, "texto": "¿Qué tecnología se asocia frecuentemente con arquitecturas reactivas?  \nA) COBOL  \nB) ReactJS  \nC) Apache Kafka  \nD) MySQL  \nE) Docker", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 4, "texto": "¿Cuál es un beneficio de la mensajería asíncrona en sistemas reactivos?  \nA) Mayor latencia  \nB) Menor complejidad  \nC) Mejor desacoplamiento  \nD) Dependencia de estado compartido  \nE) Requerimientos de hardware reducido", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 2}, {"numero": 5, "texto": "¿Qué concepto es esencial en el diseño de sistemas reactivos?  \nA) Estado global mutable  \nB) Procesamiento por lotes  \nC) Elasticidad  \nD) Acoplamiento temporal  \nE) Transacciones largas", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null, "respuestaCorrectaIndex": 0}], "preguntasLibres": [{"numero": 1, "texto": "**Intermedio**: Compara y contrasta las arquitecturas reactivas basadas en eventos con las basadas en mensajes, destacando sus ventajas, desventajas y casos de uso típicos.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Arquitecturas Reactivas: Eventos vs. Mensajes\n\nTanto las arquitecturas reactivas basadas en eventos como las basadas en mensajes facilitan la construcción de sistemas distribuidos resilientes y escalables, pero difieren en sus mecanismos de comunicación y, por lo tanto, en sus características y aplicabilidad.  A continuación, se presenta una comparación detallada:\n\n**Arquitecturas basadas en eventos:**\n\n* **Mecanismo:** Se basan en la publicación/suscripción a un flujo de eventos. Un componente publica un evento que representa un cambio de estado, y otros componentes suscritos a ese tipo de evento reaccionan de forma independiente y asíncrona.  No hay una expectativa de respuesta directa del suscriptor al publicador.\n* **Ventajas:**\n    * **Acoplamiento bajo:** Los componentes están desacoplados, ya que el publicador no necesita conocer a los suscriptores. Esto facilita la evolución y el mantenimiento del sistema.\n    * **Escalabilidad:**  La naturaleza asíncrona permite el procesamiento paralelo de eventos, mejorando la escalabilidad.\n    * **Simplicidad:** El modelo de publicación/suscripción es conceptualmente simple y fácil de implementar.\n    * **Tiempo real:** Ideal para sistemas que requieren respuestas rápidas a eventos, como procesamiento de streams o monitoreo en tiempo real.\n\n* **Desventajas:**\n    * **Complejidad en la gestión de eventos:**  En sistemas complejos, la gestión de un gran volumen de eventos y sus dependencias puede ser complicada.\n    * **Depuración y rastreo:**  El seguimiento del flujo de eventos a través del sistema puede ser difícil, especialmente en escenarios de alta concurrencia.\n    * **Orden de eventos:** Garantizar el orden de los eventos puede ser un desafío, especialmente en entornos distribuidos.\n\n* **Casos de uso típicos:**\n    * **Procesamiento de streams de datos:**  Análisis de datos en tiempo real, como el monitoreo de redes sociales.\n    * **Internet de las Cosas (IoT):**  Procesamiento de datos de sensores y control de dispositivos.\n    * **Aplicaciones en tiempo real:**  Juegos online, chat en vivo, notificaciones push.\n\n\n**Arquitecturas basadas en mensajes:**\n\n* **Mecanismo:**  Se basan en el intercambio de mensajes entre componentes a través de un intermediario (ej. cola de mensajes). Un componente envía un mensaje a una cola específica, y otro componente lee el mensaje de la cola.  La comunicación puede ser asíncrona o síncrona (solicitud/respuesta).\n* **Ventajas:**\n    * **Fiabilidad:** Las colas de mensajes garantizan la entrega de mensajes incluso en caso de fallos temporales.\n    * **Flexibilidad:**  Soportan diferentes patrones de mensajería, como punto a punto, publicación/suscripción y solicitud/respuesta.\n    * **Transacciones:**  Permiten la gestión de transacciones para garantizar la consistencia de los datos.\n\n* **Desventajas:**\n    * **Complejidad de la infraestructura:** Requiere la configuración y administración de un intermediario de mensajes.\n    * **Latencia:**  La comunicación a través de un intermediario puede introducir latencia.\n    * **Acoplamiento con el intermediario:** Los componentes dependen del intermediario de mensajes.\n\n* **Casos de uso típicos:**\n    * **Integración de sistemas:** Conexión de diferentes sistemas y aplicaciones.\n    * **Microservicios:**  Comunicación entre microservicios.\n    * **Aplicaciones empresariales:**  Procesamiento de transacciones y gestión de flujos de trabajo.\n\n\n\n**Comparación directa:**\n\n| Característica | Basada en Eventos | Basada en Mensajes |\n|---|---|---|\n| **Comunicación** | Publicación/Suscripción | Punto a punto, Pub/Sub, Req/Res |\n| **Acoplamiento** | Bajo | Medio (con el intermediario) |\n| **Escalabilidad** | Alta | Alta |\n| **Complejidad** | Menor (conceptualmente) | Mayor (infraestructura) |\n| **Fiabilidad** | Menor (sin garantía de entrega) | Mayor (colas persistentes) |\n| **Tiempo Real** | Ideal | Posible, pero con posible latencia |\n\n\n\n**Conclusión:**\n\nLa elección entre una arquitectura basada en eventos y una basada en mensajes depende de los requisitos específicos del sistema.  Las arquitecturas basadas en eventos son ideales para sistemas altamente escalables y reactivos que requieren bajo acoplamiento, mientras que las arquitecturas basadas en mensajes son más adecuadas para sistemas que requieren alta fiabilidad y flexibilidad en los patrones de comunicación.  En algunos casos, incluso se pueden combinar ambos enfoques para aprovechar las ventajas de cada uno.\n"}, {"numero": 2, "texto": "**Intermedio-Avanzado**: Analiza cómo se maneja la resiliencia en una arquitectura reactiva. Describe al menos dos patrones de diseño que permiten tolerancia a fallos y cómo se implementan.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Resiliencia en Arquitecturas Reactivas: Manejo de Fallos y Patrones de Diseño\n\nLa resiliencia en una arquitectura reactiva se refiere a la capacidad del sistema para mantenerse responsivo y funcional incluso ante fallos.  En lugar de evitar los fallos, una arquitectura reactiva los asume como inevitables y proporciona mecanismos para aislarlos, gestionarlos y recuperarse de ellos, manteniendo la disponibilidad y consistencia eventual del sistema.  Esto se logra a través de una combinación de principios y patrones de diseño específicos.\n\nLa base de la resiliencia reactiva descansa en la **delegación de responsabilidades**.  En lugar de un manejo centralizado de errores, cada componente es responsable de su propia resiliencia.  Esto se alinea con los principios reactivos de aislamiento y desacoplamiento, limitando el impacto de los fallos y previniendo cascadas de errores.\n\nA continuación, analizamos dos patrones de diseño cruciales para la tolerancia a fallos en sistemas reactivos:\n\n**1. Supervisor:**\n\nEl patrón Supervisor implementa una jerarquía de supervisión donde componentes \"supervisores\" monitorizan el estado de sus componentes \"trabajadores\" (subordinados).  Si un trabajador falla, el supervisor decide la estrategia de recuperación adecuada.  Este patrón se basa en el principio de \"deja que falle\" (let it crash), aislando el fallo en el trabajador y permitiendo al supervisor tomar la acción correctiva sin afectar a otros componentes.\n\n**Implementación:**\n\n* El supervisor se suscribe a los eventos de ciclo de vida del trabajador (inicio, parada, fallo).\n* Cuando un trabajador falla, el supervisor recibe una notificación.\n* El supervisor puede implementar diferentes estrategias de recuperación, como:\n    * **Reinicio:** Reiniciar el trabajador.  Útil para fallos transitorios.\n    * **Escalado:** Escalar el problema a un supervisor de nivel superior.  Adecuado para fallos persistentes o desconocidos.\n    * **Reanudación:** Reanudar el trabajador desde un estado anterior.  Permite la recuperación de datos y el progreso.\n    * **Parada:** Detener al trabajador y sus dependencias si el fallo es irrecuperable.\n\n**Ejemplo (conceptual):** Un supervisor monitoriza un componente encargado de procesar pagos. Si el componente falla al procesar un pago debido a un problema de conexión con la base de datos (fallo transitorio), el supervisor podría reiniciarlo. Si el fallo persiste tras varios reinicios, el supervisor podría escalar el problema a un supervisor de nivel superior o detener el componente para evitar un bucle infinito de reintentos.\n\n**2. Circuit Breaker:**\n\nEl patrón Circuit Breaker previene que un sistema intente repetidamente realizar una operación que probablemente falle, permitiendo al sistema continuar funcionando y dando tiempo al componente fallido para recuperarse.  Actúa como un interruptor automático, abriendo el circuito cuando detecta un número determinado de fallos en un periodo de tiempo.\n\n**Implementación:**\n\n* El Circuit Breaker tiene tres estados:\n    * **Cerrado:** Las peticiones pasan al componente protegido.  Se monitoriza el número de fallos.\n    * **Abierto:** Las peticiones se rechazan inmediatamente, devolviendo un error.  Tras un tiempo predefinido, el circuito pasa al estado Semiabierto.\n    * **Semiabierto:** Se permite una petición de prueba pasar al componente protegido. Si la petición tiene éxito, el circuito vuelve al estado Cerrado. Si falla, vuelve al estado Abierto.\n\n**Ejemplo (conceptual):**  Un servicio web depende de una API externa.  Si la API externa experimenta problemas de rendimiento o indisponibilidad, el Circuit Breaker detectará los fallos en las llamadas.  Tras un número determinado de fallos, el Circuit Breaker se abrirá, evitando que el servicio web realice más llamadas a la API fallida.  Después de un periodo de tiempo, el Circuit Breaker permitirá una llamada de prueba.  Si la API responde correctamente, el circuito se cerrará y las llamadas se reanudarán. Si la API sigue fallando, el circuito volverá a abrirse.\n\n\nEn resumen, la resiliencia en arquitecturas reactivas se logra mediante la delegación de la gestión de fallos a componentes individuales y la aplicación de patrones de diseño como Supervisor y Circuit Breaker.  Estos patrones, junto con otros mecanismos como la replicación y la redundancia, permiten a los sistemas reactivos tolerar fallos, recuperarse de ellos y mantener la disponibilidad y la funcionalidad incluso en entornos complejos y dinámicos.\n"}, {"numero": 3, "texto": "**Avanzado**: Describe cómo se logra la escalabilidad elástica en sistemas reactivos. Incluye ejemplos de tecnologías o frameworks que facilitan este comportamiento y explica su funcionamiento.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Escalabilidad Elástica en Sistemas Reactivos\n\nLa escalabilidad elástica en sistemas reactivos se refiere a la capacidad de un sistema para ajustar dinámicamente sus recursos (CPU, memoria, instancias) en respuesta a fluctuaciones en la demanda, tanto hacia arriba como hacia abajo, de manera automática y transparente para el usuario.  Esto asegura un rendimiento óptimo y una utilización eficiente de los recursos, minimizando costos y latencia.  Un sistema reactivo escalable elásticamente debe ser **responsivo**, **resiliente**, **elástico** y **orientado a mensajes**, tal como lo define el Manifiesto Reactivo.\n\nLa escalabilidad elástica se logra mediante la combinación de varios mecanismos y tecnologías:\n\n**1. Monitorización y Métricas:**\n\nEs fundamental monitorizar continuamente el estado del sistema.  Métricas como el uso de CPU, memoria, número de peticiones por segundo, tiempo de respuesta y latencia son cruciales para detectar cambios en la demanda.  Herramientas como Prometheus, Grafana, Datadog y CloudWatch permiten recopilar, visualizar y analizar estas métricas.\n\n**2. Mecanismos de Autoescalado:**\n\nBasándose en las métricas recogidas, los mecanismos de autoescalado ajustan automáticamente los recursos del sistema.  Existen dos enfoques principales:\n\n* **Escalado horizontal:** Añadir o eliminar instancias del sistema (ej. microservicios, contenedores) en función de la carga. Kubernetes, Docker Swarm y las plataformas de cloud computing (AWS, Azure, GCP) ofrecen funcionalidades de autoescalado horizontal.\n* **Escalado vertical:** Aumentar o disminuir los recursos de una instancia individual (ej. CPU, memoria).  Este enfoque es menos flexible que el horizontal pero puede ser útil en ciertos casos.  Las plataformas de cloud computing también permiten el escalado vertical automático.\n\n**3. Backpressure:**\n\nUn componente esencial para la resiliencia y la escalabilidad elástica es el mecanismo de *backpressure*.  Cuando un componente se sobrecarga, en lugar de fallar o degradar el rendimiento para todo el sistema, comunica la sobrecarga a los componentes que lo preceden en la cadena de procesamiento.  Esto permite a los componentes upstream reducir su ritmo de envío de mensajes, evitando la cascada de fallos y permitiendo al sistema recuperarse.  Frameworks reactivos como Akka y Project Reactor implementan mecanismos de backpressure.\n\n**4. Arquitecturas Desacopladas:**\n\nLas arquitecturas desacopladas, como las basadas en microservicios y colas de mensajes (ej. Kafka, RabbitMQ), facilitan la escalabilidad elástica.  Al dividir el sistema en componentes independientes que se comunican de forma asíncrona, se permite escalar cada componente de forma independiente según sus necesidades específicas.\n\n**Ejemplos de Tecnologías y Frameworks:**\n\n* **Akka:** Un toolkit y runtime para construir sistemas reactivos distribuidos y concurrentes en la JVM.  Proporciona mecanismos de backpressure, supervisión y clustering para la escalabilidad y resiliencia.\n* **Project Reactor:** Una librería para construir aplicaciones reactivas no bloqueantes en Java.  Implementa el patrón de diseño Reactor y ofrece operadores para la gestión de flujos de datos asíncronos.\n* **Spring WebFlux:** Un framework web reactivo basado en Project Reactor que permite construir aplicaciones web escalables y resilientes.\n* **Kubernetes:** Una plataforma para la orquestación de contenedores que facilita el despliegue, escalado y gestión de aplicaciones distribuidas.\n* **Kafka:** Un sistema distribuido de streaming de eventos que permite la ingesta, procesamiento y distribución de grandes volúmenes de datos en tiempo real.\n\n**Funcionamiento de un Ejemplo con Kubernetes y Spring WebFlux:**\n\nImaginemos un servicio web reactivo construido con Spring WebFlux desplegado en Kubernetes.  Al aumentar el tráfico, Kubernetes monitoriza las métricas del servicio (ej. uso de CPU).  Si el uso de CPU supera un umbral predefinido, el autoescalador horizontal de Kubernetes crea nuevas réplicas del servicio.  El balanceador de carga de Kubernetes distribuye el tráfico entre las réplicas, asegurando que ninguna instancia se sobrecargue.  Si el tráfico disminuye, Kubernetes elimina las réplicas sobrantes, optimizando el uso de recursos.  Spring WebFlux, por su parte, gestiona la concurrencia y el backpressure dentro de cada instancia del servicio, garantizando la responsividad incluso bajo alta carga.\n\n\nEn resumen, la escalabilidad elástica en sistemas reactivos se basa en la monitorización continua, mecanismos de autoescalado, backpressure y arquitecturas desacopladas.  La combinación de estas técnicas y el uso de frameworks reactivos permite construir sistemas que se adaptan dinámicamente a las fluctuaciones en la demanda, ofreciendo un rendimiento óptimo y una alta disponibilidad.\n"}, {"numero": 4, "texto": "**Avanzado**: Explica el concepto de \"backpressure\" en sistemas reactivos, su importancia y cómo se implementa en frameworks como Akka o Project Reactor. Proporciona un ejemplo práctico.", "puntaje": 1, "respuestaAlumno": "", "respuestaProfesor": "## Backpressure en Sistemas Reactivos\n\nEn sistemas reactivos, el **backpressure** es un mecanismo esencial que permite a un consumidor de datos controlar el flujo de datos que recibe de un productor cuando la velocidad de producción supera su capacidad de procesamiento.  Sin backpressure, un productor rápido podría abrumar a un consumidor lento, llevando a la saturación de buffers, pérdida de datos, o incluso el colapso del sistema.  Es la contraparte reactiva del control de flujo tradicional, pero opera de forma más dinámica y descentralizada.\n\n**Importancia del Backpressure:**\n\n* **Previene la sobrecarga del sistema:** Evita que los consumidores se saturen y colapsen bajo una alta carga de datos.\n* **Aumenta la resiliencia:** Permite que el sistema se adapte a fluctuaciones en la velocidad de producción y consumo, manteniendo la estabilidad.\n* **Mejora la eficiencia:** Al controlar el flujo de datos, se minimiza el desperdicio de recursos en el procesamiento de datos que eventualmente se descartarían.\n* **Facilita la depuración:** Proporciona información valiosa sobre los cuellos de botella en el sistema.\n\n**Implementación en Frameworks Reactivos:**\n\nFrameworks como Akka Streams y Project Reactor ofrecen mecanismos sofisticados para implementar backpressure.  Generalmente, se basan en la idea de que los consumidores *solicitan* datos al productor en lugar de simplemente recibirlos pasivamente.  Veamos cómo se implementa en cada uno:\n\n* **Akka Streams:** Utiliza el principio de \"demand driven\" o \"tirado por la demanda\".  Cada etapa del stream solicita un número específico de elementos a la etapa anterior. Esta demanda se propaga hacia arriba en el stream, asegurando que el productor solo genere la cantidad de datos que el consumidor puede manejar.  Akka Streams ofrece varias estrategias de backpressure, incluyendo buffering, dropping, y estrategias personalizadas.\n\n* **Project Reactor:**  Similar a Akka Streams, Reactor se basa en el modelo \"pull\" o \"tirado\".  Los operadores como `onBackpressureBuffer`, `onBackpressureDrop`, `onBackpressureLatest`, y `onBackpressureError` permiten definir cómo un consumidor debe reaccionar a la sobrecarga.  También permite definir estrategias personalizadas usando `onBackpressure`.\n\n\n**Ejemplo Práctico (Project Reactor):**\n\nImaginemos un sistema que procesa datos de un sensor a alta velocidad.  El sensor produce datos más rápido de lo que el procesador puede manejar.  Usando Reactor, podemos implementar backpressure para controlar el flujo de datos:\n\n```java\nimport reactor.core.publisher.Flux;\nimport java.time.Duration;\n\npublic class BackpressureExample {\n\n    public static void main(String[] args) throws InterruptedException {\n\n        Flux<Integer> sensorData = Flux.interval(Duration.ofMillis(100)) // Emite un valor cada 100ms\n                .map(i -> i.intValue());\n\n        Flux<Integer> processedData = sensorData\n                .onBackpressureBuffer(10, // Buffer de tamaño 10\n                        data -> System.err.println(\"Dato descartado: \" + data), // Acción al descartar un dato\n                        BufferOverflowStrategy.DROP_OLDEST) // Descarta los datos más antiguos\n                .map(i -> {\n                    Thread.sleep(500); // Simula procesamiento lento (500ms por dato)\n                    return i * 2;\n                });\n\n\n        processedData.subscribe(data -> System.out.println(\"Dato procesado: \" + data));\n\n        Thread.sleep(5000); // Deja correr el programa por 5 segundos\n    }\n}\n\n```\n\nEn este ejemplo, `onBackpressureBuffer` crea un buffer de tamaño 10. Si el buffer se llena, los datos más antiguos se descartan y se imprime un mensaje de error.  Esto evita que el productor sature al consumidor, que procesa los datos a un ritmo más lento.\n\n**Conclusión:**\n\nEl backpressure es un componente crucial en sistemas reactivos para manejar la sobrecarga de datos y mantener la estabilidad del sistema.  Frameworks como Akka Streams y Project Reactor ofrecen herramientas robustas para implementar backpressure de manera eficiente y flexible, permitiendo a los desarrolladores controlar el flujo de datos y construir sistemas resilientes y escalables. La elección de la estrategia de backpressure adecuada depende de las necesidades específicas de la aplicación, considerando factores como la tolerancia a la pérdida de datos y la latencia aceptable.\n"}], "casosUso": [{"numero": 1, "descripcion": "**Escenario**: Un servicio de streaming de video requiere procesar y recomendar contenido en tiempo real basado en el comportamiento de los usuarios (pausas, búsquedas, valoraciones).  \n   **Requisitos**: Diseña una arquitectura reactiva que procese eventos de interacción de usuarios y actualice las recomendaciones sin bloqueos.  \n   **Herramientas sugeridas**: Akka, RabbitMQ, Redis.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución: Arquitectura Reactiva para Recomendaciones en Tiempo Real\n\nEste diseño propone una arquitectura reactiva para un servicio de streaming de video que procesa eventos de usuario en tiempo real y actualiza las recomendaciones dinámicamente utilizando Akka, RabbitMQ y Redis.\n\n**Arquitectura:**\n\nLa arquitectura se divide en los siguientes componentes:\n\n1. **Productores de Eventos:**  Módulos del sistema que generan eventos de interacción del usuario. Ejemplos:\n    * **Reproductor de Video:** Emite eventos como \"inicio de reproducción\", \"pausa\", \"finalización\", \"avance rápido\", etc.\n    * **Módulo de Búsqueda:** Emite eventos con las búsquedas realizadas por el usuario.\n    * **Sistema de Valoraciones:** Emite eventos cuando un usuario valora un video.\n\n2. **RabbitMQ (Message Broker):** Actúa como un intermediario asíncrono desacoplando a los productores de los consumidores. Los eventos se publican en diferentes colas según su tipo (e.g., \"eventos_reproduccion\", \"eventos_busqueda\", \"eventos_valoracion\").\n\n3. **Consumidores Akka (Actores):**  Implementan la lógica de procesamiento de eventos y actualización de recomendaciones.  Se utilizan diferentes tipos de actores:\n    * **Actores de Ingesta:** Se suscriben a las colas de RabbitMQ y reciben los eventos.  Su responsabilidad principal es validar y preprocesar los eventos antes de distribuirlos a otros actores.\n    * **Actores de Procesamiento:** Reciben eventos de los actores de ingesta y actualizan el perfil de usuario en tiempo real.  Por ejemplo, un actor podría rastrear el historial de reproducciones, las búsquedas recientes y las valoraciones del usuario.  Estos actores pueden especializarse en procesar un tipo específico de evento (e.g., un actor para eventos de reproducción, otro para eventos de búsqueda).\n    * **Actores de Recomendación:**  Reciben información actualizada del perfil de usuario desde los actores de procesamiento y generan recomendaciones personalizadas. Utilizan algoritmos de recomendación (e.g., collaborative filtering, content-based filtering) para determinar el contenido relevante.\n    * **Actores de Persistencia:**  Guardan el perfil de usuario actualizado en Redis para un acceso rápido y eficiente.\n\n4. **Redis (Almacenamiento en Caché):** Almacena los perfiles de usuario y las recomendaciones generadas. Su naturaleza in-memory permite una recuperación de datos de baja latencia, crucial para la generación de recomendaciones en tiempo real.\n\n\n**Flujo de Trabajo:**\n\n1. Un usuario interactúa con el servicio de streaming (e.g., pausa un video).\n2. El reproductor de video genera un evento \"pausa\" y lo publica en la cola \"eventos_reproduccion\" de RabbitMQ.\n3. Un Actor de Ingesta, suscrito a la cola \"eventos_reproduccion\", recibe el evento.\n4. El Actor de Ingesta valida y preprocesa el evento, y lo envía a un Actor de Procesamiento especializado en eventos de reproducción.\n5. El Actor de Procesamiento actualiza el perfil del usuario en memoria, reflejando la pausa del video.\n6. El Actor de Procesamiento notifica a un Actor de Recomendación sobre la actualización del perfil.\n7. El Actor de Recomendación recupera el perfil actualizado del usuario desde Redis y recalcula las recomendaciones basándose en la nueva información.\n8. El Actor de Recomendación guarda las nuevas recomendaciones en Redis.\n9. El Actor de Persistencia guarda el perfil actualizado del usuario en Redis.\n10. La interfaz de usuario consulta las recomendaciones actualizadas desde Redis y las muestra al usuario.\n\n\n**Ventajas de esta arquitectura:**\n\n* **Escalabilidad:** Akka permite la creación de un sistema altamente escalable mediante el uso de actores que procesan eventos concurrentemente.  RabbitMQ facilita la distribución de la carga entre múltiples consumidores.\n* **Resiliencia:**  El modelo de actores de Akka proporciona mecanismos de supervisión para gestionar fallos y asegurar la continuidad del servicio.\n* **Bajo acoplamiento:** RabbitMQ desacopla a los productores y consumidores, permitiendo que los componentes evolucionen independientemente.\n* **Tiempo Real:**  El procesamiento asíncrono y el uso de Redis permiten la generación de recomendaciones en tiempo real, mejorando la experiencia del usuario.\n\n\n**Consideraciones adicionales:**\n\n* **Algoritmos de Recomendación:**  La elección del algoritmo de recomendación dependerá de los requisitos específicos del servicio de streaming.\n* **Monitorización:** Es importante implementar un sistema de monitorización para rastrear el rendimiento del sistema y detectar posibles problemas.\n* **Persistencia a largo plazo:**  Si se requiere persistencia a largo plazo de los datos, se puede utilizar una base de datos adicional (e.g., Cassandra, MongoDB) en conjunto con Redis.\n\n\nEsta solución proporciona una base sólida para un sistema de recomendaciones en tiempo real.  La arquitectura modular y escalable permite adaptarla a las necesidades específicas del servicio de streaming.\n"}, {"numero": 2, "descripcion": "**Escenario**: Una aplicación de monitoreo de tráfico urbano debe procesar datos de sensores (cámaras, GPS) para alertar sobre congestiones y sugerir rutas alternativas.  \n   **Requisitos**: Crea un flujo reactivo que agrege y procese datos en tiempo real, con latencia mínima.  \n   **Herramientas sugeridas**: Apache Flink, MQTT, PostgreSQL.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para el Monitoreo de Tráfico Urbano en Tiempo Real\n\nEste documento describe una solución para el monitoreo de tráfico urbano en tiempo real utilizando Apache Flink, MQTT y PostgreSQL, cumpliendo con los requisitos de baja latencia y procesamiento de datos en tiempo real.\n\n**Arquitectura del Sistema:**\n\nLa arquitectura se basa en un flujo de datos reactivo que procesa la información desde los sensores hasta la generación de alertas y sugerencias de rutas.\n\n1. **Ingesta de Datos (MQTT):** Los sensores (cámaras, GPS de vehículos) envían datos de tráfico (velocidad, ubicación, densidad) a un broker MQTT.  MQTT es ideal para este escenario debido a su bajo overhead y capacidad de manejar un gran volumen de mensajes en tiempo real.  Se utilizarán diferentes tópicos MQTT para categorizar los datos según el tipo de sensor (e.g., `/traffic/camera`, `/traffic/gps`).\n\n2. **Procesamiento de Flujo (Apache Flink):** Apache Flink consume los datos del broker MQTT.  Se define un `Flink DataStream` para procesar los datos en tiempo real.  El flujo de trabajo en Flink realizará las siguientes operaciones:\n\n    * **Agregación:** Los datos de los sensores se agregan por ubicación geográfica y ventana temporal (e.g., cada minuto).  Esto permite calcular métricas como la velocidad promedio, la densidad de vehículos y el flujo de tráfico en áreas específicas.  Se utilizarán funciones de ventana de tiempo (e.g., `TumblingWindow`) para realizar esta agregación.\n\n    * **Detección de Congestión:** Se implementará una función que compare las métricas agregadas con umbrales predefinidos para detectar congestiones.  Por ejemplo, si la velocidad promedio en un área cae por debajo de un cierto límite, se considera una congestión.\n\n    * **Generación de Alertas:** Cuando se detecta una congestión, se genera una alerta.  Esta alerta puede contener información sobre la ubicación, la severidad de la congestión y la hora estimada de duración.\n\n    * **Cálculo de Rutas Alternativas:**  Utilizando algoritmos de grafos y la información de tráfico en tiempo real, se calcularán rutas alternativas para evitar las zonas congestionadas.  Se pueden utilizar librerías de grafos dentro de Flink o integrarse con servicios externos.\n\n3. **Almacenamiento (PostgreSQL):** Los datos agregados, las alertas generadas y las rutas alternativas se almacenan en una base de datos PostgreSQL.  Esto permite el análisis histórico, la generación de informes y el entrenamiento de modelos predictivos.\n\n4. **Visualización y API:**  Una capa de visualización y API expone la información procesada a los usuarios finales.  Se puede utilizar una API REST para acceder a los datos de tráfico, las alertas y las rutas alternativas.  La capa de visualización puede mostrar un mapa con la información de tráfico en tiempo real.\n\n\n**Diagrama de la Arquitectura:**\n\n```\n[Sensores (Cámaras, GPS)] --> [MQTT Broker] --> [Apache Flink] --> [PostgreSQL] --> [API/Visualización]\n```\n\n**Ventajas de la Solución:**\n\n* **Baja Latencia:** El uso de MQTT y Apache Flink permite procesar los datos en tiempo real con mínima latencia, crucial para la detección temprana de congestiones.\n* **Escalabilidad:** Apache Flink permite escalar el procesamiento de datos horizontalmente para manejar grandes volúmenes de información.\n* **Tolerancia a Fallos:**  Apache Flink ofrece mecanismos de tolerancia a fallos que garantizan la continuidad del servicio.\n* **Flexibilidad:** La arquitectura es flexible y permite la incorporación de nuevas fuentes de datos y funcionalidades.\n\n\n**Consideraciones Adicionales:**\n\n* **Calibración de Umbrales:** Es importante calibrar los umbrales de detección de congestión para evitar falsos positivos y negativos.\n* **Mantenimiento de la Base de Datos:** Se deben implementar estrategias para el mantenimiento y la optimización de la base de datos PostgreSQL.\n* **Seguridad:**  Se deben implementar medidas de seguridad para proteger la integridad y la confidencialidad de los datos.\n\n\nEsta solución proporciona una base sólida para un sistema de monitoreo de tráfico urbano en tiempo real. La combinación de MQTT, Apache Flink y PostgreSQL ofrece las herramientas necesarias para procesar grandes volúmenes de datos con baja latencia y generar información útil para los usuarios.  La arquitectura propuesta es escalable, tolerante a fallos y flexible, permitiendo adaptarse a las necesidades cambiantes del sistema.\n"}, {"numero": 3, "descripcion": "**Escenario**: Un banco necesita procesar transacciones financieras de alta frecuencia, validando fraudes y actualizando saldos en milisegundos.  \n   **Requisitos**: Implementa un sistema reactivo con consistencia eventual y alta disponibilidad.  \n   **Herramientas sugeridas**: EventStore, Axon Framework, Cassandra.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para el procesamiento de transacciones financieras de alta frecuencia\n\nEste caso requiere un sistema reactivo que pueda manejar un alto volumen de transacciones, validar fraudes y actualizar saldos con baja latencia y alta disponibilidad, utilizando consistencia eventual.  La combinación de EventStore, Axon Framework y Cassandra proporciona una base sólida para lograr estos objetivos.\n\n**Arquitectura propuesta:**\n\nLa solución se basa en el patrón CQRS (Command Query Responsibility Segregation) y Event Sourcing, implementados con Axon Framework y EventStore, utilizando Cassandra para la persistencia de los datos.\n\n**1. Ingestión de Transacciones (Commands):**\n\n* Las transacciones llegan al sistema como Commands (ej. `RealizarTransferenciaCommand`, `RealizarDepositoCommand`).\n* Un `Command Gateway` (Axon) recibe y enruta los comandos a los `Command Handlers` correspondientes.\n\n**2. Procesamiento de Comandos y Generación de Eventos (Aggregates):**\n\n* Los `Command Handlers` interactúan con los `Aggregates` (ej. `CuentaBancariaAggregate`).  Un Aggregate representa la entidad de negocio y encapsula la lógica de dominio.\n* Al procesar un comando, el `Aggregate` valida la operación (ej. saldo suficiente, límites de transacción) y, si es válida, genera un `Event` (ej. `TransferenciaRealizadaEvent`, `DepositoRealizadoEvent`).\n* Axon Framework persiste los eventos en EventStore.  Esta persistencia es la fuente de verdad del sistema.\n\n**3. Propagación de Eventos y Actualización de Vistas (Event Handlers):**\n\n* EventStore publica los eventos a los suscriptores.\n* Los `Event Handlers` se suscriben a los eventos relevantes.  Estos handlers son responsables de actualizar las vistas materializadas (ej. saldo de la cuenta) y realizar otras acciones secundarias como la validación de fraudes.\n* Para la validación de fraudes, un `EventHandler` específico puede analizar los eventos en tiempo real, buscando patrones sospechosos (ej. transacciones inusualmente grandes, múltiples transacciones en un corto período de tiempo).  Este handler puede generar alertas o incluso bloquear transacciones sospechosas.\n\n**4. Almacenamiento de Datos (Cassandra):**\n\n* Cassandra se utiliza para almacenar las vistas materializadas, optimizadas para lectura.  Su arquitectura distribuida garantiza alta disponibilidad y escalabilidad.\n* Los `Event Handlers` actualizan las vistas en Cassandra al recibir los eventos.\n\n**5. Consultas (Query Side):**\n\n* Las consultas se realizan directamente contra las vistas materializadas en Cassandra, proporcionando tiempos de respuesta rápidos.\n\n**Ventajas de esta solución:**\n\n* **Alta disponibilidad y escalabilidad:** Cassandra y EventStore son soluciones distribuidas que permiten escalar horizontalmente para manejar un alto volumen de transacciones.\n* **Consistencia eventual:**  El sistema garantiza que las vistas eventualmente reflejarán el estado correcto del sistema, permitiendo un rendimiento superior en escenarios de alta frecuencia.\n* **Auditoria completa:** Event Sourcing proporciona un registro inmutable de todos los eventos, facilitando la auditoría y el análisis del historial de transacciones.\n* **Flexibilidad y mantenibilidad:**  La separación de comandos y consultas simplifica la evolución del sistema y la adición de nuevas funcionalidades.\n\n**Implementación con las herramientas sugeridas:**\n\n* **EventStore:**  Se configura como el Event Store de Axon Framework para persistir los eventos.\n* **Axon Framework:**  Proporciona la infraestructura para implementar CQRS y Event Sourcing, incluyendo `Command Gateway`, `Command Handlers`, `Aggregates`, `Event Handlers`, y la integración con EventStore.\n* **Cassandra:** Se utiliza como base de datos para almacenar las vistas materializadas.  Se utilizan drivers de Cassandra para la interacción desde los `Event Handlers`.\n\n**Consideraciones adicionales:**\n\n* **Manejo de la consistencia eventual:** Es importante definir la tolerancia a la inconsistencia y implementar mecanismos de compensación si es necesario.\n* **Validación de fraudes en tiempo real:**  Se deben definir reglas y algoritmos específicos para la detección de fraudes.\n* **Monitoreo y alertas:**  Es crucial monitorear el rendimiento del sistema y configurar alertas para detectar posibles problemas.\n\nEsta solución proporciona una arquitectura robusta y escalable para el procesamiento de transacciones financieras de alta frecuencia, cumpliendo con los requisitos de consistencia eventual y alta disponibilidad. La combinación de EventStore, Axon Framework y Cassandra ofrece las herramientas necesarias para implementar un sistema reactivo eficiente y adaptable a las necesidades del banco.\n"}, {"numero": 4, "descripcion": "**Escenario**: Un juego multijugador en línea debe sincronizar el estado del juego entre miles de jugadores con baja latencia.  \n   **Requisitos**: Desarrolla una arquitectura reactiva que maneje eventos de juego y garantice sincronización en tiempo real.  \n   **Herramientas sugeridas**: WebSockets, Reactor, Google Cloud Pub/Sub.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false, "respuestaProfesor": "## Solución para la sincronización en tiempo real de un juego multijugador masivo\n\nEste diseño utiliza una arquitectura reactiva basada en WebSockets, Reactor y Google Cloud Pub/Sub para sincronizar el estado del juego entre miles de jugadores con baja latencia.\n\n**Arquitectura:**\n\nLa arquitectura se divide en tres componentes principales:\n\n1. **Servidor de Juego (Game Server):**  Múltiples instancias del servidor de juego se ejecutan en un clúster, cada una responsable de una porción del mundo del juego o un grupo de jugadores.  Utilizan Reactor para manejar eventos de juego de forma asíncrona y no bloqueante.\n\n2. **Pub/Sub (Message Broker):** Google Cloud Pub/Sub actúa como un broker de mensajes, distribuyendo eventos de juego a todos los servidores de juego relevantes.  Esto desacopla los servidores y permite el escalado horizontal.\n\n3. **Cliente de Juego (Game Client):** Los clientes se conectan a un servidor de juego específico a través de WebSockets, recibiendo actualizaciones del estado del juego en tiempo real.\n\n**Flujo de Eventos:**\n\n1. **Evento del Jugador:** Un jugador realiza una acción en el juego (e.g., movimiento, ataque).\n\n2. **Envío al Servidor:** El cliente envía el evento al servidor de juego asignado a través de WebSockets.\n\n3. **Validación y Procesamiento:** El servidor de juego valida la acción del jugador y la procesa según las reglas del juego.\n\n4. **Publicación del Evento:** El servidor publica el evento validado en un tópico específico de Pub/Sub.  Este tópico representa un tipo de evento (e.g., \"movimiento del jugador\", \"daño recibido\").\n\n5. **Suscripción a Eventos:** Todos los servidores de juego interesados en este tipo de evento están suscritos al tópico correspondiente en Pub/Sub.\n\n6. **Recepción y Actualización:** Los servidores de juego suscritos reciben el evento de Pub/Sub y actualizan el estado del juego localmente.\n\n7. **Notificación al Cliente:**  Cada servidor de juego notifica a sus clientes conectados sobre los cambios relevantes en el estado del juego a través de WebSockets.\n\n\n**Implementación con Reactor y WebSockets:**\n\nEl servidor de juego utiliza Reactor para manejar los eventos de forma reactiva:\n\n```java\n// Ejemplo de manejo de eventos con Reactor en el servidor\n\nFlux<GameEvent> gameEvents = Flux.from(pubSubSubscriber) // Flujo de eventos de Pub/Sub\n    .parallel()\n    .runOn(Schedulers.parallel()) // Procesamiento paralelo de eventos\n    .flatMap(event -> processGameEvent(event)) // Procesamiento del evento\n    .publishOn(Schedulers.boundedElastic()); // Publicación en un hilo dedicado para WebSockets\n\ngameEvents.subscribe(event -> {\n    // Enviar el evento a los clientes conectados a través de WebSockets\n    for (WebSocketSession session : sessions) {\n        session.sendMessage(new TextMessage(event.toJson()));\n    }\n});\n```\n\n**Ventajas de esta arquitectura:**\n\n* **Escalabilidad:**  Google Cloud Pub/Sub permite escalar horizontalmente el número de servidores de juego para manejar un gran número de jugadores.\n* **Baja Latencia:** WebSockets proporciona comunicación bidireccional en tiempo real entre el cliente y el servidor, minimizando la latencia.\n* **Reactividad:** Reactor permite un manejo eficiente y no bloqueante de eventos, maximizando el rendimiento del servidor.\n* **Desacople:** Pub/Sub desacopla los servidores de juego, aumentando la resiliencia del sistema.\n\n**Consideraciones adicionales:**\n\n* **Consistencia eventual:**  Debido a la naturaleza distribuida del sistema, la consistencia de datos es eventual. Se deben implementar mecanismos para manejar la consistencia de datos, como la reconciliación de estados.\n* **Manejo de la latencia de la red:**  Se deben implementar técnicas para mitigar los efectos de la latencia de la red, como la predicción del lado del cliente.\n* **Seguridad:** Se deben implementar medidas de seguridad para proteger el juego contra trampas y ataques.\n\n\nEsta solución proporciona una base sólida para construir un juego multijugador en línea escalable y con baja latencia. La combinación de WebSockets, Reactor y Google Cloud Pub/Sub permite un manejo eficiente de eventos y una sincronización en tiempo real del estado del juego entre miles de jugadores.\n"}]}, "createdAt": "2025-04-29T11:33:56.552025", "expiration": "2025-05-06T16:33:56.496Z", "publicAccess": true}