{"id": "edf8b40f", "examenData": {"examen_id": "619680", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-27T18:53:39.727Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza a menudo para manejar la concurrencia en sistemas reactivos?\nA) Singleton\nB) Factory\nC) Actor\nD) Observer\nE) Strategy", "puntaje": 0.2, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 2, "texto": "¿Cuál es una característica principal de un sistema distribuido reactivo?\nA) Monolítico\nB) Centralizado\nC) Decoupled\nD) Síncrono\nE) Bloqueante", "puntaje": 0.2, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 3, "texto": "¿Qué tecnología es comúnmente usada para implementar flujos de datos reactivos?\nA) JDBC\nB) RxJava\nC) Spring MVC\nD) Hibernate\nE) JPA", "puntaje": 0.2, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 4, "texto": "¿Cuál de los siguientes describe mejor la elasticidad en un sistema reactivo?\nA) Capacidad de manejar errores\nB) Capacidad de adaptarse a la carga\nC) Capacidad de responder rápidamente\nD) Capacidad de manejar datos inconsistentes\nE) Capacidad de mantener el estado", "puntaje": 0.2, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 5, "texto": "¿Qué concepto se refiere a la capacidad de un sistema reactivo de continuar operando a pesar de fallos?\nA) Elasticidad\nB) Responsividad\nC) Resiliencia\nD) Mensajes\nE)  Concurrencia", "puntaje": 0.5, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}], "preguntas_libres": [{"numero": 6, "texto": "- Nivel Básico\nExplique cómo se implementa la tolerancia a fallos en una arquitectura reactiva, incluyendo ejemplos concretos de patrones y mecanismos utilizados para asegurar la alta disponibilidad y la resiliencia ante errores.", "puntaje": 0.5, "respuestaAlumno": ""}, {"numero": 7, "texto": "- Nivel Básico\nAnalice la relación entre la arquitectura reactiva y el concepto de backpressure. Describa escenarios en los que el backpressure es crucial y explique diferentes estrategias para manejarlo eficazmente.", "puntaje": 0.5, "respuestaAlumno": ""}, {"numero": 8, "texto": "- Nivel Básico\nCompare y contraste dos frameworks o librerías diferentes (ej. Spring WebFlux y Akka) utilizados para construir aplicaciones reactivas, destacando sus fortalezas y debilidades en diferentes contextos de uso.", "puntaje": 0.5, "respuestaAlumno": ""}, {"numero": 9, "texto": "- Nivel Básico\nDiseñe una arquitectura reactiva para una aplicación de streaming de vídeo en tiempo real, considerando aspectos como la escalabilidad, la baja latencia, y la gestión de recursos.  Detalle las tecnologías y patrones de diseño que utilizaría y justifique sus elecciones.", "puntaje": 0.5, "respuestaAlumno": ""}, {"numero": 10, "texto": "- Nivel Intermedio\nExplique cómo la programación reactiva, utilizando patrones como el Publisher-Subscriber, contribuye a la escalabilidad y resiliencia de una arquitectura reactiva.  Proporcione ejemplos de implementaciones prácticas en diferentes lenguajes de programación.", "puntaje": 1.4, "respuestaAlumno": ""}, {"numero": 11, "texto": "- Nivel Intermedio\nAnalice el impacto de la elección de un framework reactivo específico (ej: Spring WebFlux, Akka, Vert.x) en el rendimiento y la complejidad de una aplicación.  Considere factores como la curva de aprendizaje, el soporte de la comunidad y la integración con otras tecnologías.", "puntaje": 1.3, "respuestaAlumno": ""}, {"numero": 12, "texto": "- Nivel Avanzado\nDiseñe una arquitectura reactiva para una aplicación de comercio electrónico que maneje un alto volumen de transacciones concurrentes, incluyendo la gestión de eventos, la persistencia de datos y la comunicación entre microservicios.  Justifique sus decisiones de diseño.", "puntaje": 2, "respuestaAlumno": ""}, {"numero": 13, "texto": "- Nivel Avanzado\nEvalúe las implicaciones de seguridad en una arquitectura reactiva distribuida, considerando aspectos como la autenticación, la autorización y la protección contra ataques de denegación de servicio (DoS).  Proponga estrategias para mitigar estos riesgos.", "puntaje": 2, "respuestaAlumno": ""}], "casos_uso": [{"numero": 14, "descripcion": "1.\n    -   **Escenario Práctico Detallado:** Una plataforma de aprendizaje en línea necesita generar dinámicamente cuestionarios sobre arquitecturas reactivas. Cuando un usuario solicita un cuestionario, el sistema debe recuperar de forma asíncrona y no bloqueante los detalles de **dos casos de uso de arquitectura reactiva distintos** de una base de datos (tratados internamente como Caso 1 y Caso 2 para el cuestionario), formatearlos como preguntas y enviar la estructura del cuestionario al usuario vía un stream. El sistema debe ser capaz de manejar muchas solicitudes concurrentes eficientemente.\n    -   **Requisitos Específicos:** Implementar un servicio web reactivo que escuche las solicitudes de cuestionario. El servicio debe realizar dos operaciones de lectura de datos concurrentes y no bloqueantes para obtener la información de dos casos de uso diferentes. Debe ensamblar la respuesta del cuestionario (conteniendo las dos preguntas) y transmitirla utilizando programación reactiva. Implementar manejo de backpressure en el stream de respuesta.\n    -   **Sugerencias de Herramientas o Enfoques:** Spring WebFlux, Project Reactor o Akka Streams, R2DBC o un driver reactivo para base de datos (ej. MongoDB reactivo), Base de datos H2 (en memoria para simulación) o MongoDB.\n\n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 15, "descripcion": "1.  **Escenario Práctico:** Una plataforma de trading financiero que debe procesar flujos masivos y continuos de datos de mercado (precios, volúmenes) en tiempo real, ejecutar órdenes con baja latencia bajo alta concurrencia y mantener estados de cartera actualizados instantáneamente para millones de usuarios. La plataforma debe ser resiliente a picos de volatilidad y fallos parciales.\n    **Requisitos para el estudiante:** Generar 2 preguntas prácticas, cada una describiendo un caso de uso específico dentro de este escenario (ej. procesamiento de datos de mercado, ejecución de órdenes, gestión de riesgo en tiempo real) y preguntando cómo se aplicarían los principios o patrones de arquitecturas reactivas a ese caso de uso particular para cumplir con los requisitos de rendimiento, resiliencia y escalabilidad.\n    **Sugerencias de herramientas o enfoques:** Akka, Kafka, Aeron, Reactive Streams, CQRS, Event Sourcing, lenguajes de programación con buen soporte para concurrencia y asincronía (Scala, Java con Project Reactor/RxJava).\n\n", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 5, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-05-27T13:53:39.791180", "expiration": "2025-06-03T18:53:39.727Z", "publicAccess": true}