{"id": "f0dc0912", "examenData": {"examen_id": "470771", "nombre_examen": "Programación UML", "tipo_examen": "Evaluación", "fecha": "2025-04-30T21:16:26.048Z", "nombre_profesor": "Mariela Isabel Camargo Román", "profesor_id": "16MI987", "preguntas_marcar": [{"numero": 1, "texto": "¿Qué patrón de diseño se utiliza comúnmente para manejar la retropresión en sistemas reactivos?", "puntaje": 1, "opciones": [{"texto": "Singleton", "valor": "A"}, {"texto": "Factory", "valor": "B"}, {"texto": "Circuit Breaker", "valor": "C"}, {"texto": "Observer", "valor": "D"}, {"texto": "Decorator", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 2, "texto": "¿Cuál es la principal ventaja de usar un sistema de mensajes asincrónico en una arquitectura reactiva?", "puntaje": 1, "opciones": [{"texto": "Acoplamiento estrecho", "valor": "A"}, {"texto": "Mayor latencia", "valor": "B"}, {"texto": "Desacoplar componentes", "valor": "C"}, {"texto": "Complejidad reducida", "valor": "D"}, {"texto": "Mayor consumo de recursos", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 3, "texto": "¿Qué tecnología se utiliza a menudo para implementar sistemas reactivos distribuidos?", "puntaje": 1, "opciones": [{"texto": "SOAP", "valor": "A"}, {"texto": "REST", "valor": "B"}, {"texto": "gRPC", "valor": "C"}, {"texto": "Akka", "valor": "D"}, {"texto": "CORBA", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 4, "texto": "¿Qué concepto se refiere a la capacidad de un sistema reactivo para mantenerse responsivo bajo carga variable?", "puntaje": 1, "opciones": [{"texto": "Resiliencia", "valor": "A"}, {"texto": "Elasticidad", "valor": "B"}, {"texto": "Orientado a mensajes", "valor": "C"}, {"texto": "Aislamiento de fallos", "valor": "D"}, {"texto": "Retropresión", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 5, "texto": "¿Cuál de las siguientes NO es una característica típica de un sistema reactivo?", "puntaje": 1, "opciones": [{"texto": "Tolerancia a fallos", "valor": "A"}, {"texto": "Estado mutable compartido", "valor": "B"}, {"texto": "Retropresión", "valor": "C"}, {"texto": "No bloqueante", "valor": "D"}, {"texto": "Concurrencia", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 6, "texto": "¿Qué patrón de mensajería describe un flujo continuo de datos entre un emisor y un receptor?", "puntaje": 1, "opciones": [{"texto": "Publish-Subscribe", "valor": "A"}, {"texto": "Request-Response", "valor": "B"}, {"texto": "Streaming", "valor": "C"}, {"texto": "Circuit Breaker", "valor": "D"}, {"texto": "Command Query Responsibility Segregation (CQRS)", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 7, "texto": "En el contexto de sistemas reactivos, ¿qué significa \"backpressure\"?", "puntaje": 1, "opciones": [{"texto": "Un mecanismo para manejar errores", "valor": "A"}, {"texto": "Un método para escalar sistemas", "valor": "B"}, {"texto": "Una forma de controlar el flujo de datos de un emisor a un receptor", "valor": "C"}, {"texto": "Un tipo de sistema de mensajería", "valor": "D"}, {"texto": "Una técnica de optimización de rendimiento", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 8, "texto": "¿Cuál de las siguientes es una herramienta o biblioteca comúnmente utilizada para construir sistemas reactivos?", "puntaje": 1, "opciones": [{"texto": "AngularJS", "valor": "A"}, {"texto": "ReactJS", "valor": "B"}, {"texto": "Vue.js", "valor": "C"}, {"texto": "RxJava", "valor": "D"}, {"texto": "jQuery", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 9, "texto": "¿Qué principio de diseño reactivo se centra en aislar los fallos para evitar que se propaguen por todo el sistema?", "puntaje": 1, "opciones": [{"texto": "Responsividad", "valor": "A"}, {"texto": "Resiliencia", "valor": "B"}, {"texto": "Elasticidad", "valor": "C"}, {"texto": "Orientado a mensajes", "valor": "D"}, {"texto": "Aislamiento de fallos", "valor": "E"}], "respuestaSeleccionada": null}], "preguntas_libres": [{"numero": 1, "texto": "Describe cómo el principio de \"aislamiento de fallos\" se implementa en una arquitectura reactiva y proporciona un ejemplo concreto de cómo se maneja un fallo en un componente sin afectar a todo el sistema.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 2, "texto": "Explica cómo el backpressure contribuye a la resiliencia de un sistema reactivo. Describe diferentes estrategias para implementar backpressure y analiza sus ventajas e inconvenientes.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 3, "texto": "Diseña un escenario donde se necesite implementar un sistema reactivo distribuido. Describe los componentes clave y cómo se comunicarían entre sí utilizando principios reactivos. Considera aspectos como la consistencia eventual y la tolerancia a fallos.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 4, "texto": "Analiza las ventajas y desventajas de utilizar un framework reactivo en un proyecto de software. Considera factores como la complejidad del proyecto, la experiencia del equipo y los requisitos de rendimiento y escalabilidad.  ¿En qué situaciones recomendarías *no* utilizar un framework reactivo y por qué?", "puntaje": 1, "respuestaAlumno": ""}], "casos_uso": [{"numero": 1, "descripcion": "1.\n   - Escenario práctico detallado: Una plataforma de trading financiero en tiempo real que recibe flujos constantes de datos de mercado (precios, volumen) de múltiples fuentes, procesa órdenes de compra/venta a muy alta velocidad y debe notificar a los usuarios sobre cambios relevantes en sus posiciones o el mercado con mínima latencia. La estabilidad y la capacidad de manejar picos de datos son críticas.\n   - Requisitos específicos: Analizar el escenario y generar dos preguntas prácticas sobre cómo una arquitectura reactiva podría abordar desafíos específicos del trading en tiempo real, centrándose cada pregunta en un caso de uso reactivo distinto dentro de este contexto (ej. manejo eficiente de streams de datos de mercado, aplicación de backpressure en el procesamiento de órdenes).\n   - Sugerencias de herramientas o enfoques: Considerar conceptos como streams de datos reactivos, manejo de backpressure, tolerancia a fallos, concurrencia asíncrona. Herramientas: Kafka, Akka, Spring WebFlux, Project Reactor, RxJava.\n\n2.\n   - Escenario práctico detallado: Un sistema de monitoreo para una red masiva de dispositivos IoT (millones de sensores distribuidos). Los dispositivos envían datos de telemetría (temperatura, vibración, estado) continuamente. El sistema debe ingerir este volumen extremo de datos, realizar análisis preliminares en tiempo real, detectar anomalías y activar alertas, manteniendo la operación a pesar de la variabilidad en la tasa de datos y posibles fallos en nodos de recolección.\n   - Requisitos específicos: Dado este escenario de IoT a gran escala, generar dos preguntas que exploren aplicaciones concretas de arquitecturas reactivas para la ingesta y procesamiento de datos de sensores, cada pregunta abordando un aspecto diferente y fundamental (ej. escalabilidad horizontal de la ingesta de datos, procesamiento de streams de eventos para detección de anomalías).\n   - Sugerencias de herramientas o enfoques: Pensar en procesamiento de eventos (event streams), escalabilidad masiva, resiliencia distribuida, patrones de ingesta de datos. Herramientas: Apache Flink/Kafka Streams, Akka Streams, MQTT, Apache NiFi, Kafka.\n\n3.\n   - Escenario práctico detallado: El backend de un juego multijugador online competitivo con miles de jugadores concurrentes. El sistema gestiona el matchmaking, sincroniza el estado del juego entre todos los participantes en tiempo real, maneja interacciones rápidas del juego y debe ser altamente disponible y tolerante a fallos de red o desconexiones de jugadores individuales sin afectar la partida para otros. La baja latencia es vital.\n   - Requisitos específicos: Para este entorno de juego online de alta concurrencia y baja latencia, formular dos preguntas enfocadas en cómo los principios reactivos pueden mejorar la experiencia del usuario y la robustez del backend, cada una orientada a un caso de uso reactivo distinto (ej. sincronización de estado del juego en tiempo real mediante streams, manejo resiliente de conexiones de jugadores y sus fallos).\n   - Sugerencias de herramientas o enfoques: Considerar manejo de estado concurrente, comunicación en tiempo real (WebSockets, UDP), tolerancia a fallos, escalabilidad elástica. Herramientas: Akka, Vert.x, Netty, WebSockets, gRPC, Redis (Pub/Sub).\n\n4.\n   - Escenario práctico detallado: Una plataforma de e-commerce de alto tráfico que experimenta picos masivos de pedidos durante eventos de venta (ej. Black Friday). El sistema debe procesar miles de pedidos por minuto, actualizar el inventario en tiempo real, gestionar pagos y coordinar con múltiples servicios externos (envío, pago, notificaciones) de forma eficiente y resiliente. Un fallo en un servicio externo no debe impedir el procesamiento de otros pedidos.\n   - Requisitos específicos: Analizar el escenario de e-commerce de alta demanda y generar dos preguntas sobre cómo una arquitectura reactiva podría optimizar el flujo de pedidos y la gestión de dependencias externas, cada pregunta explorando un caso de uso reactivo diferente (ej. procesamiento asíncrono y resiliente de pedidos, aplicación de backpressure al interactuar con pasarelas de pago externas).\n   - Sugerencias de herramientas o enfoques: Pensar en procesamiento de eventos, coreografía/orquestación de servicios, backpressure, resiliencia (Circuit Breaker), colas de mensajes. Herramientas: Spring Integration/Spring Cloud Stream, Kafka, RabbitMQ, Saga pattern, Circuit Breaker pattern.\n\n5.\n   - Escenario práctico detallado: Un sistema de agregación de feeds de redes sociales y envío de notificaciones push personalizadas. El sistema consume datos de múltiples APIs de redes sociales (Twitter, Facebook, Instagram, etc.), filtra y agrega contenido relevante para cada usuario y envía notificaciones push personalizadas a millones de dispositivos móviles en tiempo real. Debe manejar la variabilidad en la velocidad y disponibilidad de las APIs externas y gestionar la alta carga del servicio de notificaciones.\n   - Requisitos específicos: Para este escenario de agregación de feeds y notificaciones a gran escala, generar dos preguntas sobre la aplicación de arquitecturas reactivas para mejorar la eficiencia y resiliencia del sistema, cada pregunta centrada en un caso de uso reactivo distinto (ej. consumo y transformación continua de streams de datos de APIs externas, manejo de alta concurrencia y backpressure en el envío de notificaciones push).\n   - Sugerencias de herramientas o enfoques: Considerar procesamiento de streams, integración de APIs asíncronas, manejo de alta concurrencia, backpressure. Herramientas: Apache NiFi/StreamSets, Kafka/Pulsar, Spring WebFlux, gRPC, WebSockets, sistemas de colas de mensajes.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-30T16:16:26.101135", "expiration": "2025-05-07T21:16:26.048Z", "publicAccess": true}