{"id": "f5adcbba", "examenData": {"id": "804660", "fecha": "2025-04-08", "profesor": "Mariela Isabel Camargo Roman", "nombreAlumno": "", "idAlumno": "", "bloqueado": true, "preguntasMarcar": [{"numero": 1, "texto": "1-1) ¿Cuál de los siguientes es un principio fundamental de las arquitecturas reactivas?", "puntaje": 1, "opciones": [{"texto": "A) Acoplamiento fuerte entre componentes", "valor": "A"}, {"texto": "B) Tolerancia al fallo", "valor": "B"}, {"texto": "C) Uso exclusivo de bases de datos relacionales", "valor": "C"}, {"texto": "D) Procesamiento por lotes (batch)", "valor": "D"}, {"texto": "E) Bloques monolíticos centralizados", "valor": "E"}], "respuestaSeleccionada": null}], "preguntasLibres": [{"numero": 1, "texto": "1-1. Compara y contrasta las arquitecturas en capas y hexagonal en términos de acoplamiento, cohesión y escalabilidad. Explica con ejemplos concretos en qué escenarios sería más adecuado utilizar cada una y por qué. (Avanzado)", "puntaje": 1, "respuestaAlumno": ""}], "casosUso": [{"numero": 1, "descripcion": "**Caso 1-1**  \n\n**Escenario práctico:**  \nUna plataforma de comercio electrónico necesita manejar picos de tráfico durante eventos de ventas flash sin degradar el rendimiento. Debes diseñar un sistema reactivo que procese órdenes de compra de manera asíncrona y escalable, garantizando consistencia eventual y tolerancia a fallos.  \n\n**Preguntas de caso de uso:**  \n1. ¿Cómo utilizarías el patrón Event Sourcing para garantizar la trazabilidad de las órdenes y permitir la recuperación ante fallos?  \n2. ¿Qué estrategias aplicarías para desacoplar los microservicios de procesamiento de pagos y envío de notificaciones usando mensajería reactiva?  \n\n**Requisitos específicos:**  \n- Implementar un bus de eventos (ej. Apache Kafka o RabbitMQ) para manejar los mensajes de órdenes.  \n- Usar proyecciones para reconstruir el estado de las órdenes desde los eventos.  \n- Garantizar el procesamiento idempotente de mensajes en caso de reintentos.  \n\n**Sugerencias de herramientas/enfoques:**  \n- Herramientas: Apache Kafka, Akka, Spring WebFlux, MongoDB (para proyecciones).  \n- Enfoques: CQRS, Event Sourcing, Patrón Actor Model.", "pregunta": "Pregunta sobre el caso de uso", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-04-08T15:09:27.608607", "expiration": "2025-04-15T20:09:27.559Z", "publicAccess": true}