{"id": "f82b050e", "examenData": {"examen_id": "764063", "nombre_examen": "Arquitecturas Reactivas", "tipo_examen": "Evaluación", "fecha": "2025-05-19T14:19:50.045Z", "nombre_profesor": "Mariela Isabel Camargo Roman", "profesor_id": "16MI765", "preguntas_marcar": [{"numero": 1, "texto": "En el contexto de las Arquitecturas Reactivas, ¿qué significa que un sistema sea Resiliente?\nA) Que puede escalar horizontalmente para manejar más carga.\nB) Que se mantiene responsivo ante fallos.\nC) Que procesa todas las solicitudes de forma secuencial.\nD) Que utiliza un patrón de solicitud/respuesta síncrono.\nE) Que ignora los errores y continúa procesando.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 2, "texto": "¿Qué patrón se utiliza comúnmente en sistemas reactivos para manejar la sobrecarga de datos de un emisor a un receptor (Backpressure)?\nA) Patrón de Polling constante.\nB) Limitación de la velocidad de emisión por parte del receptor.\nC) Ignorar los datos adicionales.\nD) Almacenar todos los datos entrantes en memoria ilimitada.\nE) Bloquear al emisor hasta que el receptor esté listo.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 3, "texto": "¿Qué característica describe a un sistema reactivo como Elástico?\nA) Que utiliza un conjunto fijo de recursos de hardware.\nB) Que puede adaptarse a cargas de trabajo variables.\nC) Que requiere aprovisionamiento manual de recursos.\nD) Que es difícil de escalar más allá de una sola máquina.\nE) Que solo puede crecer, no reducir su uso de recursos.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 4, "texto": "¿Cuál es una característica clave de una implementación de Reactive Streams?\nA) Permite el paso de datos síncrono y bloqueante.\nB) Gestiona la contrapresión de forma no bloqueante.\nC) Se basa exclusivamente en el patrón pull (el receptor pide datos).\nD) Se basa exclusivamente en el patrón push (el emisor envía datos).\nE) Requiere compartir estado mutable entre el emisor y el receptor.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 5, "texto": "¿Cuál de las siguientes tecnologías o especificaciones está directamente relacionada con la implementación de principios reactivos?\nA) Transacciones ACID de bases de datos relacionales.\nB) Llamadas a procedimientos remotos (RPC) síncronas.\nC) Especificación Reactive Streams.\nD) Arquitecturas de Microservicios monolíticos.\nE) Protocolo FTP para transferencia de archivos.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 6, "texto": "¿Qué principio de las arquitecturas reactivas se enfoca en que el sistema permanezca responsivo incluso cuando falla alguno de sus componentes?\nA) Elasticity\nB) Responsiveness\nC) Resilience\nD) Scalability\nE) Availability", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 7, "texto": "La capacidad de un sistema reactivo para mantenerse responsivo bajo cargas de trabajo variables se relaciona directamente con el principio de:\nA) Resilience\nB) Message Driven\nC) Responsiveness\nD) Scalability\nE) Elasticity", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 8, "texto": "En una arquitectura reactiva, el principio \"Message Driven\" implica principalmente:\nA) Uso exclusivo de protocolos síncronos.\nB) Comunicación entre componentes a través de mensajes asíncronos y no bloqueantes.\nC) Dependencia directa y fuerte entre los servicios.\nD) Ejecución de todas las operaciones de forma bloqueante.\nE) Uso de bases de datos relacionales únicamente.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 9, "texto": "¿Cuál es una diferencia clave entre la Programación Reactiva y las Arquitecturas Reactivas (Sistemas Reactivos)?\nA) La Programación Reactiva se enfoca en la composición de flujos de datos asíncronos, mientras que las Arquitecturas Reactivas se centran en las propiedades de sistemas distribuidos.\nB) La Programación Reactiva es un subconjunto de las Arquitecturas Reactivas.\nC) Son términos sinónimos que describen lo mismo.\nD) Las Arquitecturas Reactivas solo aplican a sistemas monolíticos.\nE) La Programación Reactiva siempre requiere el uso de actores.", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}, {"numero": 10, "texto": "¿Qué patrón de diseño es comúnmente utilizado en arquitecturas reactivas para desacoplar servicios y facilitar la comunicación asíncrona?\nA) Monolito\nB) Service Locator\nC) Message Broker (Agente de Mensajes)\nD) Direct Procedure Call\nE) Shared Database", "puntaje": 1, "opciones": [{"texto": "Opción A", "valor": "A"}, {"texto": "Opción B", "valor": "B"}, {"texto": "Opción C", "valor": "C"}, {"texto": "Opción D", "valor": "D"}, {"texto": "Opción E", "valor": "E"}], "respuestaSeleccionada": null}], "preguntas_libres": [{"numero": 11, "texto": "Describe cómo se logra la resiliencia y la elasticidad en una arquitectura reactiva, proporcionando ejemplos concretos de patrones de diseño o tecnologías que soportan estos principios.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 12, "texto": "Compara y contrasta las estrategias de manejo de la contrapresión (backpressure) en sistemas basados en flujos reactivos (reactive streams) frente a enfoques más tradicionales de manejo de carga.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 13, "texto": "Analiza los desafíos inherentes a la depuración y monitorización de sistemas distribuidos construidos sobre principios reactivos y propone posibles soluciones o herramientas para abordarlos.", "puntaje": 1, "respuestaAlumno": ""}, {"numero": 14, "texto": "Discute el papel de la comunicación asíncrona y los modelos de actores o basados en mensajes en la habilitación de la escalabilidad y la capacidad de respuesta en arquitecturas reactivas.", "puntaje": 1, "respuestaAlumno": ""}], "casos_uso": [{"numero": 15, "descripcion": "**Escenario:** Una plataforma de comercio electrónico necesita gestionar un gran volumen de pedidos concurrentes y actualizar el inventario en tiempo real, garantizando la consistencia de los datos y evitando la sobreventa.\n\n**Requisitos:**  Desarrollar un sistema reactivo que procese las solicitudes de compra de forma asíncrona, gestione el inventario de forma concurrente y notifique al usuario sobre el estado del pedido en tiempo real.  El sistema debe ser resiliente a picos de tráfico.\n\n**Sugerencias:** Vert.x, Spring WebFlux, Redis.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}, {"numero": 16, "descripcion": "**Escenario:** Una aplicación de chat en tiempo real necesita distribuir mensajes instantáneamente a múltiples usuarios conectados, mostrando las actualizaciones en la interfaz de usuario sin necesidad de refrescar la página.\n\n**Requisitos:**  Crear una aplicación reactiva que utilice WebSockets para la comunicación bidireccional entre el cliente y el servidor,  gestione la presencia de usuarios y permita el envío de mensajes a grupos. El sistema debe ser escalable para un gran número de usuarios concurrentes.\n\n**Sugerencias:**  Ratpack, Socket.IO, Spring WebFlux.", "pregunta": "Desarrolle una solución para el caso descrito anteriormente", "puntaje": 1, "respuestaAlumno": "", "archivoSubido": false}]}, "createdAt": "2025-05-19T09:19:50.107256", "expiration": "2025-05-26T14:19:50.045Z", "publicAccess": true}